{
  "noscript_warning": {
    "other": "Some interactive features will not work with JavaScript disabled."
  },
  "table_of_contents": {
    "other": "Table of Contents"
  },
  "toggle_navigation": {
    "other": "Toggle navigation"
  },
  "tool_instructions": {
    "other": "Tool instructions for this step"
  },
  "warning": {
    "other": "Warning:"
  },
  "trans_inofficial": {
    "other": "You are reading an unofficial translation of the [original page](%s)."
  },
  "trans_available": {
    "other": "Unofficial translations are available in:"
  },
  "and": {
    "other": "and"
  },
  "menu_tutorial": {
    "other": "Get Started"
  },
  "menu_faq": {
    "other": "FAQ"
  },
  "menu_dev": {
    "other": "Developers"
  },
  "menu_spec": {
    "other": "Specification"
  },
  "menu_resources": {
    "other": "Resources"
  },
  "menu_supporters": {
    "other": "Supporters"
  },
  "menu_api": {
    "other": "API"
  },
  "index_intro": {
    "other": "We make licensing easy for humans and machines alike. We solve a fundamental issue that Free Software licensing has at the very source: what license is a file licensed under, and who owns the copyright? **Adopting our recommendations is as easy as one-two-three**!"
  },
  "index_step1": {
    "other": "Choose and provide licenses"
  },
  "index_step2": {
    "other": "Add copyright and licensing information to each file"
  },
  "index_step3": {
    "other": "Confirm REUSE compliance"
  },
  "index_rationale": {
    "other": "Copyright and licensing is difficult, especially when reusing software from different projects that are released under various different licenses. REUSE was started by the [Free Software Foundation Europe](https://fsfe.org) (FSFE) to provide a set of recommendations to make licensing your Free Software projects easier. Not only do these recommendations make it easier for you to declare the licenses under which your works are released, but they also make it easier for a computer to understand how your project is licensed."
  },
  "index_dev_head": {
    "other": "For developers"
  },
  "index_dev_text": {
    "other": "The license of your project sets the terms under which others can reuse your software. That is why you should make sure that it is clear for everyone which parts of your software are under which license. REUSE safeguards your intentions and assists you in this process. Have a look at our [tools section](dev/) to learn about the tool, inclusion in CI/CD processes, and more."
  },
  "index_reuse_head": {
    "other": "Reusing made simple"
  },
  "index_reuse_text": {
    "other": "Free Software enables you to build on top of the work of others and therefore innovate quickly. But the more external components you use, the harder it is to keep an overview of copyright holders and their licensing choices. With REUSE, each file holds the necessary information, and your repo transparently contains all used licenses."
  },
  "index_legal_head": {
    "other": "License compliance"
  },
  "index_legal_text": {
    "other": "There are many tools that aid you in license compliance for software, many using databases and fuzzy heuristics. A REUSE-compliant project makes the jobs of legal experts and compliance officers much easier. Creating a bill of materials can be achieved with just one simple command. REUSE [does not replace other tools](comparison/), it is a long-awaited addition."
  }
}
