{
    "table_of_contents": {
        "other": "Оглавление"
    },
    "toggle_navigation": {
        "other": "Переключатель навигации"
    },
    "warning": {
        "other": "Внимание:"
    },
    "trans_inofficial": {
        "other": "Вы читаете неофициальный перевод [оригинальной страницы](%s)."
    },
    "and": {
        "other": "и"
    },
    "menu_tutorial": {
        "other": "Начать"
    },
    "menu_faq": {
        "other": "ЧАСТО ЗАДАВАЕМЫЕ ВОПРОСЫ"
    },
    "menu_dev": {
        "other": "Разработчики"
    },
    "menu_supporters": {
        "other": "Сторонники"
    },
    "menu_api": {
        "other": "API"
    },
    "index_initiative_by": {
        "other": "Инициатива"
    },
    "index_step1": {
        "other": "Выбор и предоставление лицензий"
    },
    "index_step2": {
        "other": "Добавьте информацию об авторских правах и лицензировании к каждому файлу"
    },
    "index_reuse_head": {
        "other": "Повторное использование - это просто"
    },
    "noscript_warning": {
        "other": "Некоторые интерактивные функции не будут работать при отключенном JavaScript."
    },
    "tool_instructions": {
        "other": "Инструкции по работе с инструментами для этого шага"
    },
    "trans_available": {
        "other": "Неофициальные переводы доступны на:"
    },
    "menu_spec": {
        "other": "Спецификация"
    },
    "menu_resources": {
        "other": "Ресурсы"
    },
    "index_intro": {
        "other": "Мы упрощаем лицензирование как для людей, так и для машин. Мы решаем фундаментальную проблему, которая лежит в основе лицензирования свободного программного обеспечения: под какой лицензией лицензируется файл и кому принадлежат авторские права? **Принять наши рекомендации так же просто, как раз-два-три**!"
    },
    "index_step3": {
        "other": "Подтвердите соответствие требованиям REUSE"
    },
    "index_rationale": {
        "other": "Авторское право и лицензирование - сложная задача, особенно при повторном использовании программ из разных проектов, выпущенных под разными лицензиями. REUSE был создан [Free Software Foundation Europe](https://fsfe.org) (FSFE), чтобы предоставить набор рекомендаций, облегчающих лицензирование ваших проектов свободного программного обеспечения. Эти рекомендации не только облегчают вам декларирование лицензий, под которыми выпускаются ваши работы, но и облегчают компьютеру понимание того, как лицензируется ваш проект."
    },
    "index_dev_head": {
        "other": "Для разработчиков"
    },
    "index_dev_text": {
        "other": "Лицензия вашего проекта определяет условия, на которых другие могут повторно использовать ваше программное обеспечение. Именно поэтому вы должны убедиться, что всем понятно, какие части вашего программного обеспечения находятся под той или иной лицензией. REUSE защищает ваши намерения и помогает вам в этом процессе. Загляните в наш раздел [инструменты](dev/), чтобы узнать об инструменте, включении в процессы CI/CD и многом другом."
    },
    "index_reuse_text": {
        "other": "Свободное программное обеспечение позволяет вам создавать продукты на основе чужих наработок, а значит, быстро внедрять инновации. Но чем больше внешних компонентов вы используете, тем сложнее следить за правообладателями и их лицензионными решениями. С REUSE каждый файл содержит необходимую информацию, а ваше репо прозрачно содержит все используемые лицензии."
    },
    "index_legal_head": {
        "other": "Соблюдение лицензионных требований"
    },
    "index_legal_text": {
        "other": "Существует множество инструментов, которые помогут вам в обеспечении лицензионного соответствия программного обеспечения, многие из них используют базы данных и нечеткую эвристику. Проект, соответствующий требованиям REUSE, значительно облегчает работу юристов и специалистов по соблюдению нормативных требований. Создать спецификацию материалов можно с помощью всего одной простой команды. REUSE [не заменяет другие инструменты](сравнение/), а является долгожданным дополнением."
    }
}
