{
    "noscript_warning": {
        "other": "Деякі інтерактивні функції не працюватимуть з вимкненим JavaScript."
    },
    "tool_instructions": {
        "other": "Інструкції з використання засобу для цього кроку"
    },
    "trans_inofficial": {
        "other": "Ви читаєте неофіційний переклад [оригінальної сторінки](%s)."
    },
    "and": {
        "other": "і"
    },
    "menu_tutorial": {
        "other": "Початок роботи"
    },
    "menu_faq": {
        "other": "ЧаП"
    },
    "menu_dev": {
        "other": "Розробникам"
    },
    "index_intro": {
        "other": "Ми полегшуємо ліцензування як для людей, так і для машин. Ми розв'язуємо фундаментальне питання, які ліцензії вільного програмного забезпечення мітиться в самому джерелі: якою ліцензією захищено файл і хто володіє авторськими правами? **Застосувати наші поради можна завиграшки**!"
    },
    "index_step1": {
        "other": "Виберіть і вкажіть ліцензії"
    },
    "index_step2": {
        "other": "Додайте дані про авторські права та ліцензії до кожного файлу"
    },
    "index_step3": {
        "other": "Підтвердьте відповідність REUSE"
    },
    "index_dev_head": {
        "other": "Для розробників"
    },
    "index_reuse_head": {
        "other": "Повторне використовування зроблено простим"
    },
    "index_legal_head": {
        "other": "Відповідність ліцензії"
    },
    "index_rationale": {
        "other": "Авторське право та ліцензування складні, особливо за повторного використовування програмного забезпечення з різних проєктів, яке випускаються під різними ліцензіями. REUSE був започаткований Фондом вільного програмного забезпечення в Європі (https://fsfe.org) (FSFE), щоб надати набір порад для полегшення ліцензування ваших проєктів вільного програмного забезпечення. Ці поради не лише полегшують вам указання ліцензій, за якими випускаються ваші роботи, але й полегшують комп'ютеру розуміння якою ліцензією захищено ваш проєкт."
    },
    "trans_available": {
        "other": "Неофіційні переклади доступні такими мовами:"
    },
    "warning": {
        "other": "Попередження:"
    },
    "menu_api": {
        "other": "API"
    },
    "table_of_contents": {
        "other": "Зміст"
    },
    "toggle_navigation": {
        "other": "Перемкнути навігацію"
    },
    "menu_spec": {
        "other": "Специфікація"
    },
    "menu_resources": {
        "other": "Ресурси"
    },
    "menu_supporters": {
        "other": "Прихильники"
    },
    "index_dev_text": {
        "other": "Ліцензія вашого проєкту визначає умови, за яких інші можуть повторно використовувати ваше програмне забезпечення. Ось чому ви повинні переконатися, що всім буде зрозуміло, якою ліцензією захищені ті чи інші частини вашого програмного забезпечення. REUSE оберігає ваші зусилля та допомагає вам у цьому процесі. Перегляньте наш [розділ про засоби](dev/), щоб дізнатися про інструмент, про включення у процеси CI/CD тощо."
    },
    "index_reuse_text": {
        "other": "Вільне програмне забезпечення дає вам змогу надбудовувати роботу інших і, отже, швидко впроваджувати інновації. Але чим більше зовнішніх компонентів ви використовуєте, тим важче розуміти хто власники авторських прав та які ліцензії вони обрали. За допомогою REUSE кожен файл міститиме необхідні дані, а ваш репозиторій прозоро міститиме всі використані ліцензії."
    },
    "index_legal_text": {
        "other": "Існують багато інструментів, які допомагають вам узгоджувати ліцензії на програмне забезпечення, багато з яких використовують бази даних та нечітку евристику. Проєкт, сумісний з REUSE, значно полегшує роботу юридичних експертів та посадовців, котрі визначають відповідність ліцензій. Створення векселя матеріалів можна досягти лише за допомогою однієї простої команди. REUSE [не замінює інші засоби](comparison/), а є довгоочікуваним доповненням."
    }
}
