Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: You should ensure all files in your project have a license header, and that all license headers files have the same format. Even if your project has a license header which looks different from other projects, it helps to have a consistent style to the header. It's important you do not remove information in existing headers, though.
cs: Měli byste zajistit, aby všechny soubory ve vašem projektu měly hlavičku licence a aby všechny soubory hlavičky licencí měly stejný formát. I když má váš projekt hlavičku licence, která vypadá odlišně od ostatních projektů, pomůže vám mít konzistentní styl hlavičky. Je však důležité, abyste neodstranili informace ze stávajících záhlaví.
uk: Ви повинні переконатися, що всі файли у вашому проєкті мають ліцензійний заголовок, і що всі файли ліцензійних заголовків мають однаковий формат. Навіть якщо ваш проєкт має заголовок ліцензії, який має інший вигляд, ніж в інших проєктах, корисно дотримуватися єдиного стилю заголовка. Важливо, щоб ви не видаляли інформацію в наявних заголовках.

source: Source code files are often reused across multiple projects, taken from their origin and repurposed, or otherwise end up in repositories where they are separate from its origin. Each file should, therefore, have enough information in itself to convey copyright information.
cs: Soubory zdrojového kódu jsou často znovu použity ve více projektech, převzaty z jejich původu a znovu použít, nebo jinak skončí v úložištích, kde jsou oddělené od svého původu. Každý soubor by proto měl sám o sobě obsahovat dostatek informací k přenosu informací o autorských právech.
uk: Файли початкового коду часто повторно використовуються в декількох проєктах, беруться зі свого джерела і перепризначаються, або іншим чином потрапляють у репозиторії, де вони відокремлені від свого джерела. Отже, кожен файл повинен містити достатньо інформації, щоб передати інформацію про авторське право.

source: Your license header should contain copyright notices, an `SPDX-License-Identifier` following the SPDX standard, and a `License-Filename` tag following the REUSE practices.
cs: Vaše hlavička licence by měla obsahovat upozornění na autorská práva, `SPDX-License-Identifier` podle standardu SPDX a značku `License-Filename` podle postupů REUSE.
uk: Заголовок вашої ліцензії має містити повідомлення про авторські права, `SPDX-License-Identifier` відповідно до стандарту SPDX та тег `License-Filename` відповідно до практики REUSE.

source: Copyright notices in a license header should have a consistent format and be sorted by year. They should list the actual copyright holder, which may be an organisation rather than the author. For example:
cs: Upozornění na autorská práva v záhlaví licence by měla mít konzistentní formát a měla by být seřazena podle roku. Měli by uvádět skutečného držitele autorských práv, kterým může být spíše organizace než autor. Například:
uk: Повідомлення про авторські права в заголовку ліцензії повинні мати однаковий формат і бути відсортовані за роками. Вони повинні вказувати фактичного власника авторських прав, яким може бути організація, а не автор. Наприклад:

source: /* * Copyright (c) 2017 Alice Commit <alice@example.com> * Copyright (c) 2009-2016 Bob Denver <bob@example.com> * Copyright (c) 2007 Company Example <charlie@example.com> * * SPDX-License-Identifier: BSD-2-Clause * License-Filename: LICENSES/BSD-2-Clause_Charlie.txt */
uk: /* * Авторське право (c) 2017 Аліса Комміт <alice@example.com> * Авторське право (c) 2009-2016 Боб Денвер <bob@example.com> * Авторське право (c) 2007 Приклад Компанії <charlie@example.com> * * SPDX-License-Identifier: BSD-2-Clause * License-Filename: LICENSES/BSD-2-Clause_Charlie.txt */

source: The `License-Filename` tag shall be a persistent URL or a filename in the repository where the actual license text is available. This is more accurate than the SPDX license identifier and ensures the full license text is always referenced from the individual source file. The tag can be repeated if multiple license files are relevant.
cs: Značka `License-Filename` musí být trvalá adresa URL nebo název souboru v úložišti, kde je k dispozici skutečný text licence. To je přesnější než identifikátor licence SPDX a zajišťuje, že se na úplný text licence vždy odkazuje z jednotlivého zdrojového souboru. Značku lze opakovat, pokud je relevantních více licenčních souborů.
uk: Тег `License-Filename` має бути постійною URL-адресою або назвою файлу у репозиторії, де доступний фактичний текст ліцензії. Це точніше, ніж ідентифікатор ліцензії SPDX, і гарантує, що на повний текст ліцензії завжди можна посилатися з окремого початкового файлу. Тег можна повторити, якщо йдеться про кілька файлів ліцензії.

source: You should include information about your project's practices in the README or similar file.
cs: Informace o postupech projektu byste měli uvést v souboru README nebo podobném souboru.
uk: Ви повинні включити інформацію про практику вашого проєкту в файл README або подібний до нього.

source: If your project includes binaries or source code files in which comments can not be placed, you should provide them separately in one of two ways:
cs: Pokud váš projekt obsahuje binární soubory nebo zdrojové kódy, do kterých nelze vkládat komentáře, měli byste je poskytnout samostatně jedním ze dvou způsobů:
uk: Якщо ваш проєкт містить двійкові файли або файли початкового коду, в яких не можна розміщувати коментарі, ви повинні надати їх окремо одним з двох способів:

source: If you have files with different copyright notices and licenses, you should, for each file named `FILENAME`, include the text file `FILENAME.license` which includes a copyright header according to the format you customarily use for headers.
cs: Pokud máte soubory s různými upozorněními na autorská práva a licencemi, měli byste pro každý soubor s názvem `FILENAME` zahrnout textový soubor `FILENAME.license`, který obsahuje hlavičku o autorských právech v souladu s formátem, který obvykle používáte pro hlavičky.
uk: Якщо у вас є файли з різними повідомленнями про авторські права і ліцензіями, ви повинні для кожного файлу з ім'ям `FILENAME` додати текстовий файл `FILENAME.license`, який містить заголовок про авторські права відповідно до формату, який ви зазвичай використовуєте для заголовків.

source: If you have many such files, but each have the same copyright notice and license, you may instead use the [DEP-5/copyright](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/) file format, and place a single copyright file documenting those files.
cs: Pokud máte mnoho takových souborů, ale každý z nich má stejnou poznámku o autorských právech a licenci, můžete místo toho použít formát souboru [DEP-5/copyright](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/) a umístit jediný soubor s autorskými právy dokumentující tyto soubory.
uk: Якщо у вас багато таких файлів, але кожен з них має однакове повідомлення про авторські права та ліцензію, ви можете замість цього використовувати [DEP-5/copyright](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/) файловий формат, і розмістити єдиний файл з авторським правом, що документує ці файли.

source: If you wish to be explicit about the license of an output file, which does not exist in the repository but which will be created at build time, you may include a `.license` file without the corresponding binary file.
cs: Pokud si přejete explicitně uvést licenci výstupního souboru, který v úložišti neexistuje, ale který bude vytvořen v době sestavení, můžete připojit soubor `.license` bez odpovídajícího binárního souboru.
uk: Якщо ви хочете чітко зазначити ліцензію файлу виводу, якого не існує у репозиторії, але який буде створено під час збирання, ви можете включити файл `.license` без відповідного бінарного файлу.

source: You may record information about copyright by relying on the underlying version control system you're using, but special care must be taken if you do. Keep in mind version control systems typically record authorship, not copyright.
cs: Informace o autorských právech můžete zaznamenávat na základě systému správy verzí, který používáte, ale je třeba dbát zvláštní opatrnosti. Mějte na paměti, že systémy pro správu verzí obvykle zaznamenávají autorství, nikoli autorská práva.
uk: Ви можете записувати інформацію про авторські права, покладаючись на базову систему керування версіями, яку ви використовуєте, але при цьому слід бути особливої обережними. Зауважте, що системи керування версіями зазвичай фіксують авторство, а не авторські права.

source: For a project using the version control system to convey information about copyright, you must:
cs: Pro projekt využívající systém správy verzí k přenosu informací o autorských právech musíte:
uk: Для проєкту, що використовує систему керування версіями, передавати інформацію про авторське право потрібно обов'язково:

source: make sure the version control system is publicly accessible and take steps[^3] to ensure it will remain so,
cs: ujistěte se, že je systém správy verzí veřejně přístupný a podnikněte kroky[^3], aby tomu tak zůstalo,
uk: переконайтеся, що система керування версіями загальнодоступна, і зробіть кроки[^3], щоб вона залишалася такою й надалі,

source: provide a link back to the original file in version control from each header,
cs: poskytnout odkaz zpět na původní soubor ve správě verzí z každé hlavičky,
uk: у кожному заголовку додайте посилання на оригінальний файл у керуванні версіями,

source: ensure that if someone copies the source repository without version control system metadata (such as if they make a tar-file of it), then the version control system metadata relevant for determining copyright must still be included, for example in the form of a bill of material (see later), an automatically generated log file or similar,
cs: zajistit, že pokud někdo zkopíruje zdrojový repozitář bez metadat systému správy verzí (například když z toho vytvoří soubor tar), pak metadata systému správy verzí relevantní pro určení autorských práv musí být stále zahrnuta, například ve formě soupisky (viz dále), automaticky generovaný soubor protokolu nebo podobně,
uk: переконайтеся, що якщо хтось копіює початковий репозиторій без метаданих системи керування версіями (наприклад, якщо вони створюють tar-файл), то метадані системи керування версіями, важливі для визначення авторських прав, усе одно мають бути включені, наприклад, у вигляді специфікації (див. далі), автоматично згенерованого файлу журналу або подібним чином,

source: make sure the commit metadata reflect the actual copyright (this is particularly important if a project accepts code contributed through mailing lists, bug trackers, or similar, where the original copyright holder is not the one pushing code to version control, or where the copyright is held by an organisation rather than the author.)
cs: ujistěte se, že předložená metadata odrážejí skutečná autorská práva (to je zvláště důležité, pokud projekt přijímá kód přidaný prostřednictvím e-mailových konferencí, sledovačů chyb nebo podobně, kde původní držitel autorských práv není tím, kdo posílá kód do kontroly verzí, nebo kde jsou autorská práva v držení organizace, nikoli autora.)
uk: переконайтеся, що метадані коміту відображають реальні авторські права (це особливо важливо, якщо проєкт приймає код, внесений через списки розсилки, баг-трекери тощо, де первинний власник авторських прав не є тим, хто відправляє код до керування версіями, або де авторські права належать організації, а не автору.)

source: An appropriate header in this case would be:
cs: Vhodné záhlaví by v tomto případě bylo:
uk: Доречним заголовком у цьому випадку буде такий:

source: /* * This file is part of project X. It's copyrighted by the contributors * recorded in the version control history of the file, available from * its original location http://git.example.com/X/filename.c * * SPDX-License-Identifier: BSD-2-Clause * License-Filename: LICENSES/BSD-2-Clause_Charlie.txt */
cs: /* * Tento soubor je součástí projektu X. Je chráněn autorskými právy přispěvatelů * zaznamenané v historii správy verzí souboru, dostupné z * jeho původní umístění http://git.example.com/X/název souboru.c * * SPDX-License-Identifier: BSD-2-Clause * Název licenčního souboru: LICENSES/BSD-2-Clause_Charlie.txt */
uk: /* * Цей файл є частиною проєкту X. Він захищений авторським правом авторів * записаних в історії контролю версій файлу, яка доступна за адресою * його первісного розташування http://git.example.com/X/filename.c * * SPDX-License-Identifier: BSD-2-Clause * License-Filename: LICENSES/BSD-2-Clause_Charlie.txt */

source: > ### Keep in mind > > * Use a consistent style of your headers throughout the project. > * Don't remove existing headers, but only add to them. > * Do consider using version control systems to keep a record of copyright holders. > * Do keep your version control system public if you use it. > * Make references to the license text and the SPDX identifier from each source code file. > * Include license and copyright information also for files which can not include a proper header, either in a separate .license file, or using the DEP-5/copyright specification.
cs: > ### Mějte na paměti > > * Používejte konzistentní styl záhlaví v celém projektu. > * Neodstraňujte existující záhlaví, ale pouze k nim přidávejte. > * Zvažte použití systémů pro správu verzí k vedení záznamů o držitelích autorských práv. > * Udržujte svůj systém správy verzí veřejný, pokud jej používáte. > * Uveďte odkazy na text licence a identifikátor SPDX z každého souboru zdrojového kódu. > * Zahrňte informace o licenci a autorských právech také pro soubory, které nemohou obsahovat správné záhlaví, buď v samostatném souboru .licence, nebo pomocí specifikace DEP-5/copyright.
uk: > ### Пам'ятайте > > * Використовуйте єдиний стиль заголовків в усьом проєкті. > * Не видаляйте наявні заголовки, а лише додавайте їх. > * Розгляньте можливість використовувати системи керування версіями для ведення обліку власників авторських прав. > * Якщо ви використовуєте систему керування версіями, робіть її загальнодоступною. > * Зробіть посилання на текст ліцензії та ідентифікатор SPDX у кожному файлі вихідного коду. > * Включіть інформацію про ліцензію та авторські права також для файлів, які не можуть містити належного заголовка, або в окремому файлі .license, або використовуючи специфікацію DEP-5/copyright.

source: [^3]: Establish project governance committed to public access, vet material added to project to protect against vulnerability to takedown, only include material under a free and open source license so it can be copied and archived freely and ensure project is archived by institutions dedicated to long-term preservation of software code, eg. Software Heritage.
cs: [^3]: Zaveďte správu projektu, která se zavazuje k veřejnému přístupu, do projektu se přidává materiál veterináře, aby se chránil před zranitelností při zastavení šíření, zahrňte materiál pouze pod svobodnou licencí s otevřeným zdrojovým kódem, aby jej bylo možné volně kopírovat a archivovat a zajistit, aby byl projekt archivován institucemi věnované dlouhodobému uchování softwarového kódu, např. Softwarové dědictví.
uk: [^3]: Встановіть управління проєктом, орієнтоване на публічний доступ, перевіряйте матеріали, що додаються до проєкту, щоб захистити їх від вразливості до вилучення, включайте лише матеріали під вільною та відкритою ліцензією, щоб їх можна було вільно копіювати та архівувати, а також забезпечте архівування проєкту в установах, що займаються довгостроковим збереженням програмного коду, наприклад, у Software Heritage.

source: 3. Provide an inventory for included software
cs: 3. Poskytněte soupis dodaného softwaru
uk: 3. Надайте інвентаризацію програмного забезпечення, що входить до комплекту

source: Aside from the license files included in the project, and the file level copyright information, you may include a bill of material for your project, but you should only do so if this is generated automatically.
cs: Kromě licenčních souborů zahrnutých v projektu a informací o autorských právech na úrovni souboru můžete zahrnout soupisku pro svůj projekt, ale měli byste tak učinit pouze v případě, že je generována automaticky.
uk: Окрім файлів ліцензій, включених до проєкту, та інформації про авторські права на рівні файлів, ви можете включити до проєкту специфікацію матеріалів, але це слід робити лише у тому випадку, якщо вона згенерована автоматично.

source: A bill of material can be very complicated and lengthy, making it difficult to maintain. If you do not generate it automatically, it's very likely someone will forget to update it when making changes. In these cases, it's best not to have a bill of material, but to rely only on the information coupled with the source code files.
cs: Soupiska může být velmi komplikovaná a zdlouhavá, což ztěžuje její údržbu. Pokud ji nevygenerujete automaticky, je velmi pravděpodobné, že ji někdo při provádění změn zapomene aktualizovat. V těchto případech je nejlepší nemít soupisku, ale spoléhat se pouze na informace spojené se soubory zdrojového kódu.
uk: Специфікація матеріалів може бути дуже складною і довгою, що ускладнює її ведення. Якщо ви не генеруєте її автоматично, дуже ймовірно, що хтось забуде оновити її вносячи зміни. У таких випадках, краще не мати специфікацію матеріалів, а покладатися лише на інформацію в поєднанні з файлами початкового коду.

source: If you do have a way of automatically creating a bill of material, and if you choose to do so, you should generate it automatically from the most reliable information you have about each file in your project. This includes copyright information kept in version control systems and licenses on files which include a standard header, or which includes the header in a separate license file.
cs: Pokud máte způsob, jak automaticky vytvořit soupisku, a pokud se tak rozhodnete, měli byste ji vygenerovat automaticky z nejspolehlivějších informací, které máte o každém souboru ve svém projektu. To zahrnuje informace o autorských právech uchovávané v systémech správy verzí a licence na soubory, které obsahují standardní záhlaví nebo které obsahují záhlaví v samostatném licenčním souboru.
uk: Якщо у вас є можливість автоматично створювати специфікацію матеріалів, і якщо ви вирішите це зробити, вам слід генерувати її автоматично на основі найперевіренішої інформації про кожен файл у вашому проєкті. Сюди входить інформація про авторське право, що зберігається в системах керування версіями, а також ліцензії на файли, які містять стандартний заголовок або заголовок в окремому файлі ліцензії.

source: You may also choose to include in the bill of material your output files generated when compiling the project, such that you can signal through the bill of material, which license is relevant for the output files depending on the included source code.
cs: Můžete se také rozhodnout zahrnout do soupisky své výstupní soubory vygenerované při kompilaci projektu, abyste mohli prostřednictvím soupisky uvést, která licence je relevantní pro výstupní soubory v závislosti na zahrnutém zdrojovém kódu.
uk: Ви також можете включити до переліку матеріалів ваші виведені файли, згенеровані під час компілювання проєкту, щоб за допомогою переліку матеріалів ви могли вказати, яка ліцензія застосовується до виведених файлів, залежно від включеного початкового коду.

source: The bill of material should be conformant to the SPDX specification and included in a file in the top level directory of your repository called `LICENSE.spdx`.
cs: Soupis materiálů by měl být v souladu se specifikací SPDX a měl by být obsažen v souboru v adresáři nejvyšší úrovně vašeho úložiště s názvem `LICENSE.spdx`.
uk: Перелік матеріалів має відповідати специфікації SPDX і міститися у файлі в каталозі верхнього рівня вашого репозиторію під назвою `LICENSE.spdx`.

source: > ### Keep in mind > > * Don't create a bill of material if you can't generate it automatically. > * If you generate one automatically, it's helpful to include one. > * Make your bill of material conformant to the SPDX specification. > * It doesn't hurt to run your project through ScanCode or FOSSology, to make sure these tools can parse and understand your project's licensing.
cs: > ### Mějte na paměti > > * Nevytvářejte kusovník, pokud jej nemůžete vygenerovat automaticky. > * Pokud jej generujete automaticky, je užitečné jej přiložit. > * Vytvořte kusovník v souladu se specifikací SPDX. > * Není na škodu projít projekt programem ScanCode nebo FOSSology, abyste se ujistili, že tyto nástroje dokáží analyzovat a pochopit licencování vašeho projektu.
uk: > ### Пам'ятайте > > * Не створюйте специфікацію матеріалів, якщо ви не можете згенерувати її автоматично. > * Якщо ви генеруєте її автоматично, корисно включати її. > * Приведіть свою специфікацію матеріалів у відповідність до специфікації SPDX. > * Не завадить прогнати ваш проєкт через ScanCode або FOSSology, щоб переконатися, що ці інструменти можуть проаналізувати і зрозуміти ліцензування вашого проєкту.

source: REUSE Practices – Version 2.0
cs: Postupy REUSE - verze 2.0
uk: Практики REUSE - версія 2.0

source: Free and open source software licenses are standardised and have standard texts. Regardless of which license you use, you should include the license text in your project.
cs: Licence svobodného a otevřeného softwaru jsou standardizované a mají standardní texty. Bez ohledu na to, jakou licenci používáte, měli byste text licence do svého projektu zahrnout.
uk: Ліцензії на вільне та відкрите програмне забезпечення стандартизовані та мають стандартні тексти. Незалежно від того, яку ліцензію ви використовуєте, ви повинні включити текст ліцензії у свій проєкт.

source: The easiest way to make sure that you provide an unchanged license is by copying it verbatim from [this repository of licenses](https://github.com/spdx/license-list) maintained by the SPDX Workgroup. The SPDX Workgroup maintains a [list of commonly-used licenses][spdx-licenses]. Each license has a shorthand name (called an SPDX identifier) that can be used to uniquely reference each license. For instance, the GNU GPL version 3 has `GPL-3.0` as shorthand identifier.
cs: Nejjednodušší způsob, jak zajistit, že poskytnete nezměněnou licenci, je její doslovné zkopírování z [this repository of licenses](https://github.com/spdx/license-list) spravovaného SPDX Workgroup. SPDX Workgroup spravuje [list of commonly-used licenses][spdx-licenses]. Každá licence má zkrácený název (tzv. identifikátor SPDX), který lze použít k jedinečnému odkazování na každou licenci. Například GNU GPL verze 3 má `GPL-3.0` jako zkrácený identifikátor.
uk: Найпростіший спосіб переконатися, що ви надаєте незмінну ліцензію, — дослівно скопіювати її з [цього репозиторію ліцензій](https://github.com/spdx/license-list), що підтримується робочою групою SPDX. Робоча група SPDX підтримує [список загальновживаних ліцензій][spdx-licenses]. Кожна ліцензія має скорочену назву (так званий ідентифікатор SPDX), яку можна використовувати для унікального посилання на кожну ліцензію. Наприклад, GNU GPL версії 3 має `GPL-3.0` як скорочений ідентифікатор.
