Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: If a file is not a plain text file or does not permit the inclusion of comments, the comment header that declares the file's Copyright and Licensing Information SHOULD be in an adjacent file of the same name with the additional extension `.license` (example: `cat.jpg.license` if the original file is `cat.jpg`).
cs: Pokud soubor není prostým textovým souborem nebo neumožňuje vkládání komentářů, záhlaví komentáře, které deklaruje autorská práva a licenční informace souboru, MUSÍ být v sousedním souboru stejného jména s dodatečnou příponou `.license` (příklad: `cat.jpg.license`, pokud je původní soubor `cat.jpg`).
ru: Если файл не является обычным текстовым файлом или не позволяет включать комментарии, заголовок комментария, объявляющий авторские права и лицензионную информацию файла, ДОЛЖЕН находиться в соседнем одноименном файле с дополнительным расширением `. лицензия` (пример: `cat.jpg. лицензия`, если исходный файл - `cat.jpg`).
uk: Якщо файл не є звичайним текстовим файлом або не дозволяє включати коментарі, заголовок коментаря, який оголошує відомості про авторські права та ліцензування файлу, ПОВИНЕН бути в суміжному файлі з тією самою назвою з додатковим розширенням `.license`. (приклад: `cat.jpg.license`, якщо джерельний файл — `cat.jpg`).

source: The comment header MUST contain one or more `SPDX-FileCopyrightText` tags, and one or more `SPDX-License-Information` tags. A tag is followed by a colon, followed by a text value, and terminated by a newline.
cs: Záhlaví komentáře MUSÍ obsahovat jednu nebo více značek `SPDX-FileCopyrightText` a jednu nebo více značek `SPDX-License-Information`. Za značkou následuje dvojtečka, za ní textová hodnota a je ukončena novým řádkem.
uk: Заголовок коментаря ПОВИНЕН містити один або більше тегів `SPDX-FileCopyrightText` та один або більше тегів `SPDX-License-Information`. Після тегу ставиться двокрапка, за якою йде текстове значення, і завершується тег новим рядком.

source: The `SPDX-FileCopyrightText` tag MUST be followed by a copyright notice as described in <!-- FIXME: Refer to an internal section -->.
cs: Za tagem `SPDX-FileCopyrightText` MUSÍ následovat upozornění na autorská práva, jak je popsáno v <!-- FIXME: Viz interní část -->.
uk: Тег `SPDX-FileCopyrightText` ПОВИНЕН супроводжуватися повідомленням про авторські права, як описано у <!-- FIXME: Refer to an internal section -->.

source: Instead of the `SPDX-FileCopyrightText` tag, the symbol `©`, or the word `Copyright` MAY be used, in which case a colon is not needed.
cs: Místo značky `SPDX-FileCopyrightText` lze použít symbol `©` nebo slovo `Copyright`; v takovém případě není dvojtečka nutná.
ru: Вместо тега `SPDX-FileCopyrightText` может быть использован символ `©` или слово `Копирайт`, в этом случае двоеточие не требуется.
uk: Замість тегу `SPDX-FileCopyrightText` МОЖЕ застосовуватися символ `©` або слово `Copyright`, і в цьому випадку двокрапка не потрібна.

source: The `SPDX-License-Identifier` tag MUST be followed by a valid SPDX License Expression describing the licensing of the file (example: `SPDX-License-Identifier: GPL-3.0-or-later OR Apache-2.0`). If separate sections of the file are licensed differently, a different `SPDX-License-Identifier` tag MUST be included for each section.
cs: Za značkou `SPDX-License-Identifier` MUSÍ následovat platné vyjádření licence SPDX popisující licencování souboru (příklad: `SPDX-License-Identifier: GPL-3.0-or-later OR Apache-2.0`). Pokud jsou jednotlivé části souboru licencovány odlišně, MUSÍ být pro každou část uveden jiný tag `SPDX-License-Identifier`.
ru: За тегом `SPDX- Лицензия-Идентификатор` ДОЛЖНО следовать действительное выражение лицензии SPDX, описывающее лицензирование файла (пример: `SPDX-Лицензия-Идентификатор: GPL-3.0-or-later ИЛИ Apache-2.0`). Если отдельные секции файла лицензируются по-разному, для каждой секции должен быть включен отдельный тег `SPDX- Лицензия-Идентификатор`.
uk: Тег `SPDX-License-Identifier` ПОВИНЕН супроводжуватися дійсним виразом ліцензії SPDX, що описує ліцензування файлу (наприклад: `SPDX-License-Identifier: GPL-3.0-or-later OR Apache-2.0`). Якщо окремі розділи файлу ліцензуються по-різному, для кожного розділу ПОВИНЕН бути включено свій тег `SPDX-License-Identifier`.

source: An example of a comment header:
cs: Příklad záhlaví komentáře:
ru: Пример заголовка комментария:
uk: Приклад заголовка коментаря:

source: Alternatively, Copyright and Licensing Information MAY be associated with a file through a DEP5 file. The intended use case of this method is large directories where including a comment header in each file (or in `.license` companion files) is impossible or undesirable.
cs: Informace o autorských právech a licencích mohou být k souboru přiřazeny také prostřednictvím souboru DEP5. Předpokládaným případem použití této metody jsou rozsáhlé adresáře, kde je zahrnutí záhlaví komentáře do každého souboru (nebo do doprovodných souborů `.license`) nemožné nebo nežádoucí.
ru: В качестве альтернативы, информация об авторских правах и лицензировании МОЖЕТ быть связана с файлом через файл DEP5. Предполагается использовать этот метод в больших каталогах, где включение заголовка комментария в каждый файл (или в файлы-компаньоны `. лицензия`) невозможно или нежелательно.
uk: Крім того, відомості про авторські права та ліцензування МОЖУТЬ бути пов'язані з файлом через файл DEP5. Передбачуваний випадок використання цього методу — великі каталоги, до яких включення заголовка коментаря в кожен файл (або в супутні файли `.license`) неможливе або небажане.

source: The DEP5 file MUST be named `dep5` and stored in the `.reuse/` directory in the root of the Project (i.e. `.reuse/dep5`).
cs: Soubor DEP5 MUSÍ být pojmenován `dep5` a uložen v adresáři `.reuse/` v kořenovém adresáři projektu (tj. `.reuse/dep5`).
ru: Файл DEP5 ДОЛЖЕН иметь имя `dep5` и храниться в директории `.reuse/` в корне проекта (т.е. `.reuse/dep5`).
uk: Файл DEP5 ПОВИНЕН мати назву `dep5` і зберігатися в каталозі `.reuse/` у корені проєкту (тобто `.reuse/dep5`).

source: The `License` tag MUST be followed by a valid SPDX License Expression describing the licensing of the associated files.
cs: Za značkou `License` MUSÍ následovat platné vyjádření licence SPDX popisující licencování přidružených souborů.
ru: За тегом `Лицензия` ДОЛЖНО следовать действительное выражение SPDX Лицензия, описывающее лицензирование связанных файлов.
uk: За тегом `License` ПОВИНЕН слідувати дійсний вираз ліцензії SPDX, що описує ліцензування пов’язаних файлів.

source: The `Copyright` tag MUST be followed by a copyright notice as described in <!-- FIXME: Refer to an internal section -->.
cs: Za značkou `Copyright` MUSÍ následovat upozornění o autorských právech, jak je popsáno v <!-- FIXME: Refer to an internal section -->.
uk: Тег `Copyright` ПОВИНЕН супроводжуватися повідомленням про авторські права, як описано в <!-- FIXME: Refer to an internal section -->.

source: An example of a DEP5 file:
cs: Příklad souboru DEP5:
ru: Пример файла DEP5:
uk: Приклад файлу DEP5:

source: Format of copyright notices
cs: Formát oznámení o autorských právech
ru: Формат уведомлений об авторских правах
uk: Формат повідомлень про авторські права

source: A copyright notice MUST be prefixed by a tag, symbol or word denoting a copyright notice as described in this specification.
cs: Oznámení o autorských právech MUSÍ být opatřeno předponou, symbolem nebo slovem označujícím oznámení o autorských právech, jak je popsáno v této specifikaci.
ru: Уведомление об авторских правах ДОЛЖНО иметь префикс в виде метки, символа или слова, обозначающего уведомление об авторских правах, как описано в данной спецификации.
uk: Повідомлення про авторські права МАЄ передбачати тег, символ або слово, що позначає повідомлення про авторські права, як описано у цій специфікації.

source: The copyright notice MUST contain the name of the copyright holder. The copyright notice SHOULD contain the year of publication and the contact address of the copyright holder. The order of these items SHOULD be: year, name, contact address.
cs: Oznámení o autorských právech MUSÍ obsahovat jméno držitele autorských práv. Oznámení o autorských právech MUSÍ obsahovat rok vydání a kontaktní adresu držitele autorských práv. Pořadí těchto položek MUSÍ být následující: rok, jméno, kontaktní adresa.
ru: Уведомление об авторских правах ДОЛЖНО содержать имя правообладателя. Уведомление об авторских правах ДОЛЖНО содержать год публикации и контактный адрес правообладателя. Порядок этих пунктов ДОЛЖЕН быть следующим: год, имя, контактный адрес.
uk: Повідомлення про авторські права ПОВИННО містити ім'я власника авторських прав. Повідомлення про авторські права ПОВИННО містити рік публікації та контактну адресу власника авторських прав. Порядок цих повинен бути таким: рік, ім'я, контактна адреса.

source: The year of publication MAY be a single year, multiple years, or a span of years.
cs: Rok vydání MŮŽE být jeden rok, více let nebo období několika let.
ru: Год публикации МОЖЕТ быть одним годом, несколькими годами или промежутком лет.
uk: Рік публікації МОЖЕ бути один рік, кілька років, або проміжок років.

source: The copyright holder MAY be an individual, list of individuals, group, legal entity, or any other descriptor by which one can easily identify the copyright holder(s).
cs: Držitelem autorských práv MŮŽE být fyzická osoba, seznam fyzických osob, skupina, právnická osoba nebo jakýkoli jiný deskriptor, podle kterého lze snadno identifikovat držitele autorských práv.
ru: Владелец авторских прав МОЖЕТ быть отдельным лицом, списком лиц, группой, юридическим лицом или любым другим описанием, по которому можно легко определить владельца(ов) авторских прав.
uk: Власником авторських прав МОЖЕ бути фізична особа, список осіб, група, юридична особа або будь-який інший дескриптор, за яким можна легко ідентифікувати власника(ів) авторських прав.

source: Any contact address SHOULD be in between angle brackets.
cs: Jakákoli kontaktní adresa by měla být v hranatých závorkách.
ru: Любой контактный адрес ДОЛЖЕН быть заключен в угловые скобки.
uk: Будь-яка контактна адреса ПОВИННА розміщуватися між кутовими дужками.

source: Examples of valid copyright notices:
cs: Příklady platných upozornění na autorská práva:
ru: Примеры действительных уведомлений об авторских правах:
uk: Приклади правильних повідомлень про авторські права:

source: REUSE Specification – Version 3.2
cs: Specifikace REUSE - verze 3.2
uk: Специфікація REUSE - версія 3.2

source: This specification defines a standardised method for declaring copyright and licensing for software projects. The goal of the specification is to have comprehensive, unambiguous, human- and machine-readable copyright and licensing information for each individual file in a project. Ideally this information is embedded into every file, so that the information is preserved when the file is copied and reused by third parties.
cs: Tato specifikace definuje standardizovanou metodu pro deklarování autorských práv a licencování softwarových projektů. Cílem specifikace je mít komplexní, jednoznačné, člověkem i strojově čitelné informace o autorských právech a licencích pro každý jednotlivý soubor v projektu. V ideálním případě jsou tyto informace vloženy do každého souboru, takže informace jsou zachovány, když je soubor zkopírován a znovu použit třetími stranami.
uk: Ця специфікація визначає стандартизований метод декларування авторських прав та ліцензування програмних проєктів. Мета специфікації — отримати вичерпну, однозначну, зрозумілу для людини та машини інформацію про авторські права та ліцензування для кожного окремого файлу в проєкті. Найкраще, щоб ця інформація вбудовувалася в кожен файл, щоб інформація зберігалася під час копіювання та повторного використання файлу третіми особами.

source: REUSE Tool --- helper tool for compliance with this specification; available at <https://github.com/fsfe/reuse-tool>.
uk: REUSE Tool --- допоміжний інструмент для дотримання цієї специфікації; доступний за адресою <https://github.com/fsfe/reuse-tool>.

source: License File --- a file containing the text of a license, as defined in [License Files](#license-files).
cs: Licenční soubor --- soubor obsahující text licence, jak je definováno v [Licenční soubory](#license-files).
uk: Файл ліцензії --- файл, що містить текст ліцензії, як визначено у [Файлах ліцензій](#license-files).

source: Licensing Information --- the information that lists the copyright holders of a file or work, and describes under which licenses the file or work is made available.
cs: Licenční informace --- informace, které obsahují seznam držitelů autorských práv k souboru nebo dílu a popisují, pod jakými licencemi je soubor nebo dílo zpřístupněno.
uk: Інформація про ліцензування --- інформація, яка містить перелік власників авторських прав на файл або роботу, а також описує, за якими ліцензіями файл або робота доступні.

source: Copyright Notice --- a line of text that conveys copyright of a copyright holder. Its format is defined in the [Format of Copyright Notices](#format-of-copyright-notices) section.
cs: Copyright Notice --- řádek textu, který vyjadřuje autorská práva držitele autorských práv. Jeho formát je definován v části [Format of Copyright Notices](#format-of-copyright-notices).
uk: Повідомлення про авторські права --- рядок тексту, який повідомляє про авторські права правовласника. Його формат визначено у розділі [Формат сповіщень про авторські права](#format-of-copyright-notices).

source: Covered File --- a file which must contain Licensing Information, as defined in [Covered and ignored Files](#covered-and-ignored-files).
cs: Covered File --- soubor, který musí obsahovat licenční informace, jak je definováno v [Covered and ignored Files](#covered-and-ignored-files).
uk: Покритий файл --- файл, який повинен містити Ліцензійну інформацію, як визначено у розділі [Покриті та ігноровані файли](#covered-and-ignored-files).

source: Commentable File --- a plain text file that can contain comments.
cs: Komentovatelný soubor --- prostý textový soubor, který může obsahovat komentáře.
uk: Файл, що коментується --- звичайний текстовий файл, який може містити коментарі.

source: Snippet --- a portion of text in a Commentable File to which different Licensing Information applies.
cs: Úryvek --- část textu v komentovatelném souboru, na který se vztahují různé licenční informace.
uk: Фрагмент --- частина тексту в коментованому файлі, до якої застосовується інша інформація про ліцензування.

source: Uncommentable File --- either a plain text file that cannot contain comments or a file that is not a plain text file.
cs: Nekomentovatelný soubor --- buď prostý textový soubor, který nemůže obsahovat komentáře, nebo soubor, který není prostým textovým souborem.
uk: Файл, що не коментується --- або звичайний текстовий файл, який не може містити коментарів, або файл, який не є звичайним текстовим файлом.

source: SPDX Specification --- SPDX specification, version 2.3; as available at <https://spdx.org/specifications>.
cs: Specifikace SPDX --- Specifikace SPDX, verze 2.3; jak je k dispozici na <https://spdx.org/specifications>.
uk: Специфікація SPDX --- Специфікація SPDX, версія 2.3; доступна на <https://spdx.org/specifications>.

source: SPDX License Identifier --- SPDX short-form identifier, as defined in SPDX Specification. See also <https://spdx.org/ids> for a short introduction and examples.
cs: Identifikátor licence SPDX --- Zkrácený identifikátor SPDX, jak je definován ve specifikaci SPDX. Viz také <https://spdx.org/ids>, kde najdete krátký úvod a příklady.
ru: Идентификатор лицензии SPDX --- Идентификатор краткой формы SPDX, как определено в спецификации SPDX. Краткое введение и примеры см. также в <https://spdx.org/ids>.
uk: Ідентифікатор ліцензії SPDX — ідентифікатор короткої форми SPDX, як визначено у специфікації SPDX. Перегляньте також <https://spdx.org/ids> для швидкого ознайомлення та прикладів.

source: SPDX License Expression --- as defined in SPDX Specification, Annex D, at <https://spdx.github.io/spdx-spec/v2.3/SPDX-license-expressions/>.
cs: SPDX License Expression --- jak je definováno ve specifikaci SPDX, Příloha D, na <https://spdx.github.io/spdx-spec/v2.3/SPDX-license-expressions/>.
uk: Вираз ліцензії SPDX --- як визначено у Специфікації SPDX, Додаток D, за адресою <https://spdx.github.io/spdx-spec/v2.3/SPDX-license-expressions/>.

source: DEP5 --- Machine-readable `debian/copyright` file, Version 1.0; as available at <https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/> and further defined in [DEP5 (deprecated)](#dep5-deprecated). Where the REUSE Specification and DEP5 state different things, the REUSE Specification takes precedence.
cs: DEP5 --- Strojově čitelný soubor `debian/copyright`, verze 1.0; jak je k dispozici na <https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/> a dále definované v [DEP5 (zastaralé)](#dep5-deprecated). Kde specifikace REUSE a DEP5 uvádějí různé věci, má přednost specifikace REUSE.
uk: DEP5 --- Машиночитаний файл `debian/copyright`, версія 1.0; доступний на <https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/> і додатково описаний у [DEP5 (застарілий)](#dep5-deprecated). Якщо специфікація REUSE та DEP5 стверджують різні речі, специфікація REUSE має перевагу.

source: TOML --- A configuration file format as available at <https://toml.io/en/v1.0.0>.
cs: TOML --- Formát konfiguračního souboru dostupný na <https://toml.io/en/v1.0.0>.
uk: TOML --- Формат файлу конфігурації, доступний за адресою <https://toml.io/en/v1.0.0>.

source: Covered and ignored Files
cs: Zakryté a ignorované soubory
uk: Покриті та ігноровані файли

source: Covered Files are any file which must contain Licensing Information. This is equal to all files in a project, with the exception of:
cs: Zakryté soubory jsou všechny soubory, které musí obsahovat licenční informace. To se rovná všem souborům v projektu, s výjimkou:
uk: Покриті файли — це будь-який файл, який повинен містити Ліцензійну інформацію. Це значення дорівнює всім файлам у проєкті, за винятком:

source: The License Files stored in the `LICENSES/` directory.
cs: Licenční soubory uložené v adresáři `LICENSES/`.
uk: Файли ліцензії зберігаються у каталозі `LICENSES/`.

source: `COPYING` and `LICENSE`, with or without file extensions.
cs: `KOPÍROVÁNÍ` a `LICENCE` s příponami souborů nebo bez nich.
uk: `COPYING` і `LICENSE`, з розширеннями файлів або без них.

source: The files ignored by the version control system (example: files listed in `.gitignore`).
cs: Soubory ignorované systémem správy verzí (příklad: soubory uvedené v `.gitignore`).
uk: Файли, які ігноруються системою контролю версій (наприклад, файли, перелічені у `.gitignore`).

source: Submodules of the Project's version control system and Meson subprojects. Each submodule and Meson subproject is understood as a separate Project.
cs: Submoduly systému správy verzí projektu a podprojekty Meson. Každý dílčí modul a dílčí projekt Meson je chápán jako samostatný Projekt.
uk: Підмодулі системи керування версіями проєкту та підпроєктів Meson. Кожен підмодуль і підпроєкт Meson розглядається як окремий проєкт.

source: Symlinks and files with no data (zero-byte).
cs: Symbolické odkazy a soubory bez dat (nulový bajt).
uk: Символічні посилання та файли без даних (нульовий байт).

source: SPDX documents in their various formats as defined in the [SPDX Specification, Clause 4.4](https://spdx.github.io/spdx-spec/v2.3/conformance/#44-standard-data-format-requirements) (example: `sbom.spdx.json`).
cs: Dokumenty SPDX v různých formátech, jak je definováno ve [Specifikaci SPDX, článek 4.4](https://spdx.github.io/spdx-spec/v2.3/conformance/#44-standard-data-format-requirements) ( příklad: `sbom.spdx.json`).
uk: Документи SPDX у різних форматах, визначених у [Специфікації SPDX, Пункт 4.4](https://spdx.github.io/spdx-spec/v2.3/conformance/#44-standard-data-format-requirements) (приклад: `sbom.spdx.json`).

source: License Files
cs: Licenční soubory
uk: Файли ліцензії

source: A Project MUST include a License File for every license under which Covered Files are licensed.
cs: Projekt MUSÍ obsahovat Licenční soubor pro každou licenci, pod kterou jsou licencovány Zahrnuté soubory.
uk: Проєкт ОБОВ'ЯЗКОВО повинен містити Ліцензійний файл для кожної ліцензії, за якою ліцензуються Покриті файли.

source: Each License File MUST be placed in the `LICENSES/` directory in the root of the Project. The name of the License File MUST be the SPDX License Identifier of the license followed by an appropriate file extension (example: `LICENSES/GPL-3.0-or-later.txt`). The License File MUST be in plain text format.
cs: Každý licenční soubor MUSÍ být umístěn v adresáři `LICENSES/` v kořenovém adresáři projektu. Název licenčního souboru MUSÍ být identifikátor licence SPDX, za kterým následuje příslušná přípona souboru (například: `LICENSES/GPL-3.0-or-later.txt`). Licenční soubor MUSÍ být v prostém textovém formátu.
ru: Каждый файл лицензии ДОЛЖЕН быть помещен в директорию `ЛIЦЕНЗИЯ/` в корне проекта. Имя файла лицензии ДОЛЖНО представлять собой SPDX-идентификатор лицензии, за которым следует соответствующее расширение файла (пример: `ЛIЦЕНЗИЯ/GPL-3.0-или-позднее.txt`). Файл лицензии ДОЛЖЕН быть в формате обычного текста.
uk: Кожен файл ліцензії повинен бути розміщений у каталозі `LICENSES/` у кореневому каталозі проєкту. Назва файлу ліцензії ПОВИННА бути ідентифікатором ліцензії SPDX, а потім відповідним розширенням файлу (наприклад: `LICENSES/GPL-3.0-or-later.txt`). Файл ліцензії ПОВИНЕН бути у звичайному текстовому форматі.

source: If a license does not exist in the SPDX License List, its SPDX License Identifier MUST be `LicenseRef-[idstring]` as defined by the SPDX Specification, Clause 10 available at <https://spdx.github.io/spdx-spec/v2.3/other-licensing-information-detected/>.
cs: Pokud licence v seznamu licencí SPDX neexistuje, její identifikátor licence SPDX MUSÍ být `LicenseRef-[idstring]`, jak je definováno ve specifikaci SPDX, článek 10 dostupný na <https://spdx.github.io/spdx-spec /v2.3/other-licensing-information-detected/>.
uk: Якщо ліцензія не існує у списку ліцензій SPDX, її ідентифікатор ліцензії SPDX МАЄ бути `LicenseRef-[idstring]`, як визначено у Специфікації SPDX, Пункт 10, доступній за адресою <https://spdx.github.io/spdx-spec/v2.3/other-licensing-information-detected/>.

source: A Project MUST NOT include License Files for licenses under which none of the files in the Project are licensed. The `LICENSES/` directory MUST NOT include any other files.
cs: Projekt NESMÍ obsahovat licenční soubory pro licence, na jejichž základě není licencován žádný ze souborů v projektu. Adresář `LICENSES/` NESMÍ obsahovat žádné další soubory.
uk: Проєкт НЕ МОЖЕ включати ліцензійні файли для ліцензій, за якими жоден з файлів у проєкті не є ліцензованим. Каталог `LICENSES/` НЕ ПОВИНЕН містити жодних інших файлів.

source: For avoidance of doubt, in practice this means that for every license and exception that is part of any SPDX License Expression in any Licensing Information associated with any Covered File, there MUST exist a License File as defined in this section.
cs: Aby se předešlo pochybnostem, v praxi to znamená, že pro každou licenci a výjimku, která je součástí jakéhokoli licenčního vyjádření SPDX v jakýchkoli licenčních informacích spojených s jakýmkoli krytým souborem, MUSÍ existovat licenční soubor, jak je definován v této části.
uk: Щоб уникнути сумнівів, на практиці це означає, що для кожної ліцензії та винятку, які є частиною будь-якого Виразу ліцензії SPDX в будь-якій Ліцензійній інформації, пов'язаній з будь-яким Покритим файлом, ПОВИНЕН існувати Ліцензійний файл, як визначено в цьому розділі.
