Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> SPDX-FileCopyrightText: © 2019 John Doe <john@example.com> SPDX-FileCopyrightText: Contributors to Example Project <https://project.example.com> SPDX-FileCopyrightText: 2023 Alice Hack and (other) contributors to Project X <https://git.example.com/alicehack/projectx/CONTRIBUTORS.md> SPDX-SnippetCopyrightText: (C) Example Cooperative <info@coop.example.com> © Example Corporation <https://corp.example.com> Copyright 2016, 2018-2019 Joe Anybody Copyright (c) Alice, some rights reserved
cs: SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> SPDX-FileCopyrightText: © 2019 John Doe <john@example.com> SPDX-FileCopyrightText: Přispěvatelé do příkladového projektu <https://project.example.com> SPDX-FileCopyrightText: 2023 Alice Hack a (další) přispěvatelé do projektu X <https://git.example.com/alicehack/projectx/CONTRIBUTORS.md> SPDX-SnippetCopyrightText: (C) Příkladové družstvo <info@coop.example.com> © Example Corporation <https://corp.example.com> Copyright 2016, 2018-2019 Joe Anybody Copyright (c) Alice, některá práva vyhrazena
uk: SPDX-FileCopyrightText: 2019 Джейн Доу <jane@example.com> SPDX-FileCopyrightText: © 2019 Джейн Доу <john@example.com> SPDX-FileCopyrightText: Учасники проєкту Приклад <https://project.example.com> SPDX-FileCopyrightText: 2023 Аліса Хак та (інші) учасники Проєкту X <https://git.example.com/alicehack/projectx/CONTRIBUTORS.md> SPDX-SnippetCopyrightText: (C) Приклад кооперативу <info@coop.example.com> © Приклад Корпорації <https://corp.example.com> Авторське право 2016, 2018-2019 Джо Будь-хто Авторське право (c) Аліса, деякі права захищені

source: Out of those, the first two are highly recommended. The others exist primarily to be compatible with existing conventions.
cs: Z těchto lze vřele doporučit první dva. Ostatní existují především proto, aby byly kompatibilní se stávajícími konvencemi.
ru: Из них настоятельно рекомендуется использовать первые два. Остальные существуют в основном для того, чтобы быть совместимыми с существующими конвенциями.
uk: З них перші два — найрекомендованіші. Інші існують насамперед для сумісності з наявними конвенціями.

source: <!-- TODO: Link to another question about © -->
cs: <!-- TODO: Odkaz na další otázku týkající se © -->
uk: <!-- TODO: Посилання на інше запитання про © -->

source: Which years do I include in the copyright statement? {#years-copyright}
cs: Které roky mám uvést v prohlášení o autorských právech? {#years-copyright}
ru: Какие годы указывать в заявлении об авторских правах? {#годы авторского права}
uk: Які роки включати до повідомлення про авторські права? {#years-copyright}

source: Generally, there are four options for you to choose:
cs: Obecně si můžete vybrat ze čtyř možností:
ru: Как правило, на выбор предлагается четыре варианта:
uk: Загалом є чотири варіанти на вибір:

source: The year of initial publication.
cs: Rok prvního zveřejnění.
ru: Год первоначальной публикации.
uk: Рік першої публікації.

source: The year of the latest publication.
cs: Rok posledního zveřejnění.
ru: Год последней публикации.
uk: Рік останньої публікації.

source: All years of publications, either as range (e.g., 2017-2019) or as separate entries (e.g., 2017, 2018, 2019).
cs: Všechny roky zveřejnění, buď jako rozsah (např. 2017-2019), nebo jako samostatné položky (např. 2017, 2018, 2019).
ru: Все годы публикаций, либо в виде диапазона (например, 2017-2019), либо в виде отдельных записей (например, 2017, 2018, 2019).
uk: Всі роки публікації, або діапазоном (наприклад, 2017-2019), або окремими записами (наприклад, 2017, 2018, 2019).

source: Do not include any year.
cs: Neuvádějte žádný rok.
ru: Не включайте ни одного года.
uk: Не включати жодного року.

source: Which option you choose is ultimately up to you. [This article](https://matija.suklje.name/how-and-why-to-properly-write-copyright-statements-in-your-code) makes a good case for using the year of initial publication of the file.
cs: Záleží jen na vás, kterou možnost si vyberete. [Tento článek](https://matija.suklje.name/how-and-why-to-properly-write-copyright-statements-in-your-code) je dobrým argumentem pro použití roku prvního zveřejnění souboru.
uk: Який варіант ви оберете, зрештою, вирішувати вам. [У цій статті(https://matija.suklje.name/how-and-why-to-properly-write-copyright-statements-in-your-code) наведено вагомі аргументи на користь використання року першої публікації файлу.

source: Which files are copyrightable? {#what-is-copyrightable}
cs: Na které soubory se vztahují autorská práva? {#what-is-copyrightable}
ru: Какие файлы защищены авторским правом? {#что является объектом авторского права}
uk: Які файли захищені авторським правом? {#what-is-copyrightable}

source: All files that are original works of authorship are copyrightable. In essence, if someone sat down typing their own original thoughts on a keyboard, then that person holds copyright over the output. Common examples are source code, documentation, audio, and video.
cs: Všechny soubory, které jsou původními autorskými díly, podléhají autorským právům. V podstatě, pokud někdo sedí a píše na klávesnici své vlastní originální myšlenky, pak má autorská práva k výstupu. Běžnými příklady jsou zdrojové kódy, dokumentace, zvukové záznamy a video.
ru: Все файлы, являющиеся оригинальными авторскими работами, защищены авторским правом. По сути, если кто-то сел и набрал на клавиатуре свои собственные оригинальные мысли, то этот человек обладает авторским правом на результат. Частыми примерами являются исходный код, документация, аудио- и видеоматериалы.
uk: Всі файли, які є оригінальними авторськими продуктами, захищаються авторським правом. По суті, якщо хтось набрав свої оригінальні думки на клавіатурі, то ця людина має авторські права на отриманий твір. Поширеними прикладами є джерельний код, документація, аудіо та відео.

source: There are some edge cases, however. For instance, the program `print("Hello, REUSE!")` probably does not meet the threshold of originality. Similarly, data files and configuration files may not meet that threshold either. For these files, see [this question](#uncopyrightable).
cs: Existují však některé okrajové případy. Například program `print(„Ahoj, REUSE!“)` pravděpodobně nesplňuje hranici originality. Podobně tuto hranici nemusí splňovat ani datové a konfigurační soubory. Ohledně těchto souborů viz [this question](#uncopyrightable).
uk: Однак є деякі крайні випадки. Наприклад, програма `print("Hello, REUSE!")`, ймовірно, не відповідає критерію оригінальності. Аналогічно, файли даних і конфігураційні файли також можуть не відповідати цьому порогу. Про ці файли перегляньте [це питання](#uncopyrightable).

source: What is a copyright holder, and what is an author? {#copyright-holder-author}
cs: Co je držitel autorských práv a co je autor? {#copyright-holder-author}
ru: Что такое правообладатель и что такое автор? {#copyright-обладатель авторских прав}
uk: Хто такий власник авторських прав і хто такий автор? {#copyright-holder-author}

source: In these resources, we maintain a distinction between the copyright holder and the author. The author (also known as creator) is the person who sat down and created a work. Think of the author as a programmer, writer, or artist.
cs: V těchto zdrojích rozlišujeme mezi držitelem autorských práv a autorem. Autor (také známý jako tvůrce) je osoba, která se posadila a vytvořila dílo. Představte si autora jako programátora, spisovatele nebo umělce.
ru: В этих ресурсах мы проводим различие между правообладателем и автором. Автор (также известный как создатель) - это человек, который сел и создал произведение. Думайте об авторе как о программисте, писателе или художнике.
uk: У цих ресурсах ми підтримуємо різницю між власником авторських прав і автором. Автор (також відомий як творець) — це людина, яка сіла і створила щось. Подумайте про автора як про програміста, письменника або художника.

source: The copyright holder is the person who has the exclusive rights over that work. Often the author and the copyright holder are the same. However, if the author is being paid by their employer to create a work, the employer is often the copyright holder.
cs: Držitelem autorských práv je osoba, která má k danému dílu výhradní práva. Často je autor a držitel autorských práv jedna a tatáž osoba. Pokud je však autor za vytvoření díla placen svým zaměstnavatelem, je často držitelem autorských práv zaměstnavatel.
ru: Владелец авторских прав - это лицо, обладающее исключительными правами на это произведение. Часто автор и обладатель авторских прав - одно и то же лицо. Однако если автору платит работодатель за создание произведения, то работодатель часто является правообладателем.
uk: Правовласником є особа, яка має виключні права на цей твір. Часто автор і власник авторських прав — це одна особа. Однак, якщо автору за створення твору платить роботодавець, тоді цей роботодавець часто є власником авторських прав.

source: Keep in mind that in some jurisdictions, the word "author" is often used as a synonym for "copyright holder". In other jurisdictions, authors maintain some rights over their work even if they are not the copyright holder.
cs: Mějte na paměti, že v některých jurisdikcích se slovo "autor" často používá jako synonymum pro "držitele autorských práv". V jiných jurisdikcích si autoři zachovávají určitá práva ke svému dílu, i když nejsou držiteli autorských práv.
ru: Имейте в виду, что в некоторых юрисдикциях слово "автор" часто используется как синоним слова "правообладатель". В других юрисдикциях авторы сохраняют некоторые права на свои работы, даже если они не являются обладателями авторских прав.
uk: Майте на увазі, що в деяких юрисдикціях слово «автор» часто вживається синонімом «власник авторських прав». В інших юрисдикціях автори зберігають деякі права на свою роботу, навіть якщо вони не є правовласниками.

source: I changed a single line of code. Should I add an SPDX-FileCopyrightText tag with my name? {#when-copyright}
cs: Změnil jsem jediný řádek kódu. Mám přidat značku SPDX-FileCopyrightText se svým jménem? {#when-copyright}
ru: Я изменил всего одну строку кода. Должен ли я добавить тег SPDX-FileCopyrightText с моим именем? {#когда- авторское право}
uk: Я змінив один рядок коду. Чи слід додавати тег SPDX-FileCopyrightText зі своїм ім'ям? {#when-copyright}

source: The core question here is: At what point should I consider myself a copyright holder over a file? This is up to your discretion. It might help to be consistent and add the tag to every file you touch, but it is perhaps more valuable to reach a consensus about this within your project.
cs: Základní otázka zní: V jakém okamžiku se mám považovat za držitele autorských práv k souboru? To záleží na vašem uvážení. Možná pomůže být důsledný a přidávat značku ke každému souboru, kterého se dotknete, ale možná je cennější dosáhnout v této otázce konsenzu v rámci vašeho projektu.
ru: Основной вопрос заключается в следующем: В какой момент я должен считать себя обладателем авторских прав на файл? Это зависит от вашего усмотрения. Можно быть последовательным и добавлять метку к каждому файлу, к которому вы прикасаетесь, но, возможно, более ценно прийти к консенсусу по этому вопросу в рамках вашего проекта.
uk: Основне питання тут: У який момент я повинен вважати себе власником авторських прав над файлом? Це на ваш розсуд. Це може допомогти бути послідовним і додати тег до кожного файлу, до якого ви торкаєтеся, але, можливо, ціннішим є досягнення консенсусу щодо цього у вашому проєкті.

source: Licensing {#licensing}
cs: Licencování {#licensing}
uk: Ліцензування {#licensing}

source: What is a license? {#what-is-license}
cs: Co je to licence? {#what-is-licence}
ru: Что такое лицензия? {#что такое лицензия}
uk: Що таке ліцензія? {#what-is-license}

source: One problem with copyright as it pertains to software is that it makes software unshareable by default. A license changes that. A license defines the terms under which the copyright holder allows the recipient of the license to use the software.
cs: Jedním z problémů autorských práv v souvislosti se softwarem je, že ve výchozím nastavení činí software nesdíleným. Licence to mění. Licence definuje podmínky, za kterých držitel autorských práv povoluje příjemci licence software používat.
ru: Одна из проблем авторского права применительно к программному обеспечению заключается в том, что оно по умолчанию делает программы недоступными для совместного использования. Лицензия меняет эту ситуацию. Лицензия определяет условия, на которых владелец авторских прав разрешает получателю лицензии использовать программное обеспечение.
uk: Однією з проблем авторського права, що стосується програмного забезпечення, є те, що воно робить програмне забезпечення недоступним для спільного користування одразу після створення. Ліцензія змінює це. Ліцензія визначає умови, на яких власник авторських прав дозволяє одержувачу ліцензії користуватися програмним забезпеченням.

source: If the license allows the recipient to [use, study, share and improve](https://fsfe.org/freesoftware/basics/4freedoms.html) the software, then that software is [Free Software](https://fsfe.org/about/basics/freesoftware).
cs: Pokud licence umožňuje příjemci [používat, studovat, sdílet a vylepšovat](https://fsfe.org/freesoftware/basics/4freedoms.html) software, pak se jedná o [svobodný software](https://fsfe.org/about/basics/freesoftware).
ru: Если лицензия позволяет получателю [использовать, изучать, распространять и улучшать](https://fsfe.org/freesoftware/basics/4freedoms.html) программное обеспечение, то это программное обеспечение является [Свободным программным обеспечением](https://fsfe.org/about/basics/freesoftware).
uk: Якщо ліцензія дозволяє одержувачу [користуватися, вивчати, ділитися та вдосконалювати](https://fsfe.org/freesoftware/basics/4freedoms.html) програмне забезпечення, то воно є [Вільним програмним забезпеченням](https://fsfe.org/about/basics/freesoftware).

source: What is a copyleft license? A permissive license? {#copyleft-permissive-license}
cs: Co je to copyleftová licence? Permisivní licence? {#copyleft-permissive-license}
uk: Що таке ліцензія з копілефтом? Дозвільна ліцензія? {#copyleft-permissive-license}

source: There are two broad categories of Free Software licenses; copyleft and permissive licenses.
cs: Existují dvě široké kategorie licencí svobodného softwaru: copyleft a permisivní licence.
uk: Існують дві широкі категорії ліцензій вільного програмного забезпечення: ліцензії з copyleft та дозвільні ліцензії.

source: A copyleft license give you the right to use, study, share, and improve a piece of software under one strict condition. If you make any changes to the program and share your version of the program with someone else, you must share your changes under the same license as the original. A well-known copyleft license is the [GNU General Public License version 3](https://www.gnu.org/licenses/gpl-3.0.html).
cs: Licence copyleft vám dává právo používat, studovat, sdílet a vylepšovat software pod jednou přísnou podmínkou. Pokud v programu provedete jakékoli změny a sdílíte svou verzi programu s někým jiným, musíte své změny sdílet pod stejnou licencí jako originál. Známou licencí copyleft je [GNU General Public License verze 3](https://www.gnu.org/licenses/gpl-3.0.html).
uk: Ліцензія з копілефтом дає вам право використовувати, вивчати, поширювати та вдосконалювати програмне забезпечення за однієї суворої умови. Якщо ви вносите будь-які зміни до програми та ділитеся своєю версією програми з кимось іншим, ви повинні ділитися своїми змінами під тією ж ліцензією, що й оригінал. Відомою ліцензією з copyleft є [GNU General Public License версія 3](https://www.gnu.org/licenses/gpl-3.0.html).

source: A permissive license gives you the same Free Software rights, but does not include this condition. It is possible for someone to take a permissively licensed piece of software, make changes to it, and keep the changed version proprietary. A well-known permissive license is the [Apache License, version 2](https://www.apache.org/licenses/LICENSE-2.0.html).
cs: Permisivní licence vám dává stejná práva svobodného softwaru, ale neobsahuje tuto podmínku. Je možné, že někdo vezme software s permisivní licencí, provede v něm změny a změněnou verzi si ponechá jako proprietární. Známou permisivní licencí je [Apache License, verze 2](https://www.apache.org/licenses/LICENSE-2.0.html).
uk: Дозвільна ліцензія надає вам ті самі права на вільне програмне забезпечення, але не містить цієї умови. Хтось може взяти ліцензоване програмне забезпечення, внести до нього зміни і зберегти змінену версію як власність. Відомою дозвільною ліцензією є [Ліцензія Apache версії 2](https://www.apache.org/licenses/LICENSE-2.0.html).

source: Which license should I choose? {#which-license}
cs: Jakou licenci si mám vybrat? {#which-license}
ru: Какую лицензию мне выбрать? {#какая лицензия}
uk: Яку ліцензію слід обрати? {#which-license}

source: Always choose a Free Software license, i.e. a license that gives the recipient the freedom to use, study, share, and improve the software. Aside from that, the license you choose is up to you. If you are contributing to an existing project, you should release your changes under the same license as the project. Otherwise, the [Free Software Foundation](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/), and [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) have some good recommendations. Note that these resources each emphasise a different value, and come with their own biases.
cs: Vždy si vyberte licenci svobodného softwaru, tj. licenci, která příjemci poskytuje svobodu software používat, studovat, sdílet a vylepšovat. Kromě toho je volba licence na vás. Pokud přispíváte do existujícího projektu, měli byste své změny uvolnit pod stejnou licencí jako projekt. Jinak mají [Free Software Foundation](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/) a [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) několik dobrých doporučení. Všimněte si, že každý z těchto zdrojů klade důraz na jinou hodnotu a přichází s vlastními předsudky.
uk: Завжди вибирайте ліцензію на вільне програмне забезпечення, тобто ліцензію, яка дає одержувачу свободу використовувати, вивчати, поширювати та вдосконалювати програмне забезпечення. Крім того, ліцензія, яку ви обираєте, залежить від вас. Якщо ви робите внесок в наявний проєкт, ви повинні випускати свої зміни під тією ж ліцензією, що і проєкт. В іншому випадку [Free Software Foundation](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/) та [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) мають кілька хороших рекомендацій. Зауважте, що ці ресурси наголошують на різних цінностях і мають власну упередженість.

source: Above all, if you value freedom, you should choose a license that makes your software [Free Software](https://fsfe.org/about/basics/freesoftware.en.html).
cs: Pokud si ceníte svobody, měli byste především zvolit licenci, která váš software zachová jako [Svobodný Software](https://fsfe.org/about/basics/freesoftware.en.html).
ru: Прежде всего, если вы цените свободу, вам следует выбрать лицензию, которая делает ваше программное обеспечение [Free Software](https://fsfe.org/about/basics/freesoftware.en.html).
uk: Якщо ви цінуєте свободу, перш за все ви повинні вибрати ліцензію, яка робить ваше програмне забезпечення [Вільним програмним забезпеченням](https://fsfe.org/about/basics/freesoftware.en.html).

source: What are license exceptions and what do I do with them? {#license-exceptions}
cs: Jaké jsou licenční výjimky a co s nimi mám dělat? {#licence-exceptions}
ru: Что такое исключения из лицензии и что с ними делать? {#лицензионные исключения}
uk: Що таке ліцензійні винятки та що з ними робити? {#license-exceptions}

source: License exceptions are additions or alterations to a license that often work to permit a certain use of the code that wouldn't be allowed under the original license. It is often used by compilers, where a portion of compiler code may end up in the resulting binary. The exception may waive rights over portions of code that end up in binaries.
cs: Licenční výjimky jsou dodatky nebo změny licence, které často umožňují určité použití kódu, které by podle původní licence nebylo povoleno. Často se používá u překladačů, kde se část kódu překladače může dostat do výsledné binární verze. Výjimka se může vzdát práv na části kódu, které skončí v binárních souborech.
ru: Лицензионные исключения - это дополнения или изменения к лицензии, которые часто служат для разрешения определенного использования кода, которое не было бы разрешено по оригинальной лицензии. Это часто используется в компиляторах, где часть кода компилятора может оказаться в результирующем бинарном файле. Исключение может отказаться от прав на части кода, которые попадают в двоичные файлы.
uk: Винятком з ліцензій є доповнення або зміни до ліцензії, які часто потрібні, щоб дозволити певне використання коду, яке не допускається оригінальною ліцензією. Це часто застосовується компіляторами, де частина коду компілятора може виявитися в отриманому двійковому файлі. Виняток може дозволити відмовитися від прав на частини коду, які знаходяться у двійкових файлах.

source: Exceptions are treated almost identically to licenses. In order to combine a license with an exception, you mark a file with the following tag: `SPDX-License-Identifier: GPL-3.0-or-later WITH GCC-exception-3.1`.
cs: S výjimkami se zachází téměř stejně jako s licencemi. Chcete-li zkombinovat licenci s výjimkou, označte soubor následující značkou: `SPDX-Licence-Identifier: GPL-3.0-or-later WITH GCC-exception-3.1`.
ru: Исключения обрабатываются почти так же, как и лицензии. Чтобы объединить лицензию с исключением, вы помечаете файл следующим тегом: `SPDX- Лицензия-Идентификатор: GPL-3.0-или-позднее С GCC-исключением-3.1`.
uk: Винятки трактуються майже однаково з ліцензіями. Щоб поєднати ліцензію з винятком, потрібно позначити файл таким тегом: `SPDX-License-Identifier: GPL-3.0-or-later WITH GCC-exception-3.1`.

source: You can find a list of common exceptions at [SPDX License Exceptions](https://spdx.org/licenses/exceptions-index.html).
cs: Seznam běžných výjimek najdete na adrese [SPDX License Exceptions](https://spdx.org/licenses/exceptions-index.html).
uk: Ви можете знайти список загальних винятків на сторінці [Винятки з ліцензії SPDX](https://spdx.org/licenses/exceptions-index.html).

source: How does license compatibility work? {#license-compatibility}
cs: Jak funguje kompatibilita licencí? {#license-compatibility}
uk: Як працює сумісність ліцензій? {#license-compatibility}

source: Free Software licenses often differ in detail, but always give you the right to use, study, share, and improve the software. Many licenses are compatible, meaning that you can use code from multiple licenses in the same project and still be able to respect the terms of each license simultaneously.
cs: Licence svobodného softwaru se často liší v detailech, ale vždy vám dávají právo software používat, studovat, sdílet a vylepšovat. Mnoho licencí je kompatibilních, což znamená, že v jednom projektu můžete používat kód z více licencí a přitom současně dodržovat podmínky každé z nich.
uk: Ліцензії на вільне програмне забезпечення часто відрізняються в деталях, але завжди надають вам право використовувати, вивчати, поширювати та вдосконалювати програмне забезпечення. Багато ліцензій є сумісними, що означає, що ви можете використовувати код з декількох ліцензій в одному проєкті і при цьому дотримуватися умов кожної ліцензії.
