Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: > ### Keep in mind > > * Use a consistent style of your headers throughout the project. > * Don't remove existing headers, but only add to them. > * Do consider using version control systems to keep a record of copyright holders. > * Do keep your version control system public if you use it. > * Make references to the SPDX identifier from each source code file. > * Record copyright information in each source code file. > * Include license and copyright information also for files which can not > include a proper header, either in a separate .license file, or using the > DEP-5/copyright specification.
cs: > ### Mějte na paměti > > * Používejte konzistentní styl záhlaví v celém projektu. > * Neodstraňujte existující záhlaví, ale pouze k nim přidávejte. > * Zvažte použití systémů pro správu verzí k vedení záznamů o držitelích autorských práv. > * Udržujte svůj systém správy verzí veřejný, pokud jej používáte. > * Uveďte odkazy na identifikátor SPDX z každého souboru zdrojového kódu. > * Zaznamenejte informace o autorských právech do každého souboru zdrojového kódu. > * Zahrňte informace o licenci a autorských právech také pro soubory, které nemohou > zahrnout správnou hlavičku, buď v samostatném souboru .licence, nebo pomocí > DEP-5/specifikace autorských práv.
uk: > ### Пам'ятайте > > * Використовуйте єдиний стиль заголовків в усьому проєкті. > * Не видаляйте наявні заголовки, а лише додавайте їх. > * Розгляньте можливість використання систем керування версіями для ведення обліку власників авторських прав. > * Якщо ви використовуєте систему керування версіями, робіть її загальнодоступною. > * Зробіть посилання на ідентифікатор SPDX у кожному файлі початкового коду. > * Записуйте інформацію про авторські права в кожному файлі програмного коду. > * Включіть інформацію про ліцензію та авторське право також для файлів, які не можуть > включати відповідний заголовок або в окремому файлі .license, або за допомогою > специфікації DEP-5/копірайт.

source: [^1]: Establish project governance committed to public access, vet material added to project to protect against vulnerability to takedown, only include material under a free and open source license so it can be copied and archived freely and ensure project is archived by institutions dedicated to long-term preservation of software code, eg. Software Heritage.
cs: [^1]: Zaveďte správu projektu, která se zavazuje k veřejnému přístupu, prověřujte materiál přidaný do projektu za účelem ochrany před zranitelností vůči zastavení šíření, zahrňte materiál pouze pod svobodnou a open source licencí, aby jej bylo možné volně kopírovat a archivovat a zajistit, aby byl projekt archivován institucemi věnované dlouhodobému uchování softwarového kódu, např. Softwarové dědictví.
uk: [^1]: Встановіть управління проєктом, орієнтоване на публічний доступ, перевіряйте матеріали, що додаються до проєкту, щоб захистити їх від вразливості до вилучення, включайте лише матеріали під вільною та відкритою ліцензією, щоб їх можна було вільно копіювати та архівувати, а також забезпечте архівування проєкту в установах, що займаються довгостроковим збереженням програмного коду, наприклад, у Software Heritage.

source: Aside from the license files included in the project, and the file level copyright information, you may include a bill of materials for your project, but you should only do so if this is generated automatically.
cs: Kromě licenčních souborů zahrnutých v projektu a informací o autorských právech na úrovni souboru můžete zahrnout soupisku pro svůj projekt, ale měli byste tak učinit pouze v případě, že je generována automaticky.
uk: Окрім ліцензійних файлів, включених до проєкту, та інформації про авторські права на рівні файлів, ви можете додати специфікацію матеріалів для вашого проєкту, але це слід робити лише у тому випадку, якщо вона згенерована автоматично.

source: A bill of materials can be very complicated and lengthy, making it difficult to maintain. If you do not generate it automatically, it's very likely someone will forget to update it when making changes. In these cases, it's best not to have a bill of materials, but to rely only on the information coupled with the source code files.
cs: Soupiska může být velmi komplikovaná a zdlouhavá, což ztěžuje její údržbu. Pokud ji nevygenerujete automaticky, je velmi pravděpodobné, že ji někdo při provádění změn zapomene aktualizovat. V těchto případech je nejlepší nemít soupisku, ale spoléhat se pouze na informace spojené se soubory zdrojového kódu.
uk: Перелік матеріалів може бути дуже складним і довгим, що ускладнює його ведення. Якщо ви не генеруєте його автоматично, дуже ймовірно, що хтось забуде оновити його вносячи зміни. У таких випадках краще не мати специфікацію матеріалів, а покладатися лише на інформацію в поєднанні з файлами початкового коду.

source: If you do have a way of automatically creating a bill of materials, and if you choose to do so, you should generate it automatically from the most reliable information you have about each file in your project. This includes copyright information kept in version control systems and licenses on files which include a standard header, or which includes the header in a separate license file.
cs: Pokud máte způsob, jak automaticky vytvořit soupisku, a pokud se tak rozhodnete, měli byste ji vygenerovat automaticky z nejspolehlivějších informací, které máte o každém souboru ve svém projektu. To zahrnuje informace o autorských právech uchovávané v systémech správy verzí a licence na soubory, které obsahují standardní záhlaví nebo které obsahují záhlaví v samostatném licenčním souboru.
uk: Якщо у вас є спосіб автоматичного створення специфікації матеріалів, і якщо ви вирішите це зробити, вам слід генерувати її автоматично на основі найперевіренішої інформації про кожен файл у вашому проєкті. Сюди входить інформація про авторське право, що зберігається в системах керування версіями, а також ліцензії на файли, які містять стандартний заголовок або заголовок в окремому файлі ліцензії.

source: You may also choose to include in the bill of materials your output files generated when compiling the project, such that you can signal through the bill of materials, which license is relevant for the output files depending on the included source code.
cs: Můžete se také rozhodnout zahrnout do soupisky své výstupní soubory vygenerované při kompilaci projektu, abyste mohli prostřednictvím soupisky uvést, která licence je relevantní pro výstupní soubory v závislosti na zahrnutém zdrojovém kódu.
uk: Ви також можете включити до переліку матеріалів ваші початкові файли, згенеровані під час компілювання проєкту, щоб за допомогою переліку матеріалів ви могли вказати, яка ліцензія застосовна до початкових файлів залежно від включеного початкового коду.

source: The bill of materials should be conformant to the SPDX specification and included in a file in the top level directory of your repository called `LICENSE.spdx`.
cs: Soupiska by měla odpovídat specifikaci SPDX a měla by být součástí souboru v adresáři nejvyšší úrovně vašeho úložiště s názvem `LICENSE.spdx`.
uk: Перелік матеріалів повинен відповідати специфікації SPDX і міститися у файлі в каталозі верхнього рівня вашого репозиторію під назвою `LICENSE.spdx`.

source: > ### Keep in mind > > * Don't create a bill of materials if you can't generate it automatically. > * If you generate one automatically, it's helpful to include one. > * Make your bill of materials conformant to the SPDX specification. > * It doesn't hurt to run your project through ScanCode or FOSSology, to make sure these tools can parse and understand your project's licensing.
cs: > ### Mějte na paměti > > * Nevytvářejte soupisku, pokud jej nemůžete vygenerovat automaticky. > * Pokud ji generujete automaticky, je užitečné ji zahrnout. > * Udělejte svou soupisku v souladu se specifikací SPDX. > * Není na škodu spustit svůj projekt prostřednictvím ScanCode nebo FOSSology, abyste se ujistili, že tyto nástroje mohou analyzovat a porozumět licencování vašeho projektu.
uk: > ### Майте на увазі > > * Не створюйте специфікацію матеріалів, якщо ви не можете згенерувати її автоматично. > * Якщо ви генеруєте його автоматично, корисно додати його. > * Приведіть свою специфікацію матеріалів у відповідність до специфікації SPDX. > * Не завадить прогнати ваш проєкт через ScanCode або FOSSology, щоб переконатися, що ці інструменти можуть проаналізувати і зрозуміти ліцензування вашого проєкту.

source: REUSE Specification – Version 3.0
cs: Specifikace REUSE - verze 3.0
ru: Спецификация REUSE - версия 3.0
uk: Специфікація REUSE – версія 3.0

source: This specification defines a standardized method for declaring copyright and licensing for software projects. The goal of the specification is to have unambiguous, human- and machine-readable copyright and licensing information for each individual file in a project. Ideally this information is embedded into every file, so that the information is preserved when the file is copied and reused by third parties.
cs: Tato specifikace definuje standardizovanou metodu pro deklarování autorských práv a licencí pro softwarové projekty. Cílem specifikace je jednoznačné, lidsky i strojově čitelné informace o autorských právech a licencích pro každý jednotlivý soubor v projektu. V ideálním případě jsou tyto informace vloženy do každého souboru, aby byly zachovány i při kopírování a dalším použití souboru třetími stranami.
ru: Эта спецификация определяет стандартизированный метод декларирования авторских прав и лицензирования для программных проектов. Цель спецификации - предоставить однозначную, человеко- и машиночитаемую информацию об авторских правах и лицензировании для каждого отдельного файла в проекте. В идеале эта информация встраивается в каждый файл, чтобы она сохранялась при копировании и повторном использовании файла третьими лицами.
uk: Ця специфікація визначає стандартизований метод оголошення авторських прав і ліцензування для програмних проєктів. Мета специфікації полягає в тому, щоб мати однозначну, людино- і машинозчитувану інформацію про авторські права та ліцензування для кожного окремого файлу в проєкті. В ідеалі ця інформація вбудована в кожен файл, так що інформація зберігається при копіюванні файлу і повторному їх використанні третіми особами.

source: This specification implements [IETF RFC 2119: Key words for use in RFCs to Indicate Requirement Levels](https://tools.ietf.org/html/rfc2119).
cs: Tato specifikace implementuje [IETF RFC 2119: Key words for use in RFCs to Indicate Requirement Levels](https://tools.ietf.org/html/rfc2119).
ru: Данная спецификация реализует [IETF RFC 2119: Ключевые слова для использования в RFC для обозначения уровней требований](https://tools.ietf.org/html/rfc2119).
uk: Ця специфікація впроваджує [IETF RFC 2119: Ключові слова для вживання у RFC для вказання рівнів вимог](https://tools.ietf.org/html/rfc2119).

source: For the revision history of this specification, please see [the change log](https://github.com/fsfe/reuse-website/blob/main/CHANGELOG.md).
cs: Historii revizí této specifikace naleznete v [protokolu změn](https://github.com/fsfe/reuse-website/blob/main/CHANGELOG.md).
uk: Історію редакцій цієї специфікації перегляньте у [журналі змін](https://github.com/fsfe/reuse-website/blob/main/CHANGELOG.md).

source: Definitions
cs: Definice
ru: Определения
uk: Визначення

source: These are the definitions for some of the terms used in this specification:
cs: Toto jsou definice některých pojmů použitých v této specifikaci:
ru: Здесь приведены определения некоторых терминов, используемых в данной спецификации:
uk: Ось визначення деяких термінів, що використовуються в цій специфікації:

source: Project --- any unit of content that can be associated with a distribution of software. Typically, a Project is composed of one or more files. Also sometimes called a package.
cs: Projekt --- jakákoli jednotka obsahu, která může být spojena s distribucí softwaru. Projekt se obvykle skládá z jednoho nebo více souborů. Někdy se také nazývá balíček.
ru: Проект --- любая единица содержимого, которая может быть связана с дистрибутивом программного обеспечения. Как правило, проект состоит из одного или нескольких файлов. Также иногда называется пакетом.
uk: Проєкт — будь-яка одиниця вмісту, яка може бути пов'язана з розповсюдженням програмного забезпечення. Як правило, проєкт складається з одного або кількох файлів. Також іноді називають пакунком.

source: License File --- a file containing the text of a license.
cs: Licenční soubor --- soubor obsahující text licence.
uk: Файл ліцензії --- файл, що містить текст ліцензії.

source: Copyright and Licensing Information --- the information that lists the copyright holders of a file or work, and describes under which licenses the file or work is made available.
cs: Informace o autorských právech a licencích --- informace, které uvádějí držitele autorských práv k souboru nebo dílu a popisují, pod jakými licencemi je soubor nebo dílo zpřístupněno.
ru: Информация об авторских правах и лицензировании --- информация, содержащая список владельцев авторских прав на файл или работу, а также описание лицензий, по которым файл или работа предоставляются.
uk: Інформація про авторське право та ліцензування — інформація, в якій перелічено власників авторських прав на файл або роботу, і описано, за якими ліцензіями доступні файл або робота.

source: SPDX Specification --- SPDX specification, version 2.1; as available on <https://spdx.org/specifications>.
cs: Specifikace SPDX --- Specifikace SPDX, verze 2.1; k dispozici na <https://spdx.org/specifications>.
ru: Спецификация SPDX --- Спецификация SPDX, версия 2.1; доступна на <https://spdx.org/specifications>.
uk: Специфікація SPDX — специфікація SPDX, версія 2.1; доступна на <https://spdx.org/specifications>.

source: SPDX Identifier --- SPDX short-form identifier, as defined in SPDX Specification. See also <https://spdx.org/ids> for a short introduction and examples.
cs: Identifikátor SPDX --- Krátký identifikátor SPDX, jak je definován ve specifikaci SPDX. Viz také <https://spdx.org/ids> pro krátký úvod a příklady.
uk: Ідентифікатор SPDX --- Короткий ідентифікатор SPDX, як визначено у Специфікації SPDX. Перегляньте також короткий вступ і приклади <https://spdx.org/ids>.

source: SPDX License Expression --- as defined in SPDX Specification.
cs: SPDX License Expression --- jak je definováno ve specifikaci SPDX.
uk: Вираз ліцензії SPDX --- як визначено у специфікації SPDX.

source: SPDX License List --- a list of commonly found licenses and exceptions; as available on <https://spdx.org/licenses/>.
cs: Seznam licencí SPDX --- seznam běžně používaných licencí a výjimek; k dispozici na <https://spdx.org/licenses/>.
ru: Список лицензий SPDX --- список часто встречающихся лицензий и исключений; доступен на <https://spdx.org/licenses/>.
uk: Список ліцензій SPDX — список поширених ліцензій і винятків; доступний на <https://spdx.org/licenses/>.

source: DEP5 --- [Machine-readable `debian/copyright` file, Version 1.0](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/). Where the REUSE Specification and DEP5 state different things, the REUSE Specification takes precedence. Specifically in the case of the `Copyright` and `License` tags.
cs: DEP5 --- [Strojově čitelný soubor `debian/copyright`, verze 1.0](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/). Pokud specifikace REUSE a DEP5 uvádějí různé věci, má přednost specifikace REUSE. Konkrétně v případě značek `Copyright` a `License`.
ru: DEP5 --- [Машиночитаемый файл `debian/copyright`, версия 1.0](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/). Там, где спецификация REUSE и DEP5 указывают разные вещи, спецификация REUSE имеет приоритет. В частности, в случае тегов `Согласие` и `Лицензия`.
uk: DEP5 — [Машинозчитуваний `debian/copyright`, версія 1.0](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/). Якщо специфікація REUSE та DEP5 мають розбіжності, специфікація REUSE має пріоритет. Зокрема, у випадку з тегами `Copyright` і `License`.

source: REUSE Tool --- helper tool for compliance with this Specification; available at <https://github.com/fsfe/reuse-tool>.
ru: REUSE Tool --- вспомогательный инструмент для обеспечения соответствия данной спецификации; доступен по адресу <https://github.com/fsfe/reuse-tool>.
uk: Інструмент REUSE — допоміжний інструмент для дотримання цієї специфікації; доступний на <https://github.com/fsfe/reuse-tool>.

source: License files
cs: Licenční soubory
ru: Файлы лицензии
uk: Файли ліцензій

source: A Project MUST include a License File for every license under which files in the Project are licensed.
cs: Projekt MUSÍ obsahovat licenční soubor pro každou licenci, pod kterou jsou soubory v projektu licencovány.
ru: Проект ДОЛЖЕН содержать файл лицензии для каждой лицензии, по которой лицензируются файлы в проекте.
uk: Проєкт ПОВИНЕН включати файл ліцензії для кожної ліцензії, за якою ліцензуються файли в Проєкті.

source: Each License File MUST be placed in the `LICENSES/` directory in the root of the Project. The name of the License File MUST be the SPDX identifier of the license followed by an appropriate file extension (example: `LICENSES/GPL-3.0-or-later.txt`). The License File MUST be in plain text format.
cs: Každý licenční soubor MUSÍ být umístěn v adresáři `LICENSES/` v kořenovém adresáři projektu. Název licenčního souboru MUSÍ být SPDX identifikátor licence následovaný příslušnou příponou souboru (příklad: `LICENSES/GPL-3.0-or-later.txt`). Licenční soubor MUSÍ být ve formátu prostého textu.
uk: Кожен файл ліцензії ПОВИНЕН бути розміщений у каталозі `LICENSES/` у корені проєкту. Назва файлу ліцензії МАЄ бути SPDX-ідентифікатором ліцензії, за яким слідує відповідне розширення файлу (наприклад: `LICENSES/GPL-3.0-or-later.txt`). Файл ліцензії ПОВИНЕН бути у форматі звичайного тексту.

source: If a license does not exist in the SPDX License List, its SPDX Identifier MUST be `LicenseRef-[idstring]` as defined by the SPDX Specification.
cs: Pokud licence v seznamu licencí SPDX neexistuje, její identifikátor SPDX MUSÍ být `LicenseRef-[idstring]`, jak je definováno ve specifikaci SPDX.
uk: Якщо ліцензія не існує у списку ліцензій SPDX, її SPDX-ідентифікатор МАЄ бути `LicenseRef-[idstring]`, як визначено у специфікації SPDX.

source: A Project MUST NOT include License Files for licenses under which none of the files in the Project are licensed.
cs: Projekt NESMÍ obsahovat licenční soubory pro licence, pod kterými není licencován žádný ze souborů v projektu.
ru: Проект НЕ ДОЛЖЕН включать файлы лицензий для лицензий, под которыми не лицензируется ни один из файлов в проекте.
uk: Проєкт НЕ ПОВИНЕН містити файли ліцензій для ліцензій, за якими не ліцензований жоден із файлів у проєкті.

source: Everything that applies to licenses in this section also applies to license exceptions, with the exception that it is NOT possible to have a license exception that does not exist in the SPDX License List.
cs: Vše, co platí pro licence v této části, platí také pro výjimky z licencí s tou výjimkou, že NENÍ možné mít výjimku z licence, která neexistuje v seznamu licencí SPDX.
ru: Все, что относится к лицензиям в этом разделе, относится и к исключениям лицензий, за исключением того, что НЕВОЗМОЖНО иметь исключение лицензии, которого нет в списке лицензий SPDX.
uk: Усе, що стосується ліцензій у цьому розділі, також стосується ліцензійних винятків, за винятком тих, що НЕ можуть мати ліцензійного винятку, якого немає у списку ліцензій SPDX.

source: Copyright and Licensing Information
cs: Informace o autorských právech a licencích
ru: Информация об авторских правах и лицензировании
uk: Відомості про авторські права та ліцензування

source: Each file in the Project MUST have Copyright and Licensing Information associated with it, except the following files:
cs: Ke každému souboru v projektu MUSÍ být přiřazeny informace o autorských právech a licencích, s výjimkou následujících souborů:
ru: Каждый файл в проекте ДОЛЖЕН содержать информацию об авторских правах и лицензировании, за исключением следующих файлов:
uk: Кожен файл у проєкті ПОВИНЕН містити відомості про авторські права та ліцензування, пов’язану з ним, за винятком таких файлів:

source: The License Files.
cs: Licenční soubory.
uk: Файли ліцензії.

source: The files belonging to the Project's version control system (example: `.git/`).
cs: Soubory patřící do systému správy verzí projektu (příklad: `.git/`).
ru: Файлы, принадлежащие системе контроля версий проекта (пример: `.git/`).
uk: Файли, що належать до системи контролю версій Проєкту (наприклад: `.git/`).

source: The files ignored by the version control system (example: Files listed in `.gitignore`).
cs: Soubory ignorované systémem správy verzí (příklad: Soubory uvedené v souboru `.gitignore`).
ru: Файлы, игнорируемые системой контроля версий (пример: файлы, перечисленные в `.gitignore`).
uk: Файли, проігноровані системою контролю версій (наприклад: Файли, перелічені в `.gitignore`).

source: The files in the `.reuse/` directory in the root of the Project. This directory MUST contain only files relevant for the operation of the REUSE Tool.
cs: Soubory v adresáři `.reuse/` v kořenovém adresáři projektu. Tento adresář MUSÍ obsahovat pouze soubory důležité pro provoz nástroje REUSE.
ru: Файлы в директории `.reuse/` в корне проекта. Этот каталог ДОЛЖЕН содержать только файлы, имеющие отношение к работе инструмента REUSE.
uk: Файли в каталозі `.reuse/` в корені проєкту. Цей каталог повинен містити лише файли, що стосуються роботи засобу REUSE.

source: There are two ways to associate Copyright and Licensing Information with a file.
cs: Informace o autorských právech a licencích lze k souboru přiřadit dvěma způsoby.
ru: Существует два способа связать авторские права и лицензионную информацию с файлом.
uk: Існує два способи пов'язування відомостей про авторські права та ліцензування з файлом.

source: Comment headers
cs: Záhlaví komentářů
ru: Заголовки комментариев
uk: Коментарі в заголовку

source: To implement this method, each plain text file that can contain comments MUST contain comments at the top of the file (comment header) that declare that file's Copyright and Licensing Information.
cs: Pro implementaci této metody musí každý textový soubor, který může obsahovat komentáře, MUSÍ obsahovat komentáře v horní části souboru (záhlaví komentáře), které deklarují autorská práva a licenční informace daného souboru.
ru: Чтобы реализовать этот метод, каждый обычный текстовый файл, который может содержать комментарии, ДОЛЖЕН содержать комментарии в верхней части файла (заголовок комментария), которые объявляют авторские права и лицензионную информацию этого файла.
uk: Щоб впровадити цей метод, кожен звичайний текстовий файл, який може містити коментарі, ПОВИНЕН містити коментарі у верхній частині файлу (заголовок коментаря), які оголошують відомості про авторські права та ліцензування цього файлу.
