Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: You can license files globally using the `REUSE.toml` file, typically placed in the root of your project, but it can be placed anywhere relative to the files. An example of the file follows:
cs: Soubory můžete licencovat globálně pomocí souboru `REUSE.toml`, který je obvykle umístěn v kořenovém adresáři projektu, ale může být umístěn kdekoli vzhledem k souborům. Příklad souboru je uveden níže:
uk: Ви можете ліцензувати файли глобально за допомогою файлу `REUSE.toml`, який зазвичай розміщується в корені вашого проєкту, але його можна розмістити де завгодно відносно файлів. Приклад файлу наведено далі:

source: version = 1 # A simple glob of all files in resources/img/ [[annotations]] path = "resources/img/*" SPDX-FileCopyrightText = "2024 Jane Doe <jane@example.com>" SPDX-License-Identifier = "CC0-1.0" # All files in resources/vid/, with multiple copyright holders [[annotations]] path = "resources/vid/*" SPDX-FileCopyrightText = [ "2024 Jane Doe <jane@example.com>", "2024 John Doe <john@example.com>" ] SPDX-License-Identifier = "CC-BY-4.0" # A recursive glob of all files and directories in tests/resources/, # and the REUSE information of these files is overridden. [[annotations]] path = "tests/resources/**" precedence = "override" SPDX-FileCopyrightText = "2024 Jane Doe <jane@example.com>" SPDX-License-Identifier = "CC0-1.0" # Two computer-generated files. [[annotations]] path = [ "poetry.lock", "requirements.txt" ] SPDX-FileCopyrightText = "NONE" SPDX-License-Identifier = "CC0-1.0"
cs: verze = 1 # Jednoduchý glob všech souborů v resources/img/ [[annotations]] path = "resources/img/*" SPDX-FileCopyrightText = "2024 Jane Doe <jane@example.com>" SPDX-License-Identifier = "CC0-1.0" # Všechny soubory v resources/vid/ s více držiteli autorských práv [[annotations]] path = "resources/vid/*" SPDX-FileCopyrightText = [ "2024 Jane Doe <jane@example.com>", "2024 John Doe <john@example.com>" ] SPDX-License-Identifier = "CC-BY-4.0" # Rekurzivní glob všech souborů a adresářů v adresáři tests/resources/, # a informace o REUSE těchto souborů jsou přepsány. [[annotations]] path = "tests/resources/**" precedence = "override" SPDX-FileCopyrightText = "2024 Jane Doe <jane@example.com>" SPDX-License-Identifier = "CC0-1.0" # Dva soubory vytvořené počítačem. [[annotations]] path = [ "poetry.lock", "requirements.txt" ] SPDX-FileCopyrightText = "NONE" SPDX-License-Identifier = "CC0-1.0"
uk: version = 1 # A simple glob of all files in resources/img/ [[annotations]] path = "resources/img/*" SPDX-FileCopyrightText = "2024 Jane Doe <jane@example.com>" SPDX-License-Identifier = "CC0-1.0" # All files in resources/vid/, with multiple copyright holders [[annotations]] path = "resources/vid/*" SPDX-FileCopyrightText = [ "2024 Джейн Доу <jane@example.com>", "2024 Джейн Доу <john@example.com>" ] SPDX-License-Identifier = "CC-BY-4.0" # A recursive glob of al изначена. [[annotations]] path = "tests/resources/**" precedence = "override" SPDX-FileCopyrightText = "2024 Jane Doe <jane@example.com>" SPDX-License-Identifier = "CC0-1.0" # Два комп'ютерні файли. [[annotations]] path = [ "poetry.lock", "requirements.txt" ] SPDX-FileCopyrightText = "NONE" SPDX-License-Identifier = "CC0-1.0"

source: ... override erroneous REUSE information? {#override-info}
cs: ... přepsat chybné informace REUSE? {#override-info}
uk: ... перевизначити помилкову інформацію REUSE? {#override-info}

source: You may have a file that contains copyright or licensing tags that are wrong. This may be on purpose, or maybe you have good reasons not to edit these files. You have a few options to instruct REUSE to ignore the erroneous information and to use correct information instead.
cs: Je možné, že soubor obsahuje nesprávné značky autorských práv nebo licencí. Může to být záměrně, nebo máte dobré důvody tyto soubory neupravovat. Máte několik možností, jak dát programu REUSE pokyn, aby chybné informace ignoroval a místo nich použil správné informace.
uk: Можливо, у вас є файл, який містить неправильні теги авторських прав або ліцензування. Можливо, це зроблено навмисно, а можливо, у вас є вагомі причини не редагувати ці файли. У вас є кілька варіантів, як наказати REUSE ігнорувати помилкову інформацію і використовувати замість неї правильну.

source: Use [the `REUSE-IgnoreStart` and `REUSE-IgnoreEnd` tags](#exclude-lines) inside of the file.
cs: Uvnitř souboru použijte [značky `REUSE-IgnoreStart` a `REUSE-IgnoreEnd`](#exclude-lines).
uk: Використовуйте [теги `REUSE-IgnoreStart` і `REUSE-IgnoreEnd`](#exclude-рядки) всередині файлу.

source: Use [a `.license` file to override the contents of the file](#uncommentable-file).
cs: Použijte [a `.license` file to override the contents of the file](#uncommentable-file).
uk: Використовуйте [файл `.license` для заміни вмісту файлу](#uncommentable-file).

source: Use [a `REUSE.toml` file](#bulk-license) with the `precedence = "override"` key-value.
cs: Použijte [a `REUSE.toml` file](#bulk-license) s klíčovou hodnotou `precedence = "override"`.
uk: Використовуйте [файл `REUSE.toml`](#bulk-license) з ключовим значенням `precedence = "override"`.

source: ... add additional REUSE information to a file without editing the header? {#aggregate-info}
cs: ... přidat do souboru dodatečné informace REUSE bez úpravy záhlaví? {#aggregate-info}
uk: ... додати додаткову інформацію REUSE до файлу без редагування заголовка? {#aggregate-info}

source: There is a specific corner case where a file may contain valid REUSE information (usually copyright holders), but it is not desirable for you to edit this file's comment header by hand, even though there is more information that should apply to this file. A good example of this corner case is `.po` files provided by translators. These may or may not contain copyright and licensing information, depending on the translator's translation software and settings.
cs: Existuje specifický rohový případ, kdy soubor může obsahovat platné informace REUSE (obvykle držitelé autorských práv), ale není žádoucí, abyste ručně upravovali hlavičku komentáře tohoto souboru, přestože by se na tento soubor mělo vztahovat více informací. Dobrým příkladem tohoto rohového případu jsou soubory `.po` poskytované překladateli. Ty mohou, ale nemusí obsahovat informace o autorských právech a licencích, v závislosti na překladatelském softwaru a nastavení překladatele.
uk: Існує особливий випадок, коли файл може містити дійсну інформацію про REUSE (зазвичай власників авторських прав), але вам не бажано редагувати заголовок коментаря цього файлу вручну, навіть якщо у ньому міститься більше інформації, яка повинна застосовуватися до цього файлу. Хорошим прикладом цього кутового випадку є файли `.po`, надані перекладачами. Вони можуть містити або не містити інформацію про авторські права та ліцензування, залежно від програмного забезпечення та налаштувань перекладача.

source: You can add additional information using the `precedence = "aggregate"` key-value in your [`REUSE.toml` file](#bulk-license). An example looks like this:
cs: Další informace můžete přidat pomocí klíčové hodnoty `precedence = "aggregate"` v [`REUSE.toml` file](#bulk-license). Příklad vypadá takto:
uk: Ви можете додати додаткову інформацію за допомогою ключа-значення `precedence = "aggregate"` у вашому файлі [`REUSE.toml`](#bulk-license). Приклад виглядає так:

source: [[annotations]] path = "po/*.po" precedence = "aggregate" SPDX-FileCopyrightText = "Contributors to My Project" SPDX-License-Identifier = "GPL-3.0-or-later"
cs: [[annotations]] path = "po/*.po" precedence = "aggregate" SPDX-FileCopyrightText = "Přispěvatelé do mého projektu" SPDX-License-Identifier = "GPL-3.0-or-later"
uk: [[анотації]] path = "po/*.po" precedence = "aggregate" SPDX-FileCopyrightText = "Учасники мого проєкту" SPDX-License-Identifier = "GPL-3.0-or-later"

source: In the above example, 'Contributors to My Project' is added to the file's copyright holders (if any), and 'GPL-3.0-or-later' is added to the file's licenses (if any).
cs: Ve výše uvedeném příkladu se k držitelům autorských práv souboru (pokud existují) přidá "Contributors to My Project" a k licencím souboru (pokud existují) se přidá "GPL-3.0-or-later".
uk: У наведеному вище прикладі до власників авторських прав файлу (якщо такі є) додано "Contributors to My Project", а до ліцензій файлу (якщо такі є) додано "GPL-3.0-or-later".

source: ... copy someone else's work? {#copy-work}
cs: ... kopírovat cizí práci? {#copy-work}
uk: ...копіювати чужу роботу? {#copy-work}

source: If someone else has made their work available for you to use and copy, you can incorporate their work into your project. When you put the work in one of the files in your project, you should add an `SPDX-FileCopyrightText` tag for the copyright holder(s) and an `SPDX-License-Identifier` tag for the license(s) under which the work was made available.
cs: Pokud vám někdo jiný poskytl svou práci k použití a kopírování, můžete jeho práci začlenit do svého projektu. Když vložíte dílo do některého ze souborů ve svém projektu, měli byste přidat značku `SPDX-FileCopyrightText` pro držitele autorských práv a značku `SPDX-License-Identifier` pro licenci (licence), pod kterou bylo dílo zpřístupněno.
ru: Если кто-то другой предоставил свою работу для использования и копирования, вы можете включить его работу в свой проект. Когда вы помещаете работу в один из файлов вашего проекта, вы должны добавить тег `SPDX-файл с авторским правом (copyrightText) для владельца (владельцев) авторских прав и тег `SPDX-лицензия-идентификатор` для лицензии (лицензий), по которой работа была предоставлена.
uk: Якщо хтось інший зробив ваші роботи доступними для користування та копіювання, ви можете включити їхні роботи у свій проєкт. Коли ви розміщуєте роботу в одному з файлів у своєму проєкті, вам слід додати тег `SPDX-FileCopyrightText` для власників авторських прав та тег `SPDX-License-Identifier` для ліцензій, за якими ви надаєте свою роботу.

source: If the work was licensed differently from your project, you should [verify whether the licenses are compatible](#license-compatibility), and add the new licenses to your project.
cs: Pokud byla práce licencována jinak než váš projekt, měli byste [ověřit, zda jsou licence kompatibilní](#license-compatibility), a přidat nové licence do svého projektu.
uk: Якщо твір має іншу ліцензію, ніж ваш проєкт, вам слід [перевірити сумісність ліцензій](#license-compatibility) і додати нові ліцензії до вашого проєкту.

source: ... copy a work published under a pseudonym or nickname? {#copy-pseudonym}
cs: ... kopírovat dílo vydané pod pseudonymem nebo přezdívkou? {#copy-pseudonym}
uk: ... копіювати твір, опублікований під псевдонімом або ніком? {#copy-pseudonym}

source: You can list the pseudonym as the copyright holder. Some projects do not allow pseudonymous contributions.
cs: Jako držitele autorských práv můžete uvést pseudonym. Některé projekty příspěvky pod pseudonymem neumožňují.
uk: Ви можете вказати псевдонім як власника авторських прав. Деякі проєкти не дозволяють робити внески під псевдонімом.

source: ... copy a work that has no copyright notice or license? {#no-copyright-license}
cs: ... zkopírovat dílo, které není opatřeno žádnou poznámkou o autorských právech nebo licencí? {#no-copyright-licence}
uk: ... копіювати роботу, яка не має повідомлення про авторське право або ліцензію? {#no-copyright-license}

source: Before you proceed, always first make sure that you can find the copyright and licensing information elsewhere. Some projects only include this information in the root directory or in their README file.
cs: Než začnete, vždy se nejprve ujistěte, že informace o autorských právech a licencích najdete jinde. Některé projekty obsahují tyto informace pouze v kořenovém adresáři nebo v souboru README.
ru: Прежде чем приступить к работе, убедитесь, что вы можете найти информацию об авторских правах и лицензировании в другом месте. Некоторые проекты включают эту информацию только в корневой каталог или в файл README.
uk: Перш ніж продовжити, завжди спочатку переконайтеся, що ви можете знайти відомості про авторські права та ліцензування в іншому місці. Деякі проєкти містять цю інформацію лише у кореневому каталозі або у файлі README.

source: If you can find no copyright notice, you can try to add it yourself by divining the copyright holder from the author. See [this question](#copyright-holder-author) for more information on the distinction. When in doubt, contact the author for clarification.
cs: Pokud žádné upozornění na autorská práva nenajdete, můžete se pokusit přidat je sami tak, že zjistíte držitele autorských práv od autora. Více informací o tomto rozlišení naleznete v [tato otázka](#copyright-holder-author). V případě pochybností se obraťte na autora a požádejte ho o vysvětlení.
uk: Якщо ви не знайшли повідомлення про авторські права, ви можете спробувати додати його самостійно, відділивши правовласника від автора. Перегляньте [це питання](#copyright-holder-author), щоб дізнатися подробиці про цю різницю. У разі виникнення сумнівів, зверніться до автора за роз'ясненнями.

source: It may be that the author wishes to remain anonymous, which is their right. You can write [`NONE` or `NOASSERTION` as the copyright holder](https://spdx.github.io/spdx-spec/v2.3/file-information/#88-copyright-text-field).
cs: Je možné, že si autor přeje zůstat v anonymitě, což je jeho právo. Jako držitele autorských práv můžete napsat [`NONE` nebo `NOASSERTION`](https://spdx.github.io/spdx-spec/v2.3/file-information/#88-copyright-text-field).
uk: Можливо, автор бажає залишитися анонімним, що є його правом. Ви можете написати [`NONE` або `NOASSERTION` як правовласник](https://spdx.github.io/spdx-spec/v2.3/file-information/#88-copyright-text-field).

source: If the work has no license, then that means that you do not have the right to copy it. If you believe that this is a mistake and the author clearly meant for you to be able to copy this work, you should contact the author and ask them to license their work. Feel free to refer them to <https://reuse.software>.
cs: Pokud dílo nemá licenci, znamená to, že nemáte právo ho kopírovat. Pokud se domníváte, že se jedná o chybu a autor zjevně chtěl, abyste toto dílo mohli kopírovat, měli byste autora kontaktovat a požádat ho o poskytnutí licence. Neváhejte je odkázat na adresu <https://reuse.software>.
ru: Если у произведения нет лицензии, это значит, что у вас нет права на его копирование. Если вы считаете, что это ошибка и автор явно хотел, чтобы вы могли копировать эту работу, вам следует связаться с автором и попросить его лицензировать свою работу. Не стесняйтесь направить их по адресу <https://reuse.software>.
uk: Якщо робота не має ліцензії, то це означає, що ви не маєте права її копіювати. Якщо ви вважаєте, що це помилка, і автор явно мав на увазі, що ви можете скопіювати цю роботу, вам слід зв'язатися з автором і попросити його ліцензувати свої роботи. Не соромтеся посилатися на <https://reuse.software>.

source: ... exclude a file from REUSE compliance testing? {#exclude-file}
cs: ... vyloučit soubor z testování shody REUSE? {#exclude-file}
uk: ... виключити файл з тестування на відповідність REUSE? {#exclude-file}

source: If the file is a build artifact and you use Git, simply make sure that the file is covered by your `.gitignore` file. The same goes for other VCS ignore mechanisms.
cs: Pokud je soubor artefaktem sestavení a používáte systém Git, jednoduše se ujistěte, že je soubor zahrnut v souboru `.gitignore`. Totéž platí pro ostatní mechanismy ignorování VCS.
uk: Якщо файл є артефактом збірки і ви використовуєте Git, просто переконайтеся, що він покривається вашим файлом `.gitignore`. Те саме стосується інших механізмів ігнорування VCS.

source: Otherwise, you cannot exclude files from REUSE compliance testing. It would go entirely against the purpose of REUSE: making sure that every file has a copyright and license tag.
cs: V opačném případě nelze soubory z testování shody s nařízením REUSE vyloučit. To by bylo zcela v rozporu s účelem systému REUSE: zajistit, aby každý soubor obsahoval značku autorských práv a licence.
ru: В противном случае вы не сможете исключить файлы из проверки на соответствие REUSE. Это полностью противоречит цели REUSE: убедиться, что каждый файл имеет метку авторского права и лицензии.
uk: В іншому випадку не можна виключити файли з перевірки відповідності REUSE. Це суперечитиме меті REUSE: переконайтеся, що кожен файл має авторське право та тег ліцензії.

source: If you really want to exclude a file, consider using the [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/) license for this file. By doing this, you put the file in the [public domain, or your country's equivalent](https://fsfe.org/freesoftware/legal/faq.html#public-domain).
cs: Pokud chcete soubor opravdu vyloučit, zvažte, zda pro něj nepoužít licenci [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/). Tím soubor zařadíte do [public domain nebo ekvivalentní licence vaší země](https://fsfe.org/freesoftware/legal/faq.html#public-domain).
uk: Якщо ви дійсно хочете виключити файл, подумайте про застосування для нього ліцензії [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/). Таким чином, ви переносите файл у [суспільне надбання або еквівалент у вашій країні] (https://fsfe.org/freesoftware/legal/faq.html#public-domain).

source: If you have an entire directory that you want to "exclude" from REUSE compliance testing, you can [use `REUSE.toml`](#bulk-license).
cs: Pokud máte celý adresář, který chcete "vyloučit" z testování shody s REUSE, můžete [use `REUSE.toml`](#bulk-license).
uk: Якщо у вас є цілий каталог, який ви хочете "виключити" з перевірки на відповідність REUSE, ви можете [використовувати `REUSE.toml`](#bulk-license).

source: ... exclude certain lines from REUSE compliance testing? {#exclude-lines}
cs: ... vyloučit některé řádky z testování shody REUSE? {#exclude-lines}
uk: ... виключити певні рядки з перевірки на відповідність REUSE? {#exclude-lines}

source: In order to make the tool ignore a specific section containing strings that may falsely be detected as copyright or license statements, you can wrap it within the two comments `REUSE-IgnoreStart` and `REUSE-IgnoreEnd`.
cs: Chcete-li, aby nástroj ignoroval určitou sekci obsahující řetězce, které mohou být falešně detekovány jako prohlášení o autorských právech nebo licenci, můžete ji zabalit do dvou komentářů `REUSE-IgnoreStart` a `REUSE-IgnoreEnd`.
uk: Щоб змусити інструмент ігнорувати певний розділ, який містить рядки, що можуть бути помилково розпізнані як твердження про авторське право або ліцензію, ви можете загорнути його у два коментарі `REUSE-IgnoreStart` і `REUSE-IgnoreEnd`.

source: Please note that this must not be used to ignore valid copyright and licensing information by yourself or a third party. The ignore blocks must only be used for marking blocks that may trigger false-positive detections and errors.
cs: Vezměte prosím na vědomí, že toto nesmí být použito k ignorování platných informací o autorských právech a licencích vámi nebo třetí stranou. Bloky ignorování se musí používat pouze pro označení bloků, které mohou vyvolat falešně pozitivní detekce a chyby.
uk: Зауважте, що це не повинно використовуватися для ігнорування дійсної інформації про авторські права та ліцензування вами або третьою стороною. Блоки ігнорування слід використовувати лише для позначення блоків, які можуть спричинити хибнопозитивні спрацьовування та помилки.

source: An example for a file that contains commands or documentation that confuse the REUSE tool:
cs: Příklad souboru, který obsahuje příkazy nebo dokumentaci matoucí nástroj REUSE:
uk: Приклад для файлу, який містить команди або документацію, що заплутують інструмент REUSE:

source: # SPDX-FileCopyrightText: 2021 Jane Doe # # SPDX-License-Identifier: GPL-3.0-or-later echo "SPDX-FileCopyrightText: $(date +'%Y') John Doe" > file.txt echo "SPDX-License-Identifier: MIT" >> file.txt
uk: # SPDX-FileCopyrightText: 2021 Джейн Доу # # SPDX-License-Identifier: GPL-3.0-or-later echo "SPDX-FileCopyrightText: $(date +'%Y') John Doe" > file.txt echo "SPDX-License-Identifier: MIT" >> file.txt

source: This is how the section can be ignored:
cs: Takto lze oddíl ignorovat:
uk: Розділ можна проігнорувати так:

source: # SPDX-FileCopyrightText: 2021 Jane Doe # # SPDX-License-Identifier: GPL-3.0-or-later # REUSE-IgnoreStart echo "SPDX-FileCopyrightText: $(date +'%Y') John Doe" > file.txt echo "SPDX-License-Identifier: MIT" >> file.txt # REUSE-IgnoreEnd
uk: # SPDX-FileCopyrightText: 2021 Джейн Доу # # SPDX-License-Identifier: GPL-3.0-or-later # REUSE-IgnoreStart echo "SPDX-FileCopyrightText: $(date +'%Y') John Doe" > file.txt echo "SPDX-License-Identifier: MIT" >> file.txt # REUSE-IgnoreEnd

source: ... deal with uncopyrightable files? {#uncopyrightable}
cs: ... zabývat se soubory, na které se nevztahují autorská práva? {#uncopyrightable}
uk: ... працювати з файлами без авторських прав? {#uncopyrightable}

source: Some files, such as those generated by code, or config files which contain no creative expression, may not be copyrightable. However, REUSE mandates licensing information for every single file, so there is a conflict here. Because we [do not allow excluding files](#exclude-file), some information must be recorded for such files.
cs: Některé soubory, například soubory generované kódem nebo konfigurační soubory, které neobsahují žádné tvůrčí vyjádření, nemusí být chráněny autorským právem. REUSE však nařizuje uvádět licenční informace u každého jednotlivého souboru, takže zde dochází ke konfliktu. Protože [nepovolujeme vyloučení souborů](#exclude-file), musí být u takových souborů zaznamenány určité informace.
uk: Деякі файли, наприклад, згенеровані кодом або конфігураційні файли, які не містять творчого вираження, можуть не охоронятися авторським правом. Однак REUSE вимагає надання ліцензійної інформації для кожного окремого файлу, тому тут виникає конфлікт. Оскільки ми [не дозволяємо виключати файли] (#exclude-file), для таких файлів має бути записана певна інформація.

source: You have two options:
cs: Máte dvě možnosti:
uk: У вас два варіанти:

source: Simply use your regular copyright and license for this file. There is nothing that stops you from "claiming" copyright over your own works, even if a court might hypothetically find such files uncopyrightable.
cs: Pro tento soubor jednoduše použijte běžná autorská práva a licenci. Nic vám nebrání v tom, abyste si "nárokovali" autorská práva na svá vlastní díla, i když by soud hypoteticky mohl takové soubory shledat neautorskými.
uk: Просто використовуйте свої звичайні авторські права та ліцензію для цього файлу. Ніщо не заважає вам "заявити" авторські права на власні роботи, навіть якщо суд гіпотетично може визнати такі файли такими, що не охороняються авторським правом.

source: Waive your copyright using the [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/) license or another similar public domain dedication.
cs: Zřekněte se autorských práv pomocí licence [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/) nebo jiné podobné public domain dedikace.
uk: Відмовтеся від авторських прав, використовуючи ліцензію [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/) або іншу подібну ліцензію суспільного надбання.

source: You may choose to use a copyright tag such as `SPDX-FileCopyrightText: NONE` to assert that there is no copyright holder.
cs: Můžete se rozhodnout použít značku autorských práv, například `SPDX-FileCopyrightText: NONE`, abyste potvrdili, že neexistuje žádný držitel autorských práv.
uk: Ви можете використовувати тег авторських прав, наприклад, `SPDX-FileCopyrightText: NONE", щоб засвідчити відсутність власника авторських прав.
