Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: But even smaller projects or projects with simple licensing benefit from REUSE. For good or for ill, licensing is a cornerstone of the Free Software movement. It is what enables sharing, and in the case of copyleft, it enables us to keep software Free. Getting licensing right is important, or else people won't be able to use your software, and REUSE is a simple component in helping you with this.
cs: Ale i menší projekty nebo projekty s jednoduchým licencováním mají z REUSE prospěch. V dobrém i zlém je licencování základním kamenem hnutí svobodného softwaru. Umožňuje sdílení a v případě copyleftu nám umožňuje zachovat svobodný software. Správné licencování je důležité, jinak lidé nebudou moci váš software používat, a REUSE je jednoduchá součást, která vám s tím pomůže.
uk: Але навіть менші проєкти або проєкти з простим ліцензуванням отримують вигоду від REUSE. Добре це чи погано, але ліцензування — це наріжний камінь руху за вільне програмне забезпечення. Це те, що уможливлює спільне використання, а у випадку копілефту — дозволяє нам зберігати програмне забезпечення вільним. Правильне ліцензування дуже важливе, інакше люди не зможуть користуватися вашим програмним забезпеченням, і REUSE — це простий компонент, який допоможе вам у цьому.

source: Furthermore, even if your project is simple _now_, it may not always be so. If you copy some code from another project that is differently licensed, you are often obliged to attribute correctly and/or provide the accompanying license text. By implementing REUSE early, it is a lot easier to discern your code from third-party code and correctly keep track of these things.
cs: Navíc, i když je váš projekt jednoduchý _teď_, nemusí tomu tak být vždy. Pokud zkopírujete nějaký kód z jiného projektu, který má jinou licenci, jste často povinni jej správně připsat a/nebo uvést doprovodný text licence. Díky včasnému zavedení REUSE je mnohem snazší rozeznat váš kód od kódu třetí strany a správně tyto věci sledovat.
uk: Щобільше, навіть якщо ваш проєкт простий _тепер_, він не завжди може бути таким. Якщо ви копіюєте якийсь код з іншого проєкту, що має іншу ліцензію, ви часто зобов'язані правильно вказувати авторство та/або надавати супровідний текст ліцензії. Впровадивши REUSE на ранній стадії, набагато легше відрізнити свій код від коду сторонніх розробників і правильно відстежувати ці речі.

source: Lastly, implementing REUSE is a small service to others. As a software engineer, it can be frustrating when you find some code that is purpose-built for the problem you are trying to solve, but you are unable to figure out the licensing of that code, effectively making it impossible to, well, reuse that code. REUSE helps you help other developers in reusing your code, which is one of the great boons of Free Software.
cs: A konečně, provádění REUSE je malou službou ostatním. Jako softwarový inženýr můžete být frustrující, když najdete nějaký kód, který je účelově vytvořen pro problém, který se snažíte vyřešit, ale nejste schopni zjistit, jak je to s licencí tohoto kódu, což v podstatě znemožňuje jeho opětovné použití. REUSE vám pomůže pomoci ostatním vývojářům při opakovaném použití vašeho kódu, což je jeden z velkých přínosů svobodného softwaru.
uk: Зрештою, впровадження REUSE — це маленька послуга для інших. Інженера-програміста може розчаровувати, коли ви знаходите якийсь код, спеціально створений для проблеми, яку ви намагаєтеся усунути, але не можете розібратися з ліцензуванням цього коду, що фактично унеможливлює повторне використання цього коду. REUSE допоможе вам допомогти іншим розробникам повторно використовувати ваш код, що є однією з найбільших переваг вільного програмного забезпечення.

source: I'm used to doing things differently; can't I just keep doing what I have always been doing? {#tradition}
cs: Jsem zvyklý dělat věci jinak; nemohu prostě pokračovat v tom, co jsem dělal vždycky? {#tradition}
uk: Для мене звично робити все інакше; хіба я не можу продовжувати робити те, що й завжди? {#tradition}

source: Some people, when they first encounter REUSE, run into a couple of things that are very different from what they are used to. They miss the long legal blurbs at the tops of files, miss the `COPYING`/`LICENSE` file in the root of the repository, think that `.license` files clutter the directory, or find it very strange that even insignificant non-code files get licensing headers. The different-ness of REUSE can seem peculiar in that way.
cs: Někteří lidé se při prvním setkání s REUSE setkají s několika věcmi, které se velmi liší od toho, na co jsou zvyklí. Chybí jim dlouhé právní poznámky v horní části souborů, postrádají soubor `COPYING`/`LICENSE` v kořenovém adresáři úložiště, myslí si, že soubory `.license` zahlcují adresář, nebo jim připadá velmi zvláštní, že i bezvýznamné nekódové soubory dostávají licenční hlavičky. Odlišnost REUSE se v tomto směru může zdát zvláštní.
uk: Деякі люди, коли вперше стикаються з REUSE, стикаються з кількома речами, які дуже відрізняються від того, до чого вони звикли. Їм не вистачає довгих юридичних написів у верхній частині файлів, не вистачає файлу `COPYING`/`LICENSE` у корені сховища, вони думають, що файли `.license` захаращують каталог, або вважають дуже дивним, що навіть незначні некодові файли отримують заголовки з ліцензіями. Таким чином, інакшість REUSE може здаватися своєрідною.

source: One of REUSE's main goals is to be as compatible to existing best practices as possible. It explicitly breaks with some old traditions, however. We believe that REUSE is better for it. By breaking new ground, REUSE is simpler, more comprehensive, and more unambiguous than it would have been if we tried to maintain compatibility with traditions of old.
cs: Jedním z hlavních cílů projektu REUSE je co největší kompatibilita se stávajícími osvědčenými postupy. Výslovně však porušuje některé staré tradice. Věříme, že díky tomu je REUSE lepší. Díky tomu, že prolamuje nové hranice, je REUSE jednodušší, komplexnější a jednoznačnější, než kdybychom se snažili zachovat kompatibilitu se starými tradicemi.
uk: Одна з головних цілей REUSE - бути максимально сумісним з наявними передовими практиками. Однак, він явно порушує деякі давні традиції. Ми вважаємо, що для цього краще підійде REUSE. Відкриваючи нові горизонти, REUSE є простішим, всеосяжнішим і однозначнішим, ніж це було б, якби ми намагалися зберегти сумісність з давніми традиціями.

source: Nothing prevents you from adding long legal blurbs to your headers or putting a `COPYING` file in the root of your directory _anyway_ though. These things can be done to your liking. Some other aspects of REUSE are unavoidable, however. REUSE maintains that _every single file should contain licensing information_, so that even the tiniest of files have licensing metadata. These things are simply inherent to the goal of REUSE, and we hope that these eccentricities will soon become commonplace, such that they would no longer seem so peculiar anymore.
cs: Nic vám však nebrání přidat do záhlaví dlouhé legální fráze nebo umístit soubor `COPYING` do kořene adresáře. Tyto věci si můžete udělat podle svých představ. Některým dalším aspektům REUSE se však vyhnout nelze. REUSE tvrdí, že _každý jednotlivý soubor by měl obsahovat licenční informace_, takže i ty nejmenší soubory obsahují licenční metadata. Tyto věci prostě neodmyslitelně patří k cíli REUSE a doufáme, že se tyto výstřednosti brzy stanou samozřejmostí, takže už nebudou působit tak zvláštně.
uk: Ніщо не заважає вам додавати довгі юридичні застереження до ваших заголовків або розміщувати файл `copying` у корені вашого каталогу в будь-якому випадку. Ці речі можна робити на свій смак. Однак деякі інші аспекти REUSE неминучі. REUSE вважає, що _кожен файл повинен містити інформацію про ліцензування_, тож навіть найменші файли мають метадані про ліцензування. Ці речі просто притаманні меті REUSE, і ми сподіваємося, що незабаром ці дивацтва стануть звичними, такими, що вже не здаватимуться такими особливими.

source: Why doesn't REUSE use the metadata fields in pictures, SVG, text documents etc.? {#metadata}
cs: Proč REUSE nepoužívá pole metadat v obrázcích, SVG, textových dokumentech atd.? {#metadata}
uk: Чому REUSE не використовує поля метаданих у зображеннях, SVG, текстових документах тощо? {#metadata}

source: Several file formats support the storage of metadata information within the file itself, and some even contain fields for copyright and license. However, we do not support these in REUSE for practical reasons:
cs: Některé formáty souborů podporují ukládání informací o metadatech v samotném souboru a některé dokonce obsahují pole pro autorská práva a licence. Ty však v systému REUSE z praktických důvodů nepodporujeme:
uk: Деякі формати файлів підтримують зберігання інформації про метадані у самому файлі, а деякі навіть містять поля для зазначення авторських прав та ліцензії. Однак, ми не підтримуємо їх у REUSE з практичних міркувань:

source: For humans and machines alike it's not always trivial to spot this information. REUSE intends to make it simple to find licensing and copyright information.
cs: Pro lidi i stroje není vždy triviální tyto informace rozpoznat. Záměrem systému REUSE je usnadnit vyhledávání informací o licencích a autorských právech.
uk: Як для людей, так і для машин не завжди просто розпізнати цю інформацію. REUSE має намір спростити пошук інформації про ліцензування та авторські права.

source: Some tools redact metadata fields, for example to make files smaller or remove potentially sensible personal information. This could also wipe your or someone else's copyright information, and detecting this mistake is hard.
cs: Některé nástroje upravují pole metadat, například aby zmenšily soubory nebo odstranily potenciálně citlivé osobní údaje. To může také vymazat vaše nebo cizí informace o autorských právech a odhalit tuto chybu je obtížné.
uk: Деякі інструменти редагують поля метаданих, наприклад, щоб зменшити розмір файлів або видалити потенційно чутливу особисту інформацію. Це також може стерти вашу або чиюсь іншу інформацію про авторські права, а виявити цю помилку складно.

source: With some file types, there are competing and unstandardised methods to store metadata.
cs: U některých typů souborů existují konkurenční a nestandardizované metody ukládání metadat.
uk: Для деяких типів файлів існують конкурентні та нестандартні методи зберігання метаданих.

source: This question is also related to [why we cannot use version control to record copyright](#vcs-copyright).
cs: Tato otázka také souvisí s otázkou [proč nemůžeme používat správu verzí pro záznam autorských práv](#vcs-copyright).
uk: Це питання також пов'язане з тим, [чому ми не можемо використовувати керування версіями для запису авторських прав](#vcs-copyright).

source: Why doesn't REUSE use version control to record copyright? {#vcs-copyright}
cs: Proč systém REUSE nepoužívá k evidenci autorských práv kontrolu verzí? {#vcs-copyright}
uk: Чому REUSE не використовує керування версіями для запису авторських прав? {#vcs-copyright}

source: In [a different question](#copyright-holder-author), we distinguish between copyright holders and authors, which are not always the same. Version control typically only records authorship, which makes it unsuitable for the task of recording copyright.
cs: V [jiné otázce](#copyright-holder-author) rozlišujeme mezi držiteli autorských práv a autory, což není vždy totéž. Kontrola verzí obvykle zaznamenává pouze autorství, což ji činí nevhodnou pro úkol zaznamenávat autorská práva.
uk: В [іншому питанні](#copyright-holder-author) ми розрізняємо власників авторських прав та авторів, які не завжди збігаються. Контроль версій зазвичай фіксує лише авторство, що робить його непридатним для фіксації авторських прав.

source: Another obstacle is that version control history may contain errors, and fixing such an error would require rewriting the history, causing all contributors to have to re-download the new trunk.
cs: Další překážkou je, že historie správy verzí může obsahovat chyby a oprava takové chyby by vyžadovala přepsání historie, což by způsobilo, že by všichni přispěvatelé museli znovu stáhnout nový kmen.
ru: Еще одно препятствие заключается в том, что история контроля версий может содержать ошибки, и исправление такой ошибки потребует переписывания истории, в результате чего всем участникам придется заново загружать новый ствол.
uk: Інша проблема полягає можливій наявності помилок в історії керування версіями, а виправлення такої помилки вимагатиме переписування історії, в результаті чого всім дописувачам доведеться повторно завантажити свій внесок.

source: A further issue with version control is that the `blame` command that is typically (mis)used to find authorship line-by-line shows only the author of the last commit in that line, even if it was just something as trivial as fixing a typo or moving a block of code to a different location.
cs: Dalším problémem správy verzí je, že příkaz `blame`, který se obvykle (nesprávně) používá ke zjištění autorství řádek po řádku, zobrazuje pouze autora poslední revize v daném řádku, i když šlo o tak triviální věc, jako je oprava překlepu nebo přesun bloku kódu na jiné místo.
uk: Ще одна проблема з контролем версій полягає в тому, що команда `blame`, яка зазвичай (неправильно) використовується для пошуку авторства по рядках, показує лише автора останнього коміту в цьому рядку, навіть якщо це було щось буденне, наприклад, виправлення помилки або переміщення блоку коду в інше місце.

source: What happened to `.reuse/dep5`? {#dep5-history}
cs: Co se stalo s `.reuse/dep5`? {#dep5-history}
uk: Що сталося з `.reuse/dep5`? {#dep5-history}

source: REUSE currently uses [`REUSE.toml` to bulk-license files](#bulk-license). But before version 3.2 of the specification, REUSE used `.reuse/dep5`, an almost-verbatim copy of [DEP5/`debian/copyright`](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).
cs: REUSE v současné době používá [`REUSE.toml` pro hromadné licencování souborů](#bulk-license). Před verzí 3.2 specifikace však REUSE používalo `.reuse/dep5`, téměř doslovnou kopii [DEP5/`debian/copyright`](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).
uk: Наразі REUSE використовує [`REUSE.toml` для файлів масових ліцензій](#bulk-license). Але до версії 3.2 специфікації REUSE використовував `.reuse/dep5`, майже дослівну копію [DEP5/`debian/copyright`](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).

source: In version 3.2, `.reuse/dep5` is deprecated but still supported, although mutually exclusive with `REUSE.toml`. You can use `reuse convert-dep5` to automatically convert a `.reuse/dep5` file to a semantically equivalent `REUSE.toml` file.
cs: Ve verzi 3.2 je `.reuse/dep5` zastaralý, ale stále podporovaný, i když se vzájemně vylučuje s `REUSE.toml`. Pomocí `reuse convert-dep5` můžete automaticky převést soubor `.reuse/dep5` na sémanticky ekvivalentní soubor `REUSE.toml`.
uk: У версії 3.2 `.reuse/dep5` застарів, але досі підтримується, хоча і є взаємозаперечним з `REUSE.toml`. Ви можете використовувати `reuse convert-dep5` для автоматичного перетворення файлу `.reuse/dep5` у семантично еквівалентний файл `REUSE.toml`.

source: `.reuse/dep5` was dropped in favour of `REUSE.toml` for various reasons:
cs: `.reuse/dep5` byl z různých důvodů zrušen ve prospěch `REUSE.toml`:
uk: `.reuse/dep5` було вилучено на користь `REUSE.toml` з різних причин:

source: `debian/copyright` was never a purposive match for REUSE. Debian uses this file to holistically declare the licensing of a package; REUSE uses it to fill the licensing gaps.
cs: `debian/copyright` nikdy nebyl účelovou shodou pro REUSE. Debian používá tento soubor k ucelenému prohlášení o licencích balíčku; REUSE jej používá k vyplnění licenčních mezer.
uk: `debian/copyright` ніколи не було цілеспрямованим поєднанням для REUSE. Debian використовує цей файл для цілісного декларування ліцензування пакунка; REUSE використовує його для заповнення прогалин у ліцензуванні.

source: `.reuse/dep5` was ambiguous on the licensing information of a file if its information was declared both in the file itself and in `.reuse/dep5`. Which information is applied? In version 3.2, this information is explicitly aggregated. Adding a new key to explicitly declare precedence would have been difficult, because...
cs: `.reuse/dep5` nejednoznačně určoval licenční informace souboru, pokud byly tyto informace deklarovány jak v samotném souboru, tak v `.reuse/dep5`. Které informace se použijí? Ve verzi 3.2 jsou tyto informace explicitně agregovány. Přidání nového klíče pro explicitní deklaraci priority by bylo obtížné, protože...
uk: `.reuse/dep5` був неоднозначним щодо інформації про ліцензування файлу, якщо ця інформація була оголошена як у самому файлі, так і в `.reuse/dep5`. Яка інформація застосовується? У версії 3.2 ця інформація явно агрегується. Додавання нового ключа для явного оголошення пріоритету було б складним, оскільки...

source: `.reuse/dep5` is hard to parse. There is a Python module in [python-debian](https://salsa.debian.org/python-debian-team/python-debian), but the format is custom and inflexible. One of REUSE's core aims is to be machine-readable, and this custom format was not conducive to that end.
cs: `.reuse/dep5` je obtížné analyzovat. V Pythonu existuje modul [python-debian](https://salsa.debian.org/python-debian-team/python-debian), ale jeho formát je nestandardní a nepružný. Jedním z hlavních cílů REUSE je být strojově čitelný a tento vlastní formát tomuto cíli neprospíval.
uk: `.reuse/dep5` важко розбирати. Існує модуль Python у [python-debian](https://salsa.debian.org/python-debian-team/python-debian), але його формат нестандартний і негнучкий. Одна з основних цілей REUSE - бути машинозчитуваним, а цей нестандартний формат не сприяв досягненню цієї мети.

source: TOML is more flexible. You can write any key-value that you want, which may be helpful for custom workflows.
cs: TOML je flexibilnější. Můžete zapsat libovolnou hodnotu klíče, což může být užitečné pro vlastní pracovní postupy.
uk: TOML більш гнучкий. Ви можете написати будь-яке значення ключа, що може бути корисним для користувацьких робочих процесів.

source: TOML is much easier to write. Developers already know how to write TOML, and don't need to accustom themselves to a custom format.
cs: TOML se píše mnohem snadněji. Vývojáři již vědí, jak psát TOML, a nemusí si zvykat na vlastní formát.
uk: TOML набагато простіше писати. Розробники вже знають, як писати TOML, і їм не потрібно привчати себе до спеціального формату.

source: `REUSE.toml` can be placed anywhere relative to the files, and can nest. This is a big help for monorepos or monorepo-like projects.
cs: `REUSE.toml` může být umístěn kdekoli vzhledem k souborům a může se vnořovat. To je velká pomoc pro projekty typu monorepo nebo monorepo.
uk: Файл `REUSE.toml` може бути розміщений у будь-якому місці відносно файлів і може бути вкладений. Це велика допомога для монорепозиторіїв або проєктів, схожих на монорепозиторії.

source: For compatibility, `.reuse/dep5` will remain supported in spite of its deprecation for a considerable length of time; at least until 2029.
cs: Z důvodu kompatibility zůstane soubor `.reuse/dep5` podporován navzdory svému zastarání po značně dlouhou dobu; přinejmenším do roku 2029.
uk: Для сумісності, `.reuse/dep5` буде підтримуватися, незважаючи на його застарілість, протягом тривалого часу; принаймні до 2029 року.

source: Tutorial: How to become REUSE-compliant
cs: Výukový program: Jak se stát kompatibilním s REUSE
ru: Учебное пособие: Как стать совместимым с REUSE
uk: Підручник: Як стати сумісним з REUSE

source: This tutorial explains the basics of making a software project REUSE-compliant. The goal is to **easily, comprehensively, and unambiguously** declare your copyright and licensing in a way that is **machine-readable**. By the end of this tutorial, you will understand the three fundamental steps of REUSE:
cs: Tento výukový program vysvětluje základy toho, aby byl softwarový projekt kompatibilní s REUSE. Cílem je **snadno, komplexně a jednoznačně** deklarovat vaše autorská práva a licence způsobem, který je **strojově čitelný**. Na konci tohoto tutoriálu pochopíte tři základní kroky REUSE:
uk: Цей посібник пояснює основи того, як зробити програмний проєкт REUSE-сумісним. Мета полягає в тому, щоб **просто, повно і недвозначно** заявити про свої авторські права і ліцензування у спосіб, який **машиночитабельний**. Наприкінці цього уроку ви зрозумієте три фундаментальні етапи використання:

source: Choose and provide licenses
cs: Výběr a poskytnutí licencí
ru: Выбор и предоставление лицензий
uk: Виберіть і вкажіть ліцензії

source: Add copyright and license information to each file
cs: Přidání informací o autorských právech a licenci ke každému souboru
ru: Добавьте информацию об авторских правах и лицензии к каждому файлу
uk: Додайте інформацію про авторські права та ліцензію до кожного файлу

source: Confirm REUSE compliance
cs: Potvrzení souladu s předpisy REUSE
ru: Подтвердите соответствие требованиям REUSE
uk: Підтвердьте відповідність REUSE

source: For the purpose of this tutorial, we will assume that the directory of your project looks like this:
cs: Pro účely tohoto návodu budeme předpokládat, že adresář vašeho projektu vypadá takto:
ru: Для целей этого руководства мы предположим, что каталог вашего проекта выглядит следующим образом:
uk: Для цього навчання ми припустимо, що каталог вашого проєкту має такий вигляд:

source: If you would like to reproduce the steps in this tutorial on your own computer, you can clone the [example repository](https://codeberg.org/fsfe/reuse-tutorial-example). The branch `non-compliant` matches the structure above, while the `compliant` branch is the successful result of this tutorial.
cs: Pokud byste chtěli kroky v tomto tutoriálu reprodukovat na svém počítači, můžete naklonovat [vzorové úložiště](https://codeberg.org/fsfe/reuse-tutorial-example). Větev `nevyhovující` odpovídá struktuře výše, zatímco větev `vyhovující` je úspěšným výsledkem tohoto tutoriálu.
uk: Якщо ви хочете відтворити кроки цього посібника на своєму комп'ютері, ви можете клонувати [репозиторій прикладів] (https://codeberg.org/fsfe/reuse-tutorial-example). Гілка `non-compliant` відповідає наведеній вище структурі, тоді як гілка `compliant` є успішним результатом цього посібника.

source: For each of these steps, you will first learn how to achieve them manually. However, the [REUSE tool](https://github.com/fsfe/reuse-tool) supports you with most tasks, and the necessary commands will be listed as well in the collapsible boxes. We recommend to first understand the basic principle before just executing the tool's commands.
uk: Для кожного з цих кроків ви спочатку дізнаєтеся, як виконати їх вручну. Втім, [інструмент REUSE] (https://github.com/fsfe/reuse-tool) допоможе вам у виконанні більшості завдань, а необхідні команди також будуть перераховані у розгортуваних блоках. Ми рекомендуємо спочатку зрозуміти основний принцип, перш ніж просто виконувати команди інструменту.
