Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: A further issue with version control is that the `blame` command that is typically (mis)used to find authorship line-by-line shows only the author of the last commit in that line, even if it was just something as trivial as fixing a typo.
ru: Еще одна проблема с контролем версий заключается в том, что команда `blame`, которая обычно (неправильно) используется для поиска авторства построчно, показывает только автора последнего коммита в этой строке, даже если это было просто что-то тривиальное, вроде исправления опечатки.

source: Can I bulk-license whole directories? {#bulk-license}
ru: Можно ли массово лицензировать целые каталоги? {#bulk-license}

source: If you have a directory containing many files, it may not be easy or practical to edit every file to contain a header. While doing this would be ideal, there is an alternative. By creating the file `.reuse/dep5` in the root of your project, you can bulk-license a directory. Example:
ru: Если у вас есть каталог, содержащий много файлов, может быть нелегко или нецелесообразно редактировать каждый файл, чтобы он содержал заголовок. Хотя это было бы идеальным вариантом, существует альтернатива. Создав файл `.reuse/dep5` в корне вашего проекта, вы можете массово лицензировать каталог. Пример:

source: Format: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Upstream-Name: my-project Upstream-Contact: Jane Doe <jane@example.com> Source: https://git.example.com/jane/my-project Files: resources/img/* Copyright: 2017 Jane Doe <jane@example.com> License: CC-BY-4.0 Files: resources/vid/* Copyright: 2017 Jane Doe <jane@example.com> 2017 John Doe <john@example.com> License: CC0-1.0
ru: Формат: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Название проекта: мой проект Контактный центр : Джейн Доу <jane@example.com>. Источник: https://git.example.com/jane/my-project Файлы: resources/img/* Авторское право: 2017 Джейн Доу <jane@example.com> Лицензия: CC-BY-4.0 Файлы: resources/vid/* Авторские права: 2017 Джейн Доу <jane@example.com> 2017 Джон Доу <john@example.com> Лицензия: CC0-1.0

source: You can read more about this file format by Debian [here](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).
ru: Подробнее об этом формате файлов вы можете прочитать в Debian [здесь](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).

source: Can I license only a part of a file as being under a different license? {#partial-license}
ru: Могу ли я лицензировать только часть файла под другой лицензией? {#частичная лицензия}

source: The short answer is that yes, you can, but no, there is no standard way for REUSE to recognize this. If you have a small segment of a file that is licensed differently, you should list that license under a separate `SPDX-License-Identifier` tag in the header.
ru: Короткий ответ: да, можете, но нет, стандартного способа распознать это в REUSE не существует. Если у вас есть небольшой участок файла, который лицензируется по-другому, вам следует указать эту лицензию в отдельном теге `SPDX- Лицензия-Идентификатор` в заголовке.

source: You can use your own comments to specify which segment is separately licensed. For instance: "The class Foo is copied from project Bar and licensed under MIT. All changes are licensed under GPL-3.0-or-later."
ru: Вы можете использовать собственные комментарии, чтобы указать, какой сегмент лицензируется отдельно. Например: "Класс Foo скопирован из проекта Bar и лицензируется по MIT. Все изменения лицензируются по GPL-3.0-или-позднее"

source: A possible way to circumvent the problem is to extract the segment from the file, and to keep it in its own file.
ru: Возможный способ обойти эту проблему - извлечь сегмент из файла и сохранить его в собственном файле.

source: How do I properly declare multi-licensing? {#multi-licensing}
ru: Как правильно объявить о мультилицензировании? {#мультилицензирование}

source: If all the code within the file is licensed under either one license or another (for instance, all code is under GPL-2.0-only, but one function is under MIT), use separate tags `SPDX-License-Identifier: GPL-2.0-only` and `SPDX-License-Identifier: MIT`.
ru: Если весь код в файле лицензирован под одной или другой лицензией (например, весь код под GPL-2.0-единственная, но одна функция - под MIT), используйте отдельные теги `SPDX- Лицензия-Идентификатор: GPL-2.0-единственная` и `SPDX- Лицензия-Идентификатор: MIT`.

source: You can read more about SPDX expressions [on the SPDX wiki](https://wiki.spdx.org/view/LicenseExpressionFAQ).
ru: Подробнее о выражениях SPDX можно прочитать [на вики SPDX](https://wiki.spdx.org/view/LicenseExpressionFAQ).

source: <!-- ## How to deal with MIT/BSD licenses which include copyright information themselves? {#mit-bsd}
ru: <!-- ## Как быть с лицензиями MIT/BSD, которые сами содержат информацию об авторских правах? {#mit-bsd}

source: TODO: Figure this one out -->
ru: ПРОБЛЕМА: Разберитесь с этим...

source: How do I use a license that is not on the SPDX License List? {#custom-license}
ru: Как использовать лицензию, которой нет в списке лицензий SPDX? {#сделанная лицензия}

source: If you have a custom or modified license that does not appear in the SPDX License List, place your license in the file `LICENSES/LicenseRef-MyLicense.txt`. By naming your license as such, tools that speak SPDX will still be able to recognise your license.
ru: Если у вас есть собственная или модифицированная лицензия, которая не отображается в списке лицензий SPDX, поместите ее в файл `ЛИЦЕНЗИЯ/Реф-МояЛицензия.txt`. Назвав лицензию таким образом, инструменты, использующие SPDX, смогут распознать ее.

source: How do I use a custom exception? {#custom-exception}
ru: Как использовать пользовательское исключение? {#custom-exception}

source: There are many reasons for why you should not alter license texts, but if you do alter the texts, you should use a different SPDX identifier for this license. See [the previous question](#custom-license).
ru: Существует множество причин, по которым не следует изменять тексты лицензий, но если вы все же измените тексты, вам следует использовать другой идентификатор SPDX для этой лицензии. См. [предыдущий вопрос](#custom-license).

source: For lawyers and legal experts {#lawyers}
ru: Для юристов и специалистов в области права {#юрист}

source: I am a lawyer and want a bill of materials {#bill-of-materials}
ru: Я адвокат, и мне нужна ведомость материалов {#bill-of-materials}

source: Install the reuse tool and run `reuse spdx -o reuse.spdx` in the project root to create an [SPDX document](https://spdx.org/spdx-specification-21-web-version).
ru: Установите инструмент повторного использования и запустите `reuse spdx -o reuse.spdx` в корне проекта, чтобы создать [SPDX-документ](https://spdx.org/spdx-specification-21-web-version).

source: For the revision history of this specification, please see [the change log](https://git.fsfe.org/reuse/docs/src/branch/master/CHANGELOG.md).
ru: История изменений этой спецификации приведена в [журнале изменений](https://git.fsfe.org/reuse/docs/src/branch/master/CHANGELOG.md).

source: - License File --- a file containing the text of a license.
ru: - Файл лицензии --- файл, содержащий текст лицензии.

source: - SPDX License Expression --- as defined in SPDX Specification, Appendix IV, at <https://spdx.org/spdx-specification-21-web-version#h.jxpfx0ykyb60>.
ru: - Лицензионное выражение SPDX --- как определено в Спецификации SPDX, Приложение IV, по адресу <https://spdx.org/spdx-specification-21-web-version#h.jxpfx0ykyb60>.

source: If a license does not exist in the SPDX License List, its SPDX License Identifier MUST be `LicenseRef-[idstring]` as defined by the SPDX Specification, Section 6 available at <https://spdx.org/spdx-specification-21-web-version#h.1v1yuxt>.
ru: Если лицензия не существует в списке лицензий SPDX, ее идентификатор лицензии SPDX ДОЛЖЕН быть `ЛицензионныйРеф-[ идентификационная строка]`, как определено в Спецификации SPDX, Раздел 6, доступной по адресу <https://spdx.org/spdx-specification-21-web-version#h.1v1yuxt>.

source: - The License Files.
ru: - Лицензионные файлы.

source: The comment header MUST contain one or more `SPDX-FileCopyrightText` tags, and one or more `SPDX-License-Identifier` tags. A tag is followed by a colon, followed by a text value, and terminated by a newline.
ru: Заголовок комментария ДОЛЖЕН содержать один или несколько тегов `SPDX-FileCopyrightText` и один или несколько тегов `SPDX- Лицензия-Идентификатор`. За тегом следует двоеточие, затем текстовое значение и завершается новой строкой.

source: The `SPDX-FileCopyrightText` tag MUST be followed by a copyright notice.
ru: За тегом `SPDX-FileCopyrightText` ДОЛЖНО следовать уведомление об авторских правах.

source: The `Copyright` tag MUST be followed by a copyright notice.
ru: За тегом `Копирайт` ДОЛЖНО следовать уведомление об авторских правах.

source: This tutorial explains the basic methods of how to make a software project REUSE-compliant. By the end of this document, all your files will clearly have their copyright and licensing marked, and you will be able to verify this using the REUSE helper tool.
ru: В этом руководстве описаны основные методы, как сделать программный проект совместимым с REUSE. К концу этого документа на всех ваших файлах будут четко обозначены авторские права и лицензирование, и вы сможете проверить это с помощью вспомогательного инструмента REUSE.

source: Making your project REUSE-compliant can be done in three simple steps:
ru: Сделать ваш проект соответствующим требованиям REUSE можно в три простых шага:

source: project/ ├── img/ │ ├── cat.jpg │ └── dog.jpg ├── src/ │ └── main.c ├── .gitignore ├── Makefile └── README.md
ru: проект/ ├──── img/ │ ├──── cat.jpg │ └──── собака.jpg ├──── src/ │ └──── main.c ├──── .gitignore ├──── Makefile └── README.md

source: If you would like to reproduce the steps in this tutorial on your own computer, you can clone the [example repository](https://github.com/fsfe/reuse-example). The branch `noncompliant` matches the structure above, while the `master` branch is the successful result of this repository.
ru: Если вы хотите воспроизвести действия, описанные в этом руководстве, на своем компьютере, вы можете клонировать [пример репозитория](https://github.com/fsfe/reuse-example). Ветка `несоответствующая` соответствует приведенной выше структуре, а ветка `мастер` является успешным результатом работы этого репозитория.

source: For each of these steps, you will first learn how to achieve them manually. However, the [REUSE helper tool](https://github.com/fsfe/reuse-tool) supports you with most tasks, and the necessary commands will be listed as well in the collapsible boxes. We recommend to first understand the basic principle before just executing the tool's commands.
ru: Для каждого из этих шагов вы сначала узнаете, как выполнить их вручную. Однако инструмент [REUSE helper tool](https://github.com/fsfe/reuse-tool) поможет вам справиться с большинством задач, и необходимые команды также будут перечислены в сворачивающихся блоках. Мы рекомендуем сначала понять основной принцип, прежде чем просто выполнять команды инструмента.

source: You find your license in the [SPDX License List](https://spdx.org/licenses/). SPDX is an open standard for communicating license and copyright information. Each license is uniquely identified by a shortform [SPDX License Identifier](https://spdx.org/licenses). The SPDX License Identifier for your chosen license is GPL-3.0-or-later.
ru: Вы найдете свою лицензию в [Списке лицензий SPDX](https://spdx.org/licenses/). SPDX - это открытый стандарт для передачи информации о лицензиях и авторских правах. Каждая лицензия однозначно идентифицируется короткой формой [SPDX License Identifier](https://spdx.org/licenses). Идентификатор лицензии SPDX для выбранной вами лицензии - GPL-3.0-or-later.

source: You create a `LICENSES` directory in your project root which will contain all the licenses that you use in your project. You then download your license from the [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) repository and put it in the `LICENSES` directory. The name of the license should be its SPDX License Identifier followed by a file extension (in this example, GPL-3.0-or-later.txt).
ru: Вы создаете в корне проекта каталог `LICENSES`, который будет содержать все лицензии, используемые в вашем проекте. Затем вы загружаете свою лицензию из репозитория [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) и помещаете ее в каталог `LICENSES`. Имя лицензии должно быть идентификатором лицензии SPDX, за которым следует расширение файла (в данном примере GPL-3.0-or-later.txt).

source: {{< box-tool >}}
ru: {{< коробка-инструмент >}}

source: You can initialise your project using `reuse init`. In an interactive dialogue you can define certain properties of your project and also one or multiple licenses. At the end, these licenses will be automatically downloaded to the correct location.
ru: Вы можете инициализировать свой проект с помощью команды `reuse init`. В интерактивном диалоге вы можете определить некоторые свойства вашего проекта, а также одну или несколько лицензий. В конце эти лицензии будут автоматически загружены в нужное место.

source: The `reuse download` command enables you to download a specific license. `reuse download GPL-3.0-or-later` would fulfil the task described in the manual instructions above. Running `reuse download --all` automatically downloads all licenses which the REUSE helper tool detects as being used in your project.
ru: Команда `reuse download` позволяет загрузить определенную лицензию. Команда `reuse download GPL-3.0-or-later` выполнит задачу, описанную в инструкции выше. Выполнение команды `reuse download --all` автоматически загружает все лицензии, которые инструмент-помощник REUSE обнаруживает как используемые в вашем проекте.

source: {{< /box-tool >}}
ru: {{< /коробка-инструмент >}}

source: Now that you have a license, you need to indicate in the relevant files that these files fall under that license. You edit the comment header of `src/main.c` as such:
ru: Теперь, когда у вас есть лицензия, вам нужно указать в соответствующих файлах, что эти файлы попадают под эту лицензию. Вы редактируете заголовок комментария в файле `src/main.c` следующим образом:

source: /* * SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> * * SPDX-License-Identifier: GPL-3.0-or-later */
ru: /* * SPDX-FileCopyrightText: 2019 Джейн Доу <jane@example.com> * * SPDX- Лицензия-Идентификатор: GPL-3.0-or-later */

source: The `SPDX-FileCopyrightText` tag records the publication years and copyright holder of the contents of the file. You can read more about [which publication years to use]({{< relref "faq.md#years-copyright" >}}) and [what copyright holders are]({{< relref "faq.md#copyright-holder-author" >}}) in the FAQ.
ru: Тег `SPDX-FileCopyrightText` записывает годы публикации и владельца авторских прав на содержимое файла. содержимого файла. Вы можете прочитать больше о том, [какие годы публикации следует использовать]({{< relref "faq.md#years- авторское право">}}) и [что такое правообладатели ]({{< relref "faq.md#копирайт-держатель-автор" >}}) в разделе FAQ.

source: Each file must always contain these two tags in the header. You are allowed to use the tags multiple times if you have multiple copyright holders or licenses.
ru: Каждый файл должен всегда содержать эти два тега в заголовке. Вы можете использовать эти теги несколько раз, если у вас несколько владельцев авторских прав или лицензий.

source: The `reuse addheader` command helps with adding licensing and copyright information to your files. For the task above, the following command would do the job:
ru: Команда `reuse addheader` помогает добавить в файлы информацию о лицензировании и авторских правах. Для приведенной выше задачи подойдет следующая команда:

source: reuse addheader --copyright="Jane Doe <jane@example.com>" --license="GPL-3.0-or-later" src/main.c Makefile README.md
ru: reuse addheader --copyright=" Джейн Доу <jane@example.com>" --license="GPL-3.0-or-later" src/main.c Makefile README.md

source: Please see the [tool's documentation about addheader](https://reuse.readthedocs.io/en/stable/usage.html#addheader) for more options like comment styles and templates
ru: Дополнительные возможности, такие как стили и шаблоны комментариев, см. в [документации по инструменту addheader](https://reuse.readthedocs.io/en/stable/usage.html#addheader)

source: Binary and uncommentable files
ru: Двоичные и некомментируемые файлы

source: You also want to license your image files under GPL-3.0-or-later. Unfortunately, images and other binary files do not have comment headers that one can easily edit. Other examples include automatically generated files and certain data and configuration files for which comments are non-trivial.
ru: Вы также хотите лицензировать свои файлы изображений по GPL-3.0 или более поздней версии. К сожалению, у изображений и других бинарных файлов нет заголовков комментариев, которые можно было бы легко редактировать. Другие примеры - автоматически генерируемые файлы и некоторые файлы данных и конфигурации, для которых комментарии нетривиальны.

source: There is a simple trick to circumvent this. Create the files `cat.jpg.license` and `dog.jpg.license`, each containing the same information about license and copyright holder as above.
ru: Есть простой трюк, чтобы обойти это. Создайте файлы `cat.jpg.license` и `dog.jpg.license`, каждый из которых содержит ту же информацию о лицензии и правообладателе, что и выше.

source: The REUSE helper tool should automatically detect binary files and therefore automatically create a corresponding `.license` file.
ru: Инструмент-помощник REUSE должен автоматически определять бинарные файлы и, следовательно, автоматически создавать соответствующий файл `. лицензия`.

source: If it does not, or if you would like to enforce this, add the `--explicit-license` argument to the addheader command. So the command for the above task may look like this:
ru: Если это не так, или если вы хотите обеспечить это, добавьте аргумент `--explicit-license` к команде addheader. Таким образом, команда для приведенной выше задачи может выглядеть следующим образом:

source: reuse addheader --copyright="Jane Doe <jane@example.com>" --license="GPL-3.0-or-later" --explicit-license img/cat.jpg img/dog.jpg
ru: reuse addheader --copyright=" Джейн Доу <jane@example.com>" --license="GPL-3.0-or-later" --explicit-license img/cat.jpg img/dog.jpg

source: Change licensing information
ru: Изменение информации о лицензировании

source: You discover that the photos of the cat and the dog were not licensed under the GPL at all, but under Creative Commons Attribution 4.0 International, owned by Max Mehl.
ru: Вы обнаруживаете, что фотографии кошки и собаки были сделаны не по лицензии GPL, а по лицензии Creative Commons Attribution 4.0 International, принадлежащей Максу Мелу.

source: The SPDX License Identifier of this license is CC-BY-4.0. You create the file `LICENSES/CC-BY-4.0.txt`, following the same steps you used for GPL-3.0-or-later.
ru: Лицензионный идентификатор SPDX этой лицензии - CC-BY-4.0. Вы создаете файл `ЛИЦЕНЗИЯ/CC-BY-4.0.txt`, следуя тем же шагам, что и для GPL-3.0-or-later.

source: You then edit `cat.jpg.license` and `dog.jpg.license` to say:
ru: Затем вы отредактируете файлы `cat.jpg.license` и `dog.jpg.license` так, чтобы они выглядели следующим образом:

source: SPDX-FileCopyrightText: 2019 Max Mehl <max.mehl@fsfe.org> SPDX-License-Identifier: CC-BY-4.0
ru: SPDX-FileCopyrightText: 2019 Макс Мель <max.mehl@fsfe.org>. SPDX- Лицензионный идентификатор: CC-BY-4.0

source: The tool as of now does not provide a way to replace existing REUSE-compliant copyright and licensing information. A run of the `addheader` command would not replace but extend the `.license` files with two additional lines stating the copyright of Max Mehl and the CC-BY-4.0 license. So you would have to update these manually.
ru: На данный момент инструмент не предоставляет возможности заменить существующую информацию об авторских правах и лицензировании, соответствующую REUSE. Выполнение команды `addheader` не заменит, а расширит файлы `.license` двумя дополнительными строками, указывающими авторские права Макса Меля и лицензию CC-BY-4.0. Поэтому вам придется обновить их вручную.

source: However, the `download` command afterwards would allow you to download the new license automatically, so either with `reuse download CC-BY-4.0` or simply `reuse download --all`.
ru: Однако команда `download` после этого позволит вам автоматически загрузить новую лицензию, так что используйте либо `reuse download CC-BY-4.0`, либо просто `reuse download --all`.

source: Build artifacts
ru: Создание артефактов

source: When you compile your program, you generate some build artifacts, such as `src/main.o`. You do not need to provide any licensing information for those files. Just use your `.gitignore` file to ignore these build artifacts. The REUSE tool will respect the contents of `.gitignore`.
ru: Когда вы компилируете свою программу, вы генерируете некоторые артефакты сборки, такие как `src/main.o`. Вам не нужно предоставлять лицензионную информацию для этих файлов. Просто используйте свой файл `.gitignore`, чтобы игнорировать эти артефакты сборки. Инструмент REUSE будет уважать содержимое файла `.gitignore`.

source: Insignificant files
ru: Незначительные файлы

source: You probably will have files in your project that you do not find particularly copyrightable, for example configuration files such as `.gitignore`. Intuitively you may not want to license these files, but the fundamental idea of REUSE is that all your files will clearly have their copyright and licensing marked.
ru: Вероятно, в вашем проекте есть файлы, которые вы не считаете особо охраняемыми авторским правом, например, файлы конфигурации, такие как `.gitignore`. Интуитивно вы можете не захотеть лицензировать эти файлы, но основная идея REUSE заключается в том, что все ваши файлы будут явно помечены авторским правом и лицензированием.

source: If you do not exercise any copyright over this file, you can use the [CC0 license](https://creativecommons.org/publicdomain/zero/1.0/). This is functionally identical to putting the file in the public domain. Edit the file to contain:
ru: Если вы не обладаете авторскими правами на этот файл, вы можете использовать лицензию [CC0](https://creativecommons.org/publicdomain/zero/1.0/). Это функционально идентично передаче файла в общественное достояние. Отредактируйте файл, чтобы он содержал:

source: # SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> # # SPDX-License-Identifier: CC0-1.0
ru: # SPDX-FileCopyrightText: 2019 Джейн Доу <jane@example.com> # # SPDX- Лицензия-Идентификатор: CC0-1.0

source: Consequently, you will have to provide the CC0-1.0 license in the `LICENSES/` directory as well, just like the GPL-3.0-or-later and CC-BY-4.0 before.
ru: Следовательно, вам придется указать лицензию CC0-1.0 в каталоге `Лицензия/`, как и лицензии GPL-3.0 или более поздние и CC-BY-4.0.

source: More information about copyrightable files can be found in the [REUSE FAQ]({{< relref "faq.md#what-is-copyrightable" >}}).
ru: Дополнительную информацию о файлах, защищенных авторским правом, можно найти в [REUSE часто задаваемые вопросы]({{< relref "faq.md#что-есть- авторское-право">}}).

source: As before, a combination of the `addheader` and `download` commands will fulfil the above step:
ru: Как и раньше, комбинация команд `addheader` и `download` выполнит описанный выше шаг:
