Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: If a Covered File is covered by multiple `[[annotations]]` tables in the same `REUSE.toml` file, then exclusively the last matching table in the file is used for that Covered File.
cs: Pokud je krytý soubor pokryt více tabulkami `[[annotations]]` ve stejném souboru `REUSE.toml`, pak se pro tento krytý soubor použije výhradně poslední odpovídající tabulka v souboru.
uk: Якщо покритий файл охоплюється кількома таблицями `[[annotations]]` в одному файлі `REUSE.toml`, то для цього покритого файлу використовується виключно остання відповідна таблиця у файлі.

source: An example of a `REUSE.toml` file:
cs: Příklad souboru `REUSE.toml`:
uk: Приклад файлу `REUSE.tml`:

source: Licensing Information MAY be associated with a file through a DEP5 file, but you SHOULD create a `REUSE.toml` file instead. The DEP5 file is deprecated, meaning that it is expected to disappear from a future iteration of this specification.
cs: Licenční informace MOHOU být přidruženy k souboru prostřednictvím souboru DEP5, ale místo toho MĚLI byste vytvořit soubor `REUSE.toml`. Soubor DEP5 je zastaralý, což znamená, že se očekává, že zmizí z budoucí iterace této specifikace.
uk: Інформація про ліцензування МОЖЕ бути пов'язана з файлом за допомогою файлу DEP5, але ви ПОВИННІ створити замість нього файл `REUSE.toml`. Файл DEP5 є застарілим, тобто очікується, що він зникне з майбутніх ітерацій цієї специфікації.

source: The `Files` tag MUST be followed by one or more paths to which the paragraph's Licensing Information is applied.
cs: Za tagem `Files` MUSÍ následovat jedna nebo více cest, na které se vztahují licenční informace odstavce.
uk: Після тегу `Files` ОБОВ'ЯЗКОВО слідує один або декілька шляхів, до яких застосовується інформація про ліцензування параграфа.

source: The `Copyright` tag MUST be followed by one or more Copyright Notices. The prefixes of the Copyright Notices MAY be omitted.
cs: Za tagem `Copyright` MUSÍ následovat jedno nebo více oznámení o autorských právech. Předpony oznámení o autorských právech MOHOU být vynechány.
uk: За тегом `Copyright` ОБОВ'ЯЗКОВО має слідувати одне або декілька повідомлень про авторське право. Префікси в повідомленнях про авторське право МОЖНА опускати.

source: Format: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Files: po/*.po po/*.pot Copyright: 2019 Translation Company License: GPL-3.0-or-later Files: tests/resources/* Copyright: 2019 Jane Doe License: CC0-1.0
uk: Формат: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Файли: po/*.po po/*.pot Авторське право: 2019 Перекладацька Компанія Ліцензія: GPL-3.0-or-later Файли: tests/resources/* Авторське право: 2019 Джейн Доу Ліцензія: CC0-1.0

source: Order of precedence
cs: Pořadí přednosti
uk: Порядок пріоритетності

source: If a Commentable File contains Licensing Information but also has an adjacent `.license` file, then the Licensing Information defined in the `.license` file takes precedence, and the Commentable File's contents are ignored. For all intents and purposes, this counts as the `.license` file's Licensing Information being inside the Commentable File.
cs: Pokud soubor s možností komentáře obsahuje licenční informace, ale má také sousední soubor `.license`, pak mají přednost licenční informace definované v souboru `.license` a obsah souboru s komentářem je ignorován. Pro všechny záměry a účely se to počítá jako licenční informace souboru `.license` obsažené v souboru s komentářem.
uk: Якщо файл, що коментується, містить інформацію про ліцензування, але також має суміжний файл `.license`, то інформація про ліцензування, визначена у файлі `.license`, має пріоритет, а вміст файлу, що коментується, ігнорується. Для всіх цілей, це вважається, що Ліцензійна інформація файлу `.license` міститься у файлі, що коментується.

source: Licensing Information defined in `.reuse/dep5` is aggregated with the Licensing Information found in the Covered Files. For clarity, this means that if the SPDX License Expressions in a file's comment header and in the section for that file in `.reuse/dep5` do not agree with each other, then both SPDX License Expressions will apply to the file.
cs: Licenční informace definované v `.reuse/dep5` jsou agregovány s licenčními informacemi, které se nacházejí v zahrnutých souborech. Pro jasnost to znamená, že pokud licenční výrazy SPDX v hlavičce komentáře souboru a v sekci pro tento soubor v `.reuse/dep5` vzájemně nesouhlasí, pak se na soubor budou vztahovat oba licenční výrazy SPDX.
uk: Ліцензійна інформація, визначена у файлі `.reuse/dep5`, об'єднується з Ліцензійною інформацією, що міститься у Покритих файлах. Для ясності, це означає, що якщо вирази ліцензії SPDX у заголовку коментаря до файлу і в розділі для цього файлу в `.reuse/dep5` не узгоджуються один з одним, то до файлу застосовуватимуться обидва вирази ліцензії SPDX.

source: The order of precedence for `REUSE.toml` files is described in the respective section, and is managed using the `precedence` key.
cs: Pořadí priority pro soubory `REUSE.toml` je popsáno v příslušné části a je spravováno pomocí klíče `precedence`.
uk: Порядок пріоритету для файлів `REUSE.toml` описано у відповідному розділі, і ним можна керувати за допомогою ключа `precedence`.

source: Format of Copyright Notices
cs: Formát oznámení o autorských právech
uk: Формат повідомлень про авторське право

source: A Copyright Notice MUST start with a tag, word or symbol (collectively: prefixes) from the following list:
cs: Upozornění na autorská práva MUSÍ začínat značkou, slovem nebo symbolem (souhrnně: předpony) z následujícího seznamu:
uk: Повідомлення про авторське право ПОВИННО починатися з тегу, слова або символу (разом: префікси) з наведеного нижче списку:

source: `SPDX-FileCopyrightText` (or `SPDX-SnippetCopyrightText` in Snippets)
cs: `SPDX-FileCopyrightText` (nebo `SPDX-SnippetCopyrightText` ve Snippets)
uk: `SPDX-FileCopyrightText` (або `SPDX-SnippetCopyrightText` у Фрагментах)

source: Copyright
uk: Авторське право

source: It is RECOMMENDED to use the `SPDX-FileCopyrightText` tag. You MAY add '(C)', '(c)' or '©' after the prefix.
cs: DOPORUČUJEME používat značku `SPDX-FileCopyrightText`. Za předponu MŮŽETE přidat '(C)', '(c)' nebo '©'.
uk: РЕКОМЕНДОВАНО використовувати тег `SPDX-FileCopyrightText`. Ви МОЖЕТЕ додавати '(C)', '(c)' або '©' після префікса.

source: In Commentable Files, a Copyright Notice is terminated by a newline.
cs: V souborech s komentářem je oznámení o autorských právech ukončeno novým řádkem.
uk: У файлах, що коментуються, повідомлення про авторське право закінчується новим рядком.

source: The Copyright Notice MUST contain the name of the copyright holder. The copyright notice SHOULD contain the year of publication and the contact address of the copyright holder. The order of these items SHOULD be: year, name, contact address.
cs: Oznámení o autorských právech MUSÍ obsahovat jméno držitele autorských práv. Upozornění o autorských právech BY MĚLO obsahovat rok vydání a kontaktní adresu držitele autorských práv. Pořadí těchto položek BY MĚLO být: rok, jméno, kontaktní adresa.
uk: Повідомлення про авторське право ОБОВ'ЯЗКОВО має містити ім'я власника авторських прав. Повідомлення про авторське право ПОВИННО містити рік публікації та контактну адресу правовласника. Порядок цих пунктів ПОВИНЕН бути таким: рік, ім'я, контактна адреса.

source: The copyright holder SHOULD be an individual, list of individuals, group, legal entity, or any other descriptor by which one can easily identify the copyright holder(s).
cs: Držitel autorských práv BY MĚL být jednotlivec, seznam jednotlivců, skupina, právnická osoba nebo jakýkoli jiný deskriptor, podle kterého lze snadno identifikovat držitele autorských práv.
uk: Власник авторських прав ПОВИНЕН бути фізичною особою, списком осіб, групою осіб, юридичною особою або будь-яким іншим дескриптором, за допомогою якого можна легко ідентифікувати власника(ів) авторських прав.

source: You MAY add any further information to the Copyright Notice.
cs: Do Oznámení o autorských právech MŮŽETE přidat jakékoli další informace.
uk: Ви МОЖЕТЕ додати будь-яку додаткову інформацію до Повідомлення про авторське право.

source: Examples of valid Copyright Notices:
cs: Příklady platných oznámení o autorských právech:
uk: Приклади дійсних повідомлень про авторське право:

source: The [REUSE Specification](/spec) documents more thoroughly how `REUSE.toml` can be used. You can find a JSON schema for `REUSE.toml` at <https://reuse.software/reuse-toml-v1.schema.json>.
cs: [REUSE Specification](/spec) podrobněji dokumentuje, jak lze `REUSE.toml` použít. JSON schéma pro `REUSE.toml` najdete na adrese <https://reuse.software/reuse-toml-v1.schema.json>.

source: $ reuse lint # SUMMARY * Bad licenses: 0 * Deprecated licenses: 0 * Licenses without file extension: 0 * Missing licenses: 0 * Unused licenses: 0 * Used licenses: GPL-3.0-or-later * Read errors: 0 * Files with copyright information: 3 / 3 * Files with license information: 3 / 3 Congratulations! Your project is compliant with version 3.2 of the REUSE Specification :-)
cs: $ reuse lint # SHRNUTÍ *Špatné licence: 0 * Zastaralé licence: 0 * Licence bez přípony souboru: 0 * Chybějící licence: 0 * Nepoužité licence: 0 * Použité licence: GPL-3.0 nebo novější * Chyby čtení: 0 * Soubory s informacemi o autorských právech: 3/3 * Soubory s informacemi o licenci: 3/3 Gratulujeme! Váš projekt je v souladu s verzí 3.2 specifikace REUSE :-)

source: or [sending an email to the FSFE](https://fsfe.org/contact). Please note that we would prefer issues because they are publicly searchable for other people.
cs: nebo [zasláním e-mailu na adresu FSFE](https://fsfe.org/contact). Vezměte prosím na vědomí, že bychom upřednostňovali vydání, protože jsou veřejně vyhledatelná pro další osoby.

source: # SPDX-FileCopyrightText: 2016, 2018-2019 Jane Doe <jane@example.com> # SPDX-FileCopyrightText: 2019 Example Company # # SPDX-License-Identifier: GPL-3.0-or-later
cs: # SPDX-FileCopyrightText: 2016, 2018-2019 Jane Doe <jane@example.com> # SPDX-FileCopyrightText: 2019 Příklad Společnosti # # SPDX-License-Identifier: GPL-3.0-or-later
ru: # SPDX-FileCopyrightText: 2016, 2018-2019 Неизвестный <jane@example.com> # SPDX-FileCopyrightText: 2019 Пример компании # # SPDX- Лицензия-Идентификатор: GPL-3.0-or-later

source: Format: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Upstream-Name: Project Upstream-Contact: Jane Doe <jane@example.com> Source: https://example.com/jane/project Files: po/* Copyright: 2019 Translation Company License: GPL-3.0-or-later
cs: Formát: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Upstream-Name: Projekt Upstream-Contact: Jane Doe <jane@example.com> Zdroj: https://example.com/jane/project Soubory: po/* Autorská práva: 2019 Překladatelská společnost Licence: GPL-3.0-or-later
ru: Формат: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Наименование восходящего потока: Проект Контактный представитель: Джейн Доу <jane@example.com>. Источник: https://example.com/jane/project Файлы: po/* Авторские права: 2019 Трансляционная компания Лицензия: GPL-3.0-or-later

source: We want to improve the way that people license their software projects. We propose three steps to achieve this:
ru: Мы хотим улучшить способ лицензирования проектов программного обеспечения. Мы предлагаем три шага для достижения этой цели:

source: # SPDX-FileCopyrightText: [year] [copyright holder] <[email address]> # # SPDX-License-Identifier: [identifier]
ru: # SPDX-FileCopyrightText: [год] [правообладатель] <[адрес электронной почты]> # # SPDX- Лицензия-Идентификатор: [идентификатор]

source: Copyright is a legal construct that grants someone exclusive rights over a creative work. The most important exclusive right is in the name: The right to produce copies. Only the copyright holder is allowed to give new copies of their work to people.
ru: Авторское право - это юридическая конструкция, предоставляющая кому-либо исключительные права на творческую работу. Самое важное исключительное право заключено в названии: право на создание копий. Только обладатель авторских прав может передавать людям новые копии своего произведения.

source: Usually the author is the copyright holder, but often copyright is transferred to the author's employer. In most places, you do not need to do anything to gain copyright. As soon as you make a creative work, you (or your employer) instantly gain copyright over it.
ru: Обычно авторские права принадлежат автору, но часто авторские права передаются работодателю автора. В большинстве мест вам не нужно ничего делать, чтобы получить авторские права. Как только вы создаете творческую работу, вы (или ваш работодатель) сразу же получаете на нее авторские права.

source: Always choose a Free Software license, i.e., a license that gives the recipient the freedom to use, study, share, and improve the software. Aside from that, the license you choose is up to you. If you are contributing to an existing project, you should release your changes under the same license as the project. Otherwise, the [Free Software Foundation](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/), and [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) have some good recommendations. Note that these resources each emphasise a different value, and come with their own biases.
ru: Всегда выбирайте лицензию на свободное программное обеспечение, то есть лицензию, которая дает получателю свободу использовать, изучать, делиться и улучшать программу. В остальном выбор лицензии остается за вами. Если вы вносите вклад в существующий проект, вам следует выпускать свои изменения под той же лицензией, что и проект. В противном случае, [Free Software Foundation](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/) и [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) имеют несколько хороших рекомендаций. Обратите внимание, что каждый из этих ресурсов делает акцент на разных ценностях и имеет свои собственные предубеждения.

source: <!-- ## Do I really need to include the license and copyright headers in all files? Why should I care? {#why-care}
ru: <!-- ## Действительно ли мне нужно включать заголовки лицензии и копирайта во все файлы? Почему меня это должно волновать? {# Почему это важно}

source: TODO -->
ru: ПРОБЛЕМА -->

source: SPDX stands for [Software Package Data Exchange](https://spdx.org/). It is a project by the [Linux Foundation](https://www.linuxfoundation.org/) and the rock upon which REUSE is built. SPDX defines a standardized way to share copyright and licensing information between projects and people. Most importantly for REUSE, SPDX maintains the [SPDX License List](https://spdx.org/licenses/), which defines standardized identifiers for a lot of licenses.
ru: SPDX расшифровывается как [Software Package Data Exchange](https://spdx.org/). Это проект [Linux Foundation](https://www.linuxfoundation.org/) и основа, на которой строится REUSE. SPDX определяет стандартизированный способ обмена информацией об авторских правах и лицензировании между проектами и людьми. Наиболее важным для REUSE является то, что SPDX поддерживает [SPDX License List](https://spdx.org/licenses/), который определяет стандартизированные идентификаторы для многих лицензий.

source: The tool {#tool}
ru: Инструмент {#инструмент}

source: How do I install and use the REUSE tool? {#install-tool}
ru: Как установить и использовать инструмент REUSE? {#инсталлятор-инструмент}

source: The REUSE tool is a handy companion that can verify your compliance with REUSE and automate a lot of adjacent tasks. You can find the full documentation for the tool at <https://reuse.readthedocs.io/>. But the short of it is:
ru: Инструмент REUSE - это удобный помощник, который позволяет проверить соответствие требованиям REUSE и автоматизировать многие смежные задачи. Полную документацию по инструменту можно найти по адресу <https://reuse.readthedocs.io/>. Но вкратце она такова:

source: How do I exclude a file from REUSE compliance testing? {#exclude-file}
ru: Как исключить файл из проверки соответствия REUSE? {#exclude-file}

source: If the file is a build artifact and you use Git, simply make sure that the file is covered by your `.gitignore` file.
ru: Если файл является артефактом сборки и вы используете Git, просто убедитесь, что файл находится в вашем файле `.gitignore`.

source: If you really want to exclude a file, consider using the [CC0](https://creativecommons.org/publicdomain/zero/1.0/) license for this file. By doing this, you put the file in the public domain, or your country's equivalent.
ru: Если вы действительно хотите исключить файл, рассмотрите возможность использования лицензии [CC0](https://creativecommons.org/publicdomain/zero/1.0/) для этого файла. Этим вы переведете файл в общественное достояние или эквивалент в вашей стране.

source: There is one exception: License files are automatically excluded from compliance testing.
ru: Существует одно исключение: Файлы лицензий автоматически исключаются из тестирования на соответствие.

source: If you have an entire directory that you want to "exclude" from REUSE compliance testing, you can [use a DEP5 file](#bulk-license).
ru: Если у вас есть целая директория, которую вы хотите "исключить" из проверки соответствия REUSE, вы можете [использовать файл DEP5](#bulk-license).

source: Do you support a version control system other than Git? {#no-git}
ru: Поддерживаете ли вы систему контроля версий, отличную от Git? {#no-git}

source: Currently we do not, but please [get in touch](https://github.com/fsfe/reuse-tool/issues).
ru: В настоящее время мы этого не делаем, но, пожалуйста, [свяжитесь с нами](https://github.com/fsfe/reuse-tool/issues).

source: Licensing and compliance {#licensing}
ru: Лицензирование и соответствие {#лицензирование}

source: Generally, we recommend that you use `SPDX-FileCopyrightText: [year] [copyright holder] <[contact address]>`. You may choose to drop items except the copyright holder, which must always be included. We recommend that you include all items, however.
ru: Как правило, мы рекомендуем использовать `SPDX-FileCopyrightText: [год] [правообладатель] <[контактный адрес]>`. Вы можете отказаться от элементов, кроме владельца авторских прав, который всегда должен быть указан. Однако мы рекомендуем включать все элементы.

source: SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> SPDX-FileCopyrightText: © 2019 John Doe <joe@example.com> © Example Corporation <https://corp.example.com> Copyright 2016, 2018-2019 Joe Anybody Copyright (c) Alice
ru: SPDX-FileCopyrightText: 2019 Неизвестный <jane@example.com> SPDX-FileCopyrightText: © 2019 Джон Доу <joe@example.com> © "Пример Корпорация" <https://corp.example.com> Copyright 2016, 2018-2019 Джо Любой Авторское право (c) Алиса

source: Which option you choose is ultimately up to you.
ru: Какой вариант вы выберете, в конечном итоге зависит от вас.

source: There are some edge cases, however. For instance, the program `print("Hello, REUSE!")` probably does not meet the threshold of originality. Similarly, data files and configuration files may not meet that threshold either.
ru: Однако есть и крайние случаи. Например, программа `print(""Привет, РЕЗЮМЕ!"")`, вероятно, не соответствует порогу оригинальности. Аналогично, файлы данных и конфигурационные файлы также могут не соответствовать этому порогу.

source: What to do with uncopyrightable files? {#uncopyrightable}
ru: Что делать с файлами, не защищенными авторским правом? {#uncopyrightable}

source: There are two things that you can do with such a file to make sure that its copyright and licensing is recorded. The first option is to simply use your regular copyright and license header for this file. There is nothing that stops you from claiming copyright over your own works. However, a court would still likely find such files uncopyrightable.
ru: Есть две вещи, которые вы можете сделать с таким файлом, чтобы убедиться, что его авторские права и лицензирование зарегистрированы. Первый вариант - просто использовать для этого файла свой обычный заголовок об авторских правах и лицензии. Ничто не мешает вам заявить авторские права на свои собственные произведения. Однако суд все равно, скорее всего, признает такие файлы не защищенными авторским правом.

source: The alternative is to waive your copyright by using the [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/) license.
ru: Альтернативный вариант - отказаться от авторских прав, используя лицензию [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/).

source: It is important to note that you can only do this for your own works. If the file was authored by someone else, you must declare their copyright and license in the header.
ru: Важно отметить, что так можно поступать только с собственными работами. Если автором файла является кто-то другой, вы должны объявить его авторские права и лицензию в заголовке.

source: How do I copy someone else's work? {#copy-work}
ru: Как скопировать чужую работу? {# копирование работы}

source: If the work was licensed differently from your project, you should verify whether the licenses are compatible, and add the new licenses to your project.
ru: Если работа была лицензирована иначе, чем ваш проект, вам следует проверить, совместимы ли лицензии, и добавить новые лицензии в ваш проект.

source: Can I copy a work that has no copyright notice or license? {#no-copyright-license}
ru: Могу ли я скопировать произведение, на котором нет уведомления об авторских правах или лицензии? {#Нет авторского права и лицензии}

source: If you can find no copyright notice, then that is no problem. You can add the copyright notice yourself.
ru: Если вы не нашли уведомления об авторских правах, это не проблема. Вы можете добавить уведомление об авторских правах самостоятельно.

source: Additionally, many package hosting sites expect that you declare the licensing information of your package. For instance, the [setup.py file of the REUSE tool](https://github.com/fsfe/reuse-tool/blob/master/setup.py) declares all the licenses that it uses in the format expected by the Python packaging infrastructure.
ru: Кроме того, многие сайты хостинга пакетов ожидают, что вы объявите лицензионную информацию вашего пакета. Например, файл [setup.py инструмента REUSE](https://github.com/fsfe/reuse-tool/blob/master/setup.py) декларирует все лицензии, которые он использует, в формате, ожидаемом инфраструктурой упаковки Python.

source: How do I deal with a file that has been edited by many people? {#many-copyright-statements}
ru: Как поступить с файлом, который редактировался многими людьми? {#много авторских прав}

source: Why can't I just use version control to record copyright? {#vcs-copyright}
ru: Почему я не могу просто использовать контроль версий для записи авторских прав? {#vcs- авторское право}

source: In [a previous question](#copyright-holder-author), we distinguished between copyright holders and authors, which are not always the same. Version control typically only records authorship, which makes it unsuitable for the task of recording copyright.
ru: В [предыдущем вопросе](#копирайт-владелец-автор), мы различали владельцев авторских прав и авторов, которые не всегда являются одним и тем же. Контроль версий обычно регистрирует только авторство, что делает его непригодным для задачи регистрации авторских прав.
