Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: You MAY include a `COPYING` or `LICENSE` file (with or without file extensions) in your project for compliance with other standards, conventions, or tools. These files MAY contain a copy of the license text, a summary of your licensing, or anything else. These files are ignored by the REUSE Tool.
cs: Do svého projektu MŮŽETE zahrnout soubor `KOPÍROVÁNÍ` nebo `LICENCE` (s příponami souborů nebo bez nich), aby byly v souladu s jinými standardy, konvencemi nebo nástroji. Tyto soubory MOHOU obsahovat kopii textu licence, shrnutí vaší licence nebo cokoli jiného. Tyto soubory jsou nástrojem REUSE ignorovány.
uk: Ви МОЖЕТЕ включити файли `COPYING` або `LICENSE` (з розширенням або без нього) у свій проєкт для відповідності іншим стандартам, конвенціям або інструментам. Ці файли МОЖУТЬ містити копію тексту ліцензії, коротку інформацію про ваше ліцензування або щось інше. Ці файли ігноруються інструментом REUSE.

source: Licensing Information
cs: Licenční informace
uk: Інформація про ліцензування

source: Each Covered File MUST have Licensing Information associated with it. You can associate Licensing Information with a file in the following ways:
cs: Každý krytý soubor MUSÍ mít přidružené licenční informace. Licenční informace můžete k souboru přidružit následujícími způsoby:
uk: Кожен Покритий файл ПОВИНЕН мати пов'язану з ним інформацію про ліцензування. Ви можете пов'язати інформацію про ліцензування з файлом такими способами:

source: DEP5 (deprecated)
cs: DEP5 (zastaralé)
uk: DEP5 (застарілий)

source: REUSE.toml and DEP5 are mutually exclusive. You MUST NOT use both simultaneously.
cs: REUSE.toml a DEP5 se vzájemně vylučují. NESMÍTE používat oba současně.
uk: REUSE.toml і DEP5 взаємозаперечні. Ви НЕ МОЖЕТЕ використовувати обидва одночасно.

source: Comment headers are the RECOMMENDED method.
cs: Záhlaví komentářů jsou DOPORUČENÁ metoda.
uk: РЕКОМЕНДОВАНО використовувати заголовки коментарів.

source: Additionally, you can associate Licensing Information with Snippets inside of files.
cs: Kromě toho můžete přiřadit licenční informace k úryvkům uvnitř souborů.
uk: Крім того, ви можете пов'язати інформацію про ліцензування з фрагментами всередині файлів.

source: Wherever possible, you SHOULD attempt to use comment headers to convey a file's Licensing Information. Compared to other methods, comment headers are more explicit and their associated Licensing Information is more resistant to being moved or copied.
cs: Kdykoli je to možné, MĚLI byste se pokoušet používat záhlaví komentářů k přenosu licenčních informací souboru. Ve srovnání s jinými metodami jsou záhlaví komentářů explicitnější a související licenční informace jsou odolnější vůči přesunutí nebo kopírování.
uk: Там, де це можливо, ви ПОВИННІ намагатися використовувати заголовки коментарів для передачі інформації про ліцензування файлу. Порівняно з іншими методами, заголовки коментарів чіткіші, а пов'язана з ними інформація про ліцензування стійкіша до переміщення або копіювання.

source: To implement this method, a Commentable File MUST declare the file's Licensing Information in a comment header. The Licensing Information SHOULD be as close to the top of the top of the file as possible in a comment header. The Commentable File SHOULD use UTF-8 encoding.
cs: Chcete-li implementovat tuto metodu, soubor s možností komentáře MUSÍ deklarovat licenční informace souboru v záhlaví komentáře. Licenční informace BY MĚLY být v záhlaví komentáře co nejblíže k horní části souboru. Komentovatelný soubor BY MĚL používat kódování UTF-8.
uk: Щоб реалізувати цей метод, файл, що коментується, ПОВИНЕН оголосити інформацію про ліцензування файлу у заголовку коментаря. Інформація про ліцензування ПОВИННА бути якомога ближче до верхньої частини файлу в заголовку коментаря. Файл, що коментується, ПОВИНЕН використовувати кодування UTF-8.

source: For Uncommentable Files, the comment header that declares the file's Licensing Information MUST be in an adjacent text file of the same name with the additional extension `.license` (example: `cat.jpg.license` if the original file is `cat.jpg`). The adjacent file SHOULD use UTF-8 encoding.
cs: U nekomentovatelných souborů MUSÍ být záhlaví komentáře, které deklaruje licenční informace souboru, v sousedním textovém souboru se stejným názvem s dodatečnou příponou `.license` (příklad: `cat.jpg.license`, pokud je původní soubor `cat. jpg"). Sousední soubor BY MĚL používat kódování UTF-8.
uk: Для файлів, що не коментуються, заголовок коментаря, який оголошує інформацію про ліцензування файлу, ПОВИНЕН бути в сусідньому текстовому файлі з тією ж назвою і додатковим розширенням `.license` (наприклад: `cat.jpg.license`, якщо початковий файл має назву `cat.jpg`). Сусідній файл ПОВИНЕН використовувати кодування UTF-8.

source: `.license` files MAY be used with Commentable Files, but it is still RECOMMENDED that comment headers be put inside Commentable Files.
cs: Soubory `.license` MOHOU být používány s komentovatelnými soubory, ale přesto se DOPORUČUJE, aby záhlaví komentářů bylo umístěno do komentovatelných souborů.
uk: Файли `.license` МОЖНА використовувати з файлами, що коментуються, але все ж таки РЕКОМЕНДОВАНО розміщувати заголовки коментарів всередині файлів, що коментуються.

source: The comment header MUST contain one or more Copyright Notices and one or more `SPDX-License-Identifier` tag-value pairs. A tag is followed by a colon, followed by a text value, and terminated by a newline.
cs: Záhlaví komentáře MUSÍ obsahovat jedno nebo více oznámení o autorských právech a jeden nebo více párů značka-hodnota `SPDX-License-Identifier`. Za značkou následuje dvojtečka, za ní textová hodnota a je ukončena novým řádkem.
uk: Заголовок коментаря ПОВИНЕН містити одне або декілька повідомлень про авторські права та одну або декілька пар тегів-значень `SPDX-License-Identifier`. Після тегу ставиться двокрапка, за якою йде текстове значення, і завершується тег новим рядком.

source: The `SPDX-License-Identifier` tag MUST be followed by a valid SPDX License Expression describing the licensing of the file (example: `SPDX-License-Identifier: GPL-3.0-or-later OR Apache-2.0`).
cs: Za značkou `SPDX-License-Identifier` MUSÍ následovat platný licenční výraz SPDX popisující licencování souboru (příklad: `SPDX-License-Identifier: GPL-3.0-nebo-novější NEBO Apache-2.0`).
uk: За тегом `SPDX-License-Identifier` ПОВИНЕН слідувати дійсний вираз ліцензії SPDX, що описує ліцензування файлу (наприклад: `SPDX-License-Identifier: GPL-3.0-or-later OR Apache-2.0`).

source: # SPDX-FileCopyrightText: 2016, 2018-2019 Jane Doe <jane@example.com> # SPDX-FileCopyrightText: 2019 Example Organisation # # SPDX-License-Identifier: GPL-3.0-or-later
cs: # SPDX-FileCopyrightText: 2016, 2018-2019 Jane Doe <jane@example.com> # SPDX-FileCopyrightText: 2019 Příklad Společnosti # # SPDX-License-Identifier: GPL-3.0-or-later
uk: # SPDX-FileCopyrightText: 2016, 2018-2019 Джейн Доу <jane@example.com> # SPDX-FileCopyrightText: 2019 Приклад Організації # # SPDX-License-Identifier: GPL-3.0-or-later

source: In-line Snippet comments
cs: Vložené komentáře úryvků
uk: Вбудовані коментарі до фрагментів

source: Sometimes Licensing Information only applies to a certain Snippet instead of the whole Commentable File. For these cases SPDX snippet tags MUST be used for that Snippet (as defined in [SPDX Specification, Annex H](https://spdx.github.io/spdx-spec/v2.3/file-tags/#h3-snippet-tags-format)). This means that Copyright Notices inside of Snippets MUST be prefixed with `SPDX-SnippetCopyrightText`.
cs: Někdy se licenční informace vztahuje pouze na určitý úryvek namísto celého komentovatelného souboru. V těchto případech MUSÍ být pro daný úryvek použity značky úryvků SPDX (jak je definováno ve [Specifikaci SPDX, příloha H](https://spdx.github.io/spdx-spec/v2.3/file-tags/#h3-snippet-tags-format)). To znamená, že oznámení o autorských právech uvnitř úryvků MUSÍ mít předponu `SPDX-SnippetCopyrightText`.
uk: Іноді інформація про ліцензування стосується лише певного фрагмента, а не всього коментованого файлу. У цих випадках для цього фрагмента ПОВИННІ використовуватися теги фрагментів SPDX (як визначено у [Специфікація SPDX, Додаток H] (https://spdx.github.io/spdx-spec/v2.3/file-tags/#h3-snippet-tags-format)). Це означає, що повідомлення про авторські права всередині фрагментів МАЮТЬ мати префікс `SPDX-SnippetCopyrightText`.

source: Like with comment headers, the SPDX snippet tags SHOULD be commented.
cs: Stejně jako u hlaviček komentářů, značky úryvků SPDX BY MĚLY být komentovány.
uk: Як і у випадку з коментарями заголовків, теги фрагментів SPDX ПОВИННІ бути прокоментовані.

source: A Snippet SHOULD contain both a Copyright Notice and an SPDX License Expression.
cs: Úryvek BY MĚL obsahovat oznámení o autorských právech i licenční vyjádření SPDX.
uk: Фрагмент ПОВИНЕН містити як повідомлення про авторські права, так і вираз ліцензії SPDX.

source: # SPDX-SnippetBegin # SPDX-SnippetCopyrightText: 2022 Jane Doe <jane@example.com> # SPDX-License-Identifier: MIT print("Hello, world!") # SPDX-SnippetEnd
uk: # SPDX-SnippetBegin # SPDX-SnippetCopyrightText: 2022 Джейн Доу <jane@example.com> # SPDX-License-Identifier: MIT print("Hello, world!") # SPDX-SnippetEnd

source: Ignore block
cs: Ignorovat blok
uk: Ігнорувати блок

source: If Licensing Information is declared in a file without describing the file's or Snippet's actual license or copyright (for example: as part of an output command or documentation), these occurrences SHOULD be put between two comments: `REUSE-IgnoreStart` and `REUSE-IgnoreEnd`. The REUSE Tool then ignores all Licensing Information between these comments. This technique MUST NOT be used to ignore valid Licensing Information.
cs: Pokud jsou licenční informace deklarovány v souboru bez popisu skutečné licence nebo autorských práv k souboru nebo úryvku (například: jako součást výstupního příkazu nebo dokumentace), tyto výskyty BY MĚLY být vloženy mezi dva komentáře: `REUSE-IgnoreStart` a `REUSE-IgnoreEnd`. Nástroj REUSE pak ignoruje všechny licenční informace mezi těmito komentáři. Tato technika NESMÍ být použita k ignorování platných licenčních informací.
uk: Якщо інформацію про ліцензування оголошено у файлі без опису власне ліцензії або авторських прав на файл або фрагмент (наприклад, як частину команди виводу або документації), такі випадки ПОВИННІ бути поміщені між двома коментарями: `REUSE-IgnoreStart` і `REUSE-IgnoreEnd`. Після цього інструмент REUSE ігнорує всю інформацію про ліцензування між цими коментарями. Цей метод НЕ МОЖНА використовувати для ігнорування дійсних відомостей про ліцензування.

source: An example for an ignored block:
cs: Příklad ignorovaného bloku:
uk: Приклад для ігнорованого блоку:

source: # SPDX-FileCopyrightText: 2021 Jane Doe # # SPDX-License-Identifier: GPL-3.0-or-later # REUSE-IgnoreStart echo "SPDX-FileCopyrightText: $(date +'%Y') John Doe" > file.txt echo "SPDX-License-Identifier: MIT" > file.txt # REUSE-IgnoreEnd
uk: # SPDX-FileCopyrightText: 2021 Джейн Доу # # SPDX-License-Identifier: GPL-3.0-or-later # REUSE-IgnoreStart echo "SPDX-FileCopyrightText: $(date +'%Y') John Doe" > file.txt echo "SPDX-License-Identifier: MIT" > file.txt # REUSE-IgnoreEnd

source: Licensing Information MAY be associated with a file through a `REUSE.toml` file, which MUST be a valid TOML file. The intended use case of this method is large directories where including a comment header in each file (or in `.license` companion files) is impossible or undesirable.
cs: Licenční informace MOHOU být přidruženy k souboru prostřednictvím souboru `REUSE.toml`, který MUSÍ být platným souborem TOML. Zamýšleným případem použití této metody jsou velké adresáře, kde je zahrnutí záhlaví komentáře do každého souboru (nebo do doprovodných souborů `.license`) nemožné nebo nežádoucí.
uk: Інформація про ліцензування МОЖЕ бути пов'язана з файлом через файл `REUSE.toml`, який ПОВИНЕН бути дійсним файлом TOML. Передбачуваним випадком використання цього методу є великі каталоги, де включення заголовка коментаря до кожного файлу (або до супутніх файлів `.license`) є неможливим або небажаним.

source: A `REUSE.toml` file MAY be located in any directory, and can cover files that are within its directory or deeper. You MAY have multiple `REUSE.toml` files in different directories.
cs: Soubor `REUSE.toml` MŮŽE být umístěn v libovolném adresáři a může pokrývat soubory, které jsou v jeho adresáři nebo hlouběji. MŮŽETE mít více souborů `REUSE.toml` v různých adresářích.
uk: Файл `REUSE.toml` МОЖЕ бути розташований у будь-якому каталозі і може охоплювати файли, що знаходяться у цьому каталозі або глибше. У вас МОЖЕ бути декілька файлів `REUSE.toml` у різних каталогах.

source: The `version` key (REQUIRED) MUST have an integer value representing the schema version of the file. This specification describes version 1 of `REUSE.toml`.
cs: Klíč `version` (POVINNÝ) MUSÍ mít celočíselnou hodnotu představující verzi schématu souboru. Tato specifikace popisuje verzi 1 souboru `REUSE.toml`.
uk: Ключ `version` (ОБОВ'ЯЗКОВИЙ) ПОВИНЕН мати цілочисельне значення, що представляє версію схеми файлу. Ця специфікація описує версію 1 файлу `REUSE.toml`.

source: Each `[[annotations]]` table represents an association of Licensing Information to zero or more Covered Files. It has the following keys:
cs: Každá tabulka `[[annotations]]` představuje přidružení licenčních informací k žádnému nebo více krytým souborům. Má následující klíče:
uk: Кожна таблиця `[[annotations]]` представляє зв'язок Ліцензійної інформації з нулем або більшою кількістю Охоплених файлів. Він має такі ключі:

source: `path` (REQUIRED), a string or list of strings representing paths. A path MUST use forward slashes as path separators. A path SHOULD resolve to one or more Covered Files relative to the `REUSE.toml` file's directory. A path that resolves to a non-existent or non-Covered File is ignored. A path MUST point to a location in the `REUSE.toml` file's directory or deeper. A path MAY use globbing to match several Covered Files in a single expression. These are the globbing and matching rules:
cs: `cesta` (VYŽADOVÁNO), řetězec nebo seznam řetězců představujících cesty. Cesta MUSÍ používat lomítka jako oddělovače cest. Cesta BY MĚLA odpovídat jednomu nebo více krytým souborům vzhledem k adresáři souboru `REUSE.toml`. Cesta, která se převede na neexistující nebo nezakrytý soubor, je ignorována. Cesta MUSÍ ukazovat na umístění v adresáři souboru `REUSE.toml` nebo hlouběji. Cesta MŮŽE používat globbing ke shodě s několika krytými soubory v jediném výrazu. Toto jsou pravidla pro globování a párování:
uk: `path` (ОБОВ'ЯЗКОВО), рядок або список рядків, що представляють шляхи. Шлях ОБОВ'ЯЗКОВО має використовувати пряму похилу риску роздільником шляху. Шлях ПОВИНЕН розпізнавати один або кілька покритих файлів відносно каталогу файлу `REUSE.toml`. Шлях, який призводить до відсутнього або непокритого файлу, ігнорується. Шлях ПОВИНЕН вказувати на місце в каталозі файлу `REUSE.toml` або глибше. Шлях МОЖЕ використовувати глобування для зіставлення кількох охоплених файлів в одному виразі. Це правила глобування та зіставлення:

source: `*` matches everything except forward slashes (i.e. path separators).
cs: `*` odpovídá všemu kromě lomítek (tj. oddělovačů cest).
uk: `*` відповідає всьому, крім прямих скісних рисок (тобто роздільників шляхів).

source: `**` and `**/` match everything including forward slashes (i.e. path separators).
cs: `**` a `**/` odpovídají všemu včetně lomítek (tj. oddělovačů cest).
uk: `**` та `**/` збігається з усім, включно з прямими слешами (тобто роздільниками шляхів).

source: In order to escape an asterisk and include it verbatim, prefix it with `\\`. You cannot prefix it with `\` because that is invalid TOML. In order to include a backslash verbatim, use `\\\\`. `\\` followed by any other character is functionally equal to just typing that character.
cs: Chcete-li uniknout hvězdičce a zahrnout ji doslovně, předponu `\\`. Nemůžete mu předponu `\`, protože to je neplatný TOML. Chcete-li doslovně zahrnout zpětné lomítko, použijte `\\\\`. `\\` následovaný jakýmkoli jiným znakem je funkčně stejný jako pouhé psaní tohoto znaku.
uk: Щоб уникнути зірочки і включити текст дослівно, додайте до нього префікс `\\`. Ви не можете додавати до нього `\`, тому що це недійсний TOML. Щоб дослівно вказати зворотну косу риску, використовуйте `\\\\`. `\\`, за яким слідує будь-який інший символ, функціонально дорівнює простому введенню цього символу.

source: `precedence` (OPTIONAL), a literal string. It determines the order of precedence for Licensing Information between the `REUSE.toml` file and Covered Files in the table, and between multiple `REUSE.toml` files if they both contain Licensing Information for the same Covered File. Available values are:
cs: `precedence` (VOLITELNÉ), doslovný řetězec. Určuje pořadí priority pro licenční informace mezi souborem `REUSE.toml` a krytými soubory v tabulce a mezi více soubory `REUSE.toml`, pokud oba obsahují licenční informace pro stejný krytý soubor. Dostupné hodnoty jsou:
uk: `precedence` (НЕОБОВ'ЯЗКОВО), буквений рядок. Він визначає порядок пріоритету Ліцензійної інформації між файлом `REUSE.toml` і Покритими файлами в таблиці, а також між декількома файлами `REUSE.toml`, якщо вони обидва містять Ліцензійну інформацію для одного і того ж Покритого файлу. Доступні значення такі:

source: `closest`, the default value when `precedence` is not defined. This is an instruction to associate the Licensing Information inside of the Covered Files (or its adjacent `.license` file), if available. If no such Licensing Information is found, then the Licensing Information inside the table of the closest `REUSE.toml` that covers the File is associated. This algorithm is applied separately for copyright and for licensing. If a table for the same File in a closer `REUSE.toml` file has the `override` precedence, then that precedence is applied, and `closest` is ignored. This is effectively a fallback.
cs: `closest`, výchozí hodnota, když `precedence` není definována. Toto je instrukce pro přidružení licenčních informací uvnitř zahrnutých souborů (nebo jejich přilehlého souboru `.license`), pokud je k dispozici. Pokud nejsou žádné takové licenční informace nalezeny, jsou přidruženy licenční informace v tabulce nejbližšího souboru `REUSE.toml`, který pokrývá soubor. Tento algoritmus se používá samostatně pro autorská práva a pro licencování. Pokud má tabulka pro stejný soubor v bližším souboru `REUSE.toml` prioritu `override`, pak se tato přednost použije a `closest` se ignoruje. To je v podstatě záložní.
uk: `closest`, усталене значення, якщо `precedence` не визначено. Це інструкція для асоціювання Ліцензійної інформації всередині Покритих файлів (або сусіднього файлу `.license`), якщо така є. Якщо такої інформації про ліцензування не знайдено, то асоціюється інформація про ліцензування всередині таблиці найближчого `REUSE.toml`, що охоплює Файл. Цей алгоритм застосовується окремо для авторських прав і для ліцензування. Якщо таблиця для цього ж файлу у ближчому файлі `REUSE.toml` має пріоритет `override`, то застосовується цей пріоритет, а `closest` ігнорується. Це фактично запасний варіант.

source: `aggregate`. This is an instruction to always associate the Licensing Information defined in the table with the table's Covered Files. Subsequently, the `closest` logic is also applied.
cs: `aggregate`. Toto je instrukce, abyste vždy přiřadili licenční informace definované v tabulce k pokrytým souborům tabulky. Následně je také aplikována `nejbližší ` logika.
uk: `aggregate`. Це вказівка завжди пов'язувати Ліцензійну інформацію, визначену в таблиці, із зазначеними в таблиці Покритими файлами. Згодом, також застосовується логіка `closest`.

source: `override`. This is an instruction to associate the Licensing Information defined in the table with the table's Covered Files, and to ignore any other Licensing Information that is closer to the Files. The table in the `REUSE.toml` that is the closest to the root of the Project is authoritative.
cs: `override`. Toto je instrukce pro přidružení licenčních informací definovaných v tabulce se zahrnutými soubory tabulky a ignorování jakýchkoli dalších licenčních informací, které jsou blíže souborům. Směrodatná je tabulka v `REUSE.toml`, která je nejblíže kořenu projektu.
uk: `override`. Це вказівка пов'язувати Ліцензійну інформацію, визначену в таблиці, із зазначеними в ній Файлами та ігнорувати будь-яку іншу Ліцензійну інформацію, яка знаходиться ближче до Файлів. Таблиця в `REUSE.toml`, яка знаходиться найближче до кореня проєкту, є авторитетною.

source: `SPDX-FileCopyrightText` (OPTIONAL), a string or list of strings. Each string MUST be a Copyright Notice to be associated with the table's Covered Files. The prefix of the Copyright Notice MAY be omitted.
cs: `SPDX-FileCopyrightText` (VOLITELNÉ), řetězec nebo seznam řetězců. Každý řetězec MUSÍ být oznámením o autorských právech, aby mohl být spojen s krytými soubory tabulky. Předpona Oznámení o autorských právech MŮŽE být vynechána.
uk: `SPDX-FileCopyrightText` (НЕОБОВ'ЯЗКОВО), рядок або список рядків. Кожен рядок ПОВИНЕН бути повідомленням про авторські права, щоб бути пов'язаним з Покритими файлами таблиці. Префікс Повідомлення про авторські права МОЖЕ бути опущений.

source: `SPDX-License-Identifier` (OPTIONAL), a string or list of strings. Each string MUST be a valid SPDX License Expression describing the licensing of the table's Covered Files.
cs: `SPDX-License-Identifier` (VOLITELNÉ), řetězec nebo seznam řetězců. Každý řetězec MUSÍ být platným licenčním výrazem SPDX popisujícím licencování zahrnutých souborů tabulky.
uk: `SPDX-License-Identifier` (НЕОБОВ'ЯЗКОВО), рядок або список рядків. Кожен рядок ПОВИНЕН бути дійсним виразом ліцензії SPDX, що описує ліцензування вкладених файлів таблиці.

source: You MAY include other keys and tables to convey additional information. Their semantics are not defined by this specification. If you wish to include other keys, you are RECOMMENDED to use existing SPDX tags. For example, you could use `SPDX-FileComment` in an `[[annotations]]` table to add context to what you're doing, or `SPDX-FileContributor` to credit additional contributors.
cs: MŮŽETE zahrnout další klíče a tabulky k předání dalších informací. Jejich sémantika není touto specifikací definována. Pokud si přejete zahrnout další klíče, DOPORUČUJEME použít stávající značky SPDX. Můžete například použít `SPDX-FileComment` v tabulce `[[annotations]]` k přidání kontextu k tomu, co děláte, nebo `SPDX-FileContributor` k připsání dalších přispěvatelů.
uk: Ви МОЖЕТЕ включити інші ключі та таблиці для передачі додаткової інформації. Їх семантика не визначена цією специфікацією. Якщо ви бажаєте додати інші ключі, РЕКОМЕНДОВАНО використовувати наявні теги SPDX. Наприклад, ви можете використовувати `SPDX-FileComment` у таблиці `[[annotations]]`, щоб додати контекст до того, що ви робите, або `SPDX-FileContributor`, щоб зарахувати додаткових дописувачів.

source: Although the keys to associate Licensing Information with the Covered File are OPTIONAL, the complete Licensing Information MUST still be associated with the File in some fashion.
cs: Přestože klíče pro přidružení licenčních informací k zahrnutému souboru jsou VOLITELNÉ, úplné licenční informace MUSÍ být stále nějakým způsobem spojeny se souborem.
uk: Хоча ключі для асоціювання Ліцензійної інформації з Покритим файлом є НЕОБОВ'ЯЗКОВИМИ, повна Ліцензійна інформація ПОВИННА бути асоційована з Файлом певним чином.
