Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: If your project only includes code licensed under a single license, you may provide the text of this license in a file in the top level directory of your repository with the name `LICENSE`, `LICENCE`, `COPYING` or `COPYRIGHT` (you may attach some suffix to the filename as well, such as `LICENSE.txt`).
cs: Pokud váš projekt obsahuje pouze kód licencovaný pod jedinou licencí, můžete poskytnout text této licence v souboru v adresáři nejvyšší úrovně vašeho úložiště s názvem `LICENSE`, `LICENCE`, `COPYING` nebo `COPYRIGHT` ( k názvu souboru můžete také připojit nějakou příponu, například `LICENSE.txt`).
uk: Якщо ваш проєкт містить лише код, ліцензований за однією ліцензією, ви можете надати текст цієї ліцензії у файлі у каталозі верхнього рівня вашого сховища з назвою `LICENSE`, `LICENCE`, `COPYING` або `COPYRIGHT` (ви також можете додати до назви файлу якийсь суфікс, наприклад, `LICENSE.txt`).

source: Some licenses, like the BSD 2 Clause license, exist in many variations where the only difference is the name of the copyright holder in the license text. Your project may end up including multiple versions of the same BSD 2 Clause license because some parts may be written by Alice and others by Bob, resulting in two different license files.
cs: Některé licence, jako je licence BSD 2 Clause, existují v mnoha variantách, kde jediným rozdílem je jméno držitele autorských práv v textu licence. Váš projekt může skončit včetně několika verzí stejné licence BSD 2 Clause, protože některé části mohou být napsány Alice a jiné Bobem, což má za následek dva různé licenční soubory.
uk: Деякі ліцензії, такі як ліцензія BSD 2 Clause, існують у багатьох варіаціях, де єдина розбіжність — ім'я власника авторських прав у тексті ліцензії. Ваш проєкт може містити кілька версій однієї й тієї ж ліцензії BSD 2 Clause, оскільки деякі частини можуть бути написані Алісою, а інші — Бобом, що призведе до появи двох різних файлів ліцензії.

source: When you have added all of your license files, they should all match the glob `{LICENSE*, LICENCE*, COPYING*, COPYRIGHT*, LICENSES/**}`. These are the common places to find licenses. If you place your license elsewhere, it is possible that humans and computers alike may overlook it.
cs: Když přidáte všechny své licenční soubory, měly by všechny odpovídat globu `{LICENSE*, LICENCE*, COPYING*, COPYRIGHT*, LICENSES/**}`. Toto jsou běžná místa k nalezení licencí. Pokud umístíte svou licenci jinam, je možné, že ji lidé i počítače přehlédnou.
uk: Коли ви додасте всі файли ліцензій, вони мають відповідати glob `{LICENSE*, LICENCE*, COPYING*, COPYRIGHT*, LICENSES/**}`. Це найпоширеніші місця, де можна знайти ліцензії. Якщо ви розмістите ліцензію в іншому місці, можливо, що люди та комп'ютери не помітять її.

source: In order to be able to reference the license file from your source code, you should embed the SPDX identifier (e.g., `GPL-3.0`, `MIT`) of each license into the corresponding license file. The easiest way to do this is to simply include the name of the license into the filename: The license file for `GPL-3.0` becomes `LICENSES/GPL-3.0.txt`.
cs: Abyste mohli odkazovat na licenční soubor ze zdrojového kódu, měli byste do odpovídajícího licenčního souboru vložit identifikátor SPDX (např. `GPL-3.0`, `MIT`) každé licence. Nejjednodušší způsob, jak toho dosáhnout, je jednoduše zahrnout název licence do názvu souboru: Licenční soubor pro `GPL-3.0` se změní na `LICENSES/GPL-3.0.txt`.
uk: Щоб мати змогу посилатися на файл ліцензії з вашого початкового тексту, вам слід вставити ідентифікатор SPDX (наприклад, `GPL-3.0`, `MIT`) кожної ліцензії у відповідний файл ліцензії. Найпростіший спосіб зробити це — просто включити назву ліцензії до назви файлу: файл ліцензії для `GPL-3.0` стане `LICENSES/GPL-3.0.txt`.

source: If it is not possible to rename your file (for instance, if you want to have the license text under `COPYING`), then you should add a header to the file in tag-value format. You can add this header either to the license file itself, or in a file with the same filename suffixed with `.license`. The header must include a `Valid-License-Identifier` tag, the value of which should be the SPDX identifier for your license. The header should terminate with the `License-Text` tag to signal the start of your license. The header may include other tags.
cs: Pokud není možné soubor přejmenovat (například pokud chcete mít text licence pod `KOPÍROVÁNÍ`), měli byste do souboru přidat záhlaví ve formátu tag-value. Tuto hlavičku můžete přidat buď do samotného licenčního souboru, nebo do souboru se stejným názvem souboru s příponou `.license`. Záhlaví musí obsahovat značku `Valid-License-Identifier`, jejíž hodnota by měla být identifikátor SPDX pro vaši licenci. Hlavička by měla končit značkou `License-Text`, která signalizuje začátek vaší licence. Záhlaví může obsahovat další značky.
uk: Якщо перейменування файлу неможливе (наприклад, якщо ви хочете, щоб текст ліцензії містився під `COPYING`), вам слід додати до файлу заголовок у форматі тегу-значення. Ви можете додати цей заголовок або до самого файлу ліцензії, або до файлу з такою самою назвою з суфіксом `.license`. Заголовок повинен містити тег `Valid-License-Identifier`, значенням якого має бути SPDX-ідентифікатор вашої ліцензії. Заголовок повинен закінчуватися тегом `License-Text`, щоб сигналізувати про початок вашої ліцензії. Заголовок може містити інші теги.

source: This is an example of an MIT license file, which conveys that all references to the SPDX identifier `MIT` should point to this license file.
cs: Toto je příklad licenčního souboru MIT, který znamená, že všechny odkazy na identifikátor SPDX `MIT` by měly směřovat na tento licenční soubor.
uk: Це приклад файлу ліцензії MIT, який показує, що всі посилання на ідентифікатор SPDX `MIT` повинні вказувати на цей файл ліцензії.

source: Valid-License-Identifier: MIT License-Text: MIT License Copyright (c) <year> <copyright holders> Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), etc...
cs: Identifikátor platné licence: MIT Text licence: Licence MIT Copyright (c) <rok> <držitelé autorských práv> Povolení se tímto uděluje bezplatně každé osobě, která získá a kopii tohoto softwaru a souvisejících souborů dokumentace (dále jen „Software“), atd...
uk: Valid-License-Identifier: MIT License-Text: Ліцензія MIT Авторське право (c) <year> <copyright holders> Цим надається безплатний дозвіл будь-якій особі, яка отримує копію цього програмного забезпечення та пов'язаних з ним файлів документації ("Програмне забезпечення"), тощо...

source: While the identifier should be a license in the SPDX license list, it should be noted that the license text itself may not necessarily be released under that license, nor does the tag claim that.
cs: I když by identifikátorem měla být licence v seznamu licencí SPDX, je třeba poznamenat, že samotný text licence nemusí být nutně uvolněn pod touto licencí, ani to tag netvrdí.
uk: Хоча ідентифікатором має бути ліцензія зі списку ліцензій SPDX, слід зазначити, що сам текст ліцензії не обов'язково може бути випущений під цією ліцензією, і тег цього не стверджує.

source: The license identifier may be repeated if the same license file is used with multiple license identifiers. The example below is for `GPL-2.0` and `GPL-2.0+`, but please note that it is not mandatory to list `GPL-2.0+` separately.
cs: Identifikátor licence se může opakovat, pokud je stejný licenční soubor použit s více licenčními identifikátory. Níže uvedený příklad je pro `GPL-2.0` a `GPL-2.0+`, ale upozorňujeme, že není povinné uvádět `GPL-2.0+` samostatně.
uk: Ідентифікатор ліцензії може повторюватися, якщо один і той самий файл ліцензії використовується з декількома ідентифікаторами ліцензії. Наведений нижче приклад стосується `GPL-2.0` і `GPL-2.0+`, але зауважте, що не обов'язково окремо вказувати `GPL-2.0+`.

source: If the license is not included in the SPDX license list, or the license is a modified version of a license included in that list, you should create a custom identifier for it in the form `LicenseRef-<unique_code>`.
cs: Pokud licence není zahrnuta v seznamu licencí SPDX nebo je licence upravenou verzí licence obsažené v tomto seznamu, měli byste pro ni vytvořit vlastní identifikátor ve tvaru `LicenseRef-<unikátní_kód>`.
uk: Якщо ліцензія не включена до списку ліцензій SPDX, або ліцензія є модифікованою версією ліцензії, що входить до цього списку, вам слід створити власний ідентифікатор для неї у вигляді `LicenseRef-<унікальний_код>`.

source: In the unlikely event your source code includes exceptions, such as the [Classpath exception 2.0](https://spdx.org/licenses/Classpath-exception-2.0.html), you may include them in the same place as your licenses, using the same header style or the tags `SPDX-Exception-Identifier` and `Exception-Text` instead. This is an example of a valid exception:
cs: V nepravděpodobném případě, že váš zdrojový kód obsahuje výjimky, jako je [výjimka Classpath 2.0](https://spdx.org/licenses/Classpath-exception-2.0.html), můžete je zahrnout na stejné místo jako vaše licence, místo toho použijte stejný styl záhlaví nebo značky `SPDX-Exception-Identifier` a `Exception-Text`. Toto je příklad platné výjimky:
uk: У малоймовірному випадку, якщо ваш початковий код містить винятки, такі як [Classpath exception 2.0](https://spdx.org/licenses/Classpath-exception-2.0.html), ви можете включити їх у те саме місце, що й ваші ліцензії, використовуючи той самий стиль заголовка або теги `SPDX-Exception-Identifier` та `Exception-Text` замість них. Це приклад правильного винятку:

source: SPDX-Exception-Identifier: Classpath-exception-2.0 Exception-Text: Linking this library statically or dynamically with other modules is making a combined work based on this library. Thus, the terms and conditions of the GNU General Public License cover the whole combination.
cs: SPDX-Exception-Identifier: Classpath-exception-2.0 Exception-Text: Statické nebo dynamické propojení této knihovny s jinými moduly vytváří kombinované dílo založené na této knihovně. Podmínky GNU General Public License tedy pokrývají celou kombinaci.
uk: SPDX-Exception-Identifier: Classpath-exception-2.0 Exception-Text: Зв'язування цієї бібліотеки статично або динамічно з іншими модулями — це створення комбінованої роботи на основі цієї бібліотеки. Таким чином, терміни та умови Загальної публічної ліцензії GNU поширюються на всю комбінацію.

source: > * Don't change any license texts, use the verbatim form of the license text. > * Don't remove any license texts, include the license texts of all software. > * Include the SPDX identifier in each license file, either by including it in > the filename or by inserting a header, such that you can refer to the > license from the source code files.
cs: > * Neměňte žádné licenční texty, použijte doslovnou formu textu licence. > * Neodstraňujte žádné licenční texty, zahrňte licenční texty veškerého softwaru. > * Zahrňte identifikátor SPDX do každého licenčního souboru, buď jeho > zahrnutím do názvu souboru, nebo vložením záhlaví, > abyste mohli odkazovat na licenci ze souborů zdrojového kódu.
uk: > * Не змінюйте текст ліцензії, використовуйте дослівну форму тексту ліцензії. > * Не видаляйте жодних текстів ліцензій, додайте тексти ліцензій до всього програмного забезпечення. > * Включіть ідентифікатор SPDX до кожного файлу ліцензії, або включивши його до > назви файлу або вставивши заголовок, щоб ви могли посилатися на файл > ліцензії з файлів початкового коду.

source: Source code files are often reused across multiple projects, taken from their origin and repurposed, or otherwise end up in repositories where they are separate from its origin. You should therefore ensure that all files in your project have a comment header that convey that file's copyright and license information: Who are the copyright holders and under which license(s) do they release the file?
cs: Soubory zdrojového kódu jsou často znovu použity ve více projektech, převzaty z jejich původu a znovu použít, nebo jinak skončí v úložištích, kde jsou oddělené od svého původu. Měli byste se proto ujistit, že všechny soubory ve vašem projektu mají záhlaví komentáře, které obsahuje informace o autorských právech a licenci k danému souboru: Kdo jsou držitelé autorských práv a na základě jaké licence (licencí) soubor uvolňují?
uk: Файли початкового коду часто повторно використовуються в кількох проєктах, беруться зі свого джерела і перепризначаються, або іншим чином потрапляють у репозиторії, де вони відокремлені від свого джерела. Тому вам слід переконатися, що всі файли у вашому проєкті мають заголовок коментаря, який містить інформацію про авторські права та ліцензію на цей файл: Хто є власниками авторських прав і за якою ліцензією (ліцензіями) вони випускають файл?

source: It is highly recommended that you keep the format of these headers consistent across your files. It is important, however, that you do not remove any information from headers in files of which you are not the sole author.
cs: Důrazně doporučujeme, abyste formát těchto záhlaví zachovali ve všech souborech konzistentní. Je však důležité, abyste neodstranili žádné informace ze záhlaví v souborech, jejichž jediným autorem nejste.
uk: Вкрай рекомендовано дотримуватися однакового формату цих заголовків у всіх ваших файлах. Однак важливо, щоб ви не видаляли жодної інформації із заголовків файлів, якщо ви не єдиний їхній автор.

source: You must convey the license information of your source code file in a standardised way, so that computers can interpret it. You can do this with an `SPDX-License-Identifier` tag followed by an SPDX expression defined by the SPDX specifications.
cs: Licenční informace vašeho souboru zdrojového kódu musíte předat standardizovaným způsobem, aby je počítače mohly interpretovat. Můžete to udělat pomocí značky `SPDX-License-Identifier` následované výrazem SPDX definovaným specifikacemi SPDX.
uk: Ви повинні передавати інформацію про ліцензію вашого файлу з початковим кодом у стандартизований спосіб, щоб комп'ютери могли її інтерпретувати. Ви можете зробити це за допомогою тегу `SPDX-License-Identifier`, за яким слідує вираз SPDX, визначений специфікаціями SPDX.

source: Copyright notices in a comment header should have a consistent format and be sorted by year. They should list the actual copyright holder, which may be an organisation rather than the author. For example:
cs: Upozornění na autorská práva v záhlaví komentáře by měla mít konzistentní formát a měla by být seřazena podle roku. Měli by uvádět skutečného držitele autorských práv, kterým může být spíše organizace než autor. Například:
uk: Повідомлення про авторські права в заголовку коментаря повинні мати однаковий формат і бути відсортовані за роками. Вони повинні вказувати фактичного власника авторських прав, яким може бути організація, а не автор. Наприклад:

source: /* * Copyright (c) 2017 Alice Commit <alice@example.com> * Copyright (c) 2009-2016 Bob Denver <bob@example.com> * Copyright (c) 2007 Company Example <charlie@example.com> * * SPDX-License-Identifier: GPL-2.0 */
uk: /* * Авторське право (c) 2017 Аліса Комміт <alice@example.com> * Авторське право (c) 2009-2016 Боб Денвер <bob@example.com> * Авторське право (c) 2007 Приклад Компанії <charlie@example.com> * * SPDX-License-Identifier: GPL-2.0 */

source: You should include information about your project's practices in the README or similar file. This could be as simple as linking to these practices.
cs: Informace o postupech vašeho projektu byste měli zahrnout do souboru README nebo podobného souboru. To by mohlo být stejně jednoduché jako propojení s těmito praktikami.
uk: Ви повинні включити інформацію про практику вашого проєкту в файл README або подібний до нього. Це може бути просто посилання на ці практики.

source: All source files which are included in the final build of your project (verbatim, modified, partially, or in compiled form) must have copyright and license information contained within them. If it is not possible to add a header to the file, either because the file is a binary or because the format does not support comments, you must provide the information separately in one of three ways:
cs: Všechny zdrojové soubory, které jsou součástí konečného sestavení vašeho projektu (doslovně, upravené, částečně nebo v kompilované podobě), musí obsahovat informace o autorských právech a licenci. Pokud není možné k souboru přidat záhlaví, ať už proto, že soubor je binární nebo protože formát nepodporuje komentáře, musíte informace poskytnout samostatně jedním ze tří způsobů:
uk: Усі початкові файли, які включаються у фінальну збірку вашого проєкту (дослівні, змінені, часткові або у скомпільованому вигляді), повинні мати інформацію про авторське право та ліцензію, що міститься у них. Якщо неможливо додати заголовок до файлу, або через те, що файл бінарний, або через те, що формат не підтримує коментарі, ви повинні надати інформацію окремо одним з трьох способів:

source: You may include a textfile called `FILENAME.license` in which you store your regular comment header with all the necessary information to convey the license information about the file called `FILENAME`.
cs: Můžete zahrnout textový soubor nazvaný `FILENAME.license`, do kterého uložíte pravidelnou hlavičku komentáře se všemi nezbytnými informacemi pro předání licenčních informací o souboru s názvem `FILENAME`.
uk: Ви можете включити текстовий файл з назвою `FILENAME.license`, у якому ви зберігаєте ваш звичайний заголовок коментаря з усією необхідною інформацією для передачі ліцензійної інформації про файл з назвою `FILENAME`.

source: If you have many such files, but each have the same copyright notice and license, you may instead use the [DEP-5/copyright](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/) file format, and place a single copyright notice documenting those files.
cs: Pokud máte mnoho takových souborů, ale každý má stejnou doložku o autorských právech a licenci, můžete místo toho použít [DEP-5/copyright](https://www.debian.org/doc/packaging-manuals/copyright-format/ 1.0/) a umístěte jednu poznámku o autorských právech dokumentující tyto soubory.
uk: Якщо у вас багато таких файлів, але кожен з них має однакове повідомлення про авторські права та ліцензію, ви можете замість цього використовувати [DEP-5/copyright](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/) файловий формат, і розмістити єдине повідомлення про авторське право, що документує ці файли.

source: If you have a way of automatically generating an inventory of included files in SPDX format (see practice 3), you may use this and do not need to separately include a `.license` file or DEP-5/copyright file.
cs: Pokud máte způsob automatického generování soupisu zahrnutých souborů ve formátu SPDX (viz cvičení 3), můžete použít tento a nemusíte samostatně přidávat soubor `.license` nebo soubor DEP-5/copyright.
uk: Якщо у вас є спосіб автоматичного створення інвентаризації включених файлів у форматі SPDX (див. практику 3), ви можете скористатися ним і не включати окремо файл `.license` або файл DEP-5/копірайту.

source: If your project includes documentation which is not included in the final build artefact, you are encouraged but not obliged to include license information for these too.
cs: Pokud váš projekt obsahuje dokumentaci, která není zahrnuta v konečném artefaktu stavby, doporučujeme, ale nejste povinni zahrnout licenční informace také pro ně.
uk: Якщо ваш проєкт містить документацію, яка не входить до остаточного артефакту збірки, ви можете, але не зобов'язані додавати інформацію про ліцензію і для неї.

source: If the source code is licensed under a license such as `BSD-2-Clause`, where the license texts may differ for each different copyright holder, you should reference the specific license each time. Thus for files written by Alice, reference to `LicenseRef-BSD-2-Clause-Alice`, and for files written by Evil Corp, reference to `LicenseRef-BSD-2-Clause-Evil-Corp`, and include both those licenses separately in `LICENSES` (see practice 1).
cs: Pokud je zdrojový kód licencován na základě licence, jako je `BSD-2-Clause`, kde se licenční texty mohou u jednotlivých držitelů autorských práv lišit, měli byste pokaždé uvést konkrétní licenci. Tedy pro soubory napsané Alice odkaz na `LicenseRef-BSD-2-Clause-Alice` a pro soubory napsané společností Evil Corp odkaz na `LicenseRef-BSD-2-Clause-Evil-Corp` a zahrnují obě tyto licence samostatně v „LICENCÍCH“ (viz cvičení 1).
uk: Якщо початковий код ліцензовано за такою ліцензією, як `BSD-2-Clause`, де тексти ліцензії можуть відрізнятися для кожного окремого власника авторських прав, вам слід щоразу посилатися на конкретну ліцензію. Таким чином, для файлів, написаних Alice, посилайтеся на `LicenseRef-BSD-2-Clause-Alice`, а для файлів, написаних Evil Corp, посилайтеся на `LicenseRef-BSD-2-Clause-Evil-Corp`, і включіть обидві ці ліцензії окремо в `LICENSES` (див. практику 1).

source: make sure the version control system is publicly accessible and take steps[^1] to ensure it will remain so,
cs: ujistěte se, že je systém správy verzí veřejně přístupný a podnikněte kroky[^1], aby tomu tak zůstalo,
uk: переконайтеся, що система керування версіями загальнодоступна, і зробіть кроки[^1], щоб вона залишалася такою і надалі,

source: ensure that if someone copies the source repository without version control system metadata (such as if they make a tar-file of it), then the version control system metadata relevant for determining copyright must still be included, for example in the form of a bill of materials (see later), an automatically generated log file or similar,
cs: zajistit, že pokud někdo zkopíruje zdrojový repozitář bez metadat systému správy verzí (například když z toho vytvoří soubor tar), pak metadata systému správy verzí relevantní pro určení autorských práv musí být stále zahrnuta, například ve formě účtu materiálů (viz dále), automaticky generovaný soubor protokolu nebo podobně,
uk: переконайтеся, що якщо хтось копіює вихідний репозиторій без метаданих системи контролю версій (наприклад, якщо вони створюють tar-файл), то метадані системи керування версіями, важливі для визначення авторських прав, все одно мають бути включені, наприклад, у вигляді специфікації (див. далі), автоматично згенерованого файлу журналу або подібного,

source: /* * This file is part of project X. It's copyrighted by the contributors * recorded in the version control history of the file, available from * its original location http://git.example.com/X/filename.c * * SPDX-License-Identifier: GPL-3.0 */
cs: /* * Tento soubor je součástí projektu X. Je chráněn autorskými právy přispěvatelů * zaznamenané v historii správy verzí souboru, dostupné z * jeho původní umístění http://git.example.com/X/název souboru.c * * SPDX-License-Identifier: GPL-3.0 */
uk: /* * Цей файл є частиною проєкту X. Він захищений авторським правом авторів * записаних в історії керування версіями файлу, яка доступна за адресою * його первісне розташування http://git.example.com/X/filename.c * * SPDX-License-Identifier: GPL-3.0 */
