Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: reuse addheader --copyright="Jane Doe <jane@example.com>" --license="CC0-1.0" .gitignore reuse download --all
ru: reuse addheader --copyright=" Джейн Доу <jane@example.com>" --лицензия="CC0-1.0" .gitignore reuse download --all

source: Result
ru: Результат

source: Your project tree will now look like this:
ru: Теперь дерево вашего проекта будет выглядеть следующим образом:

source: project/ ├── img/ │ ├── cat.jpg │ ├── cat.jpg.license │ ├── dog.jpg │ └── dog.jpg.license ├── LICENSES/ │ ├── CC0-1.0.txt │ ├── CC-BY-4.0.txt │ └── GPL-3.0-or-later.txt ├── src/ │ └── main.c ├── .gitignore ├── Makefile └── README.md
ru: проект/ ├──── img/ │ ├──── cat.jpg │ ├──── cat.jpg.license │ ├──── собака.jpg │ └──── dog.jpg.license ├──── ЛИЦЕНЗИИ/ │ ├──── CC0-1.0.txt │ ├──── CC-BY-4.0.txt │ └──── GPL-3.0-or-later.txt src/ │ └──── main.c .gitignore Makefile README.md

source: Now that you have marked all files with their copyright and licensing, it is time to check whether you did not miss anything. To do this, we provide a helper tool for you to use. You can read the [full documentation](https://reuse.readthedocs.io/), or read the quick steps below.
ru: Теперь, когда вы отметили все файлы с указанием их авторских прав и лицензирования, пришло время проверить, не пропустили ли вы чего-нибудь. Для этого мы предлагаем вам вспомогательный инструмент. Вы можете прочитать [полную документацию](https://reuse.readthedocs.io/) или ознакомиться с краткими шагами ниже.

source: Follow the [installation instructions](https://github.com/fsfe/reuse-tool#install) available for multiple platforms. Now go to the project directory and run the linter.
ru: Следуйте [инструкции по установке](https://github.com/fsfe/reuse-tool#install), доступной для разных платформ. Теперь перейдите в каталог проекта и запустите linter.

source: $ cd path/to/project/ $ reuse lint # SUMMARY * Bad licenses: * Deprecated licenses: * Licenses without file extension: * Missing licenses: * Unused licenses: * Used licenses: CC-BY-4.0, CC0-1.0, GPL-3.0-or-later * Read errors: 0 * Files with copyright information: 6 / 6 * Files with license information: 6 / 6 Congratulations! Your project is compliant with version 3.0 of the REUSE Specification :-)
ru: $ cd path/to/project/ $ rause lint # SUMMARY * Плохие лицензии: * Устаревшие лицензии: * Лицензии без расширения файла: * Отсутствующие лицензии: * Неиспользуемые лицензии: * Используемые лицензии: CC-BY-4.0, CC0-1.0, GPL-3.0-or-later * Ошибки чтения: 0 * Файлы с информацией об авторских правах: 6 / 6 * Файлы с информацией о лицензии: 6 / 6 Поздравляем! Ваш проект соответствует версии 3.0 спецификации REUSE :-)

source: As you can see in the last line, the tool confirms that your project is compliant with REUSE now! To learn what the different sections mean, please have a look at the [documentation of the lint command](https://reuse.readthedocs.io/en/stable/usage.html#lint).
ru: Как видно из последней строки, инструмент подтверждает, что ваш проект теперь соответствует REUSE! Чтобы узнать, что означают различные секции, загляните в [документацию команды lint](https://reuse.readthedocs.io/en/stable/usage.html#lint).

source: Getting help
ru: Получение помощи

source: After going through this tutorial, you understood REUSE and the three basic steps to properly license your software project – well done! But although we have covered a few edge cases, you might run into more questions soon. But don't worry, we are here to help!:
ru: После прохождения этого руководства вы поняли, что такое REUSE и три основных шага для правильного лицензирования вашего программного проекта - отлично! Но, несмотря на то, что мы рассмотрели несколько крайних случаев, вы можете столкнуться с новыми вопросами. Но не волнуйтесь, мы здесь, чтобы помочь!:

source: - Our [Frequently Asked Questions](https://reuse.software/faq) covers common questions as well as extraordinary cases and will constantly be updated.
ru: - Наш раздел [Часто задаваемые вопросы](https://reuse.software/faq) охватывает как общие вопросы, так и экстраординарные случаи и будет постоянно обновляться.

source: - The full [REUSE specification](https://reuse.software/spec) formally describes REUSE and the methods to become compliant.
ru: - Полная спецификация [REUSE](https://reuse.software/spec) официально описывает REUSE и методы обеспечения соответствия.

source: opening an issue on [reuse-docs](https://github.com/fsfe/reuse-docs) for questions on the tutorial, FAQ or specification;
ru: открытие проблемы на [reuse-docs](https://github.com/fsfe/reuse-docs) для вопросов по учебнику, FAQ или спецификации;
