Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: The reason that these files _must_ be licensed is because reasonable minds can differ about the threshold of originality. You may consider a file so insignificant that it does not merit licensing information, but downstream may disagree and believe that the file in question falls under copyright, effectively disallowing them from using it if there is no license.
cs: Důvodem, proč tyto soubory _musí_ být licencovány, je skutečnost, že rozumné názory na hranici originality se mohou lišit. Vy můžete soubor považovat za tak nevýznamný, že si nezaslouží informace o licenci, ale nižší proud může nesouhlasit a domnívat se, že daný soubor spadá pod autorská práva, což jim v podstatě znemožňuje jeho použití, pokud licence neexistuje.
uk: Причина, чому ці файли _повинні_ бути ліцензованими, полягає в тому, що розумні люди можуть по-різному оцінювати поріг оригінальності. Ви можете вважати файл настільки незначним, що він не заслуговує на інформацію про ліцензування, але далі за течією можуть не погодитися і вважати, що цей файл підпадає під авторське право, що фактично забороняє їм використовувати його, якщо немає ліцензії.

source: It is important to note that you can only apply licenses to your own works. If the file was authored by someone else, you should declare their copyright and license in the header. If there is no such information, you should contact the author.
cs: Je důležité si uvědomit, že licence můžete použít pouze na svá vlastní díla. Pokud je autorem souboru někdo jiný, měli byste v záhlaví uvést jeho autorská práva a licenci. Pokud takové informace nejsou, měli byste se obrátit na autora.
uk: Важливо зазначити, що ви можете застосовувати ліцензії лише до власних творів. Якщо файл був створений кимось іншим, ви повинні задекларувати його авторські права та ліцензію в заголовку. Якщо такої інформації немає, слід звернутися до автора.

source: ... separately declare the copyright and license of a part of a file? {#partial-license}
cs: ... samostatně deklarovat autorská práva a licenci k části souboru? {#partial-license}
uk: ... окремо декларувати авторське право та ліцензію на частину файлу? {#partial-license}

source: It may happen that you copy some third-party code into a bigger file. You can add the copyright and licensing to the file's header, or you can add in-line snippet comments around this new block of code.
cs: Může se stát, že do většího souboru zkopírujete kód třetí strany. Do hlavičky souboru můžete přidat autorská práva a licenci nebo můžete kolem tohoto nového bloku kódu přidat řádkové komentáře.
uk: Може статися так, що ви скопіюєте якийсь сторонній код у більший файл. Ви можете додати інформацію про авторські права та ліцензування до заголовка файлу або додати вбудовані коментарі до фрагмента коду навколо цього нового блоку коду.

source: Such an annotated snippet block must start with `SPDX-SnippetBegin` to mark its beginning and end with `SPDX-SnippetEnd` to mark the snippet's end.
cs: Takto anotovaný blok snippetu musí začínat symbolem `SPDX-SnippetBegin`, který označuje jeho začátek, a končit symbolem `SPDX-SnippetEnd`, který označuje konec snippetu.
uk: Такий анотований блок фрагментів повинен починатися з `SPDX-SnippetBegin`, щоб позначити його початок, і закінчуватися `SPDX-SnippetEnd`, щоб позначити кінець фрагмента.

source: Do note that SPDX tags must start with `SPDX-Snippet` inside of snippets, meaning that the (only) correct copyright notice in a snippet is `SPDX-SnippetCopyrightText`. `SPDX-License-Identifier` is an exception.
cs: Upozorňujeme, že značky SPDX musí uvnitř fragmentů začínat znakem `SPDX-Snippet`, což znamená, že (jediné) správné upozornění na autorská práva ve fragmentu je `SPDX-SnippetCopyrightText`. Výjimkou je `SPDX-License-Identifier`.
uk: Зверніть увагу, що теги SPDX повинні починатися з `SPDX-Snippet` всередині фрагментів, що означає, що (єдиним) правильним повідомленням про авторські права у фрагменті є `SPDX-SnippetCopyrightText`. Винятком є `SPDX-License-Identifier`.

source: Example:
cs: Příklad:
uk: Приклад:

source: # SPDX-SnippetBegin # SPDX-License-Identifier: MIT # SPDX-SnippetCopyrightText: 2023 Jane Doe <jane@example.com> {$snippet_code_goes_here} # SPDX-SnippetEnd
uk: # SPDX-SnippetBegin # SPDX-License-Identifier: MIT # SPDX-SnippetCopyrightText: 2023 Джейн Доу <jane@example.com> {$snippet_code_goes_here} # SPDX-SnippetEnd

source: Snippets may nest, and this is denoted by having `SPDX-SnippetBegin`/`SPDX-SnippetEnd` pairs within other pairs, in the same way that parentheses nest in mathematical expressions. In the case of nested snippets, the SPDX file tags are considered to apply to the inner-most snippet. Example:
cs: Snippety se mohou vnořovat, což se označuje dvojicemi `SPDX-SnippetBegin`/`SPDX-SnippetEnd` uvnitř jiných dvojic, stejně jako se v matematických výrazech vnořují závorky. V případě vnořených fragmentů se má za to, že značky souboru SPDX se vztahují na nejvnitřnější fragment. Příklad:
uk: Фрагменти можуть вкладатися, і це позначається наявністю пар `SPDX-SnippetBegin`/`SPDX-SnippetEnd` всередині інших пар, подібно до того, як дужки вкладаються у математичних виразах. У випадку вкладених фрагментів вважається, що теги SPDX-файлу застосовуються до самого внутрішнього фрагмента. Приклад:

source: # SPDX-SnippetBegin # SPDX-License-Identifier: MIT # SPDX-SnippetCopyrightText: 2023 Jane Doe <jane@example.com> {$snippet_code_under_MIT} # SPDX-SnippetBegin # SPDX-License-Identifier: BSD-2-Clause # SPDX-SnippetCopyrightText: Copyright Example Company {$snippet_code_under_BSD-2-Clause} # SPDX-SnippetEnd {$more_snippet_code_under_MIT} # SPDX-SnippetEnd
uk: # SPDX-SnippetBegin # SPDX-License-Identifier: MIT # SPDX-SnippetCopyrightText: 2023 Джейн Доу <jane@example.com> {$snippet_code_under_MIT} # SPDX-SnippetBegin # SPDX-License-Identifier: BSD-2-Clause # SPDX-SnippetCopyrightText: Приклад компанії з авторським правом {$snippet_code_under_BSD-2-Clause} # SPDX-SnippetEnd {$more_snippet_code_under_MIT} # SPDX-SnippetEnd

source: It is also considered good practice to further specify the origin of the snippet, for instance by a comment like "The class Foo is copied from project Bar".
cs: Za dobrou praxi se také považuje bližší určení původu úryvku, například komentářem typu "Třída Foo je zkopírována z projektu Bar".
uk: Також вважається гарною практикою додатково вказувати походження фрагмента, наприклад, за допомогою коментаря на кшталт "Клас Foo скопійовано з проєкту Bar".

source: A possible alternative to using snippets is to extract the code block from the file, and to keep it in its own file.
cs: Možnou alternativou k použití fragmentů je vyjmout blok kódu ze souboru a ponechat jej ve vlastním souboru.
uk: Альтернативою використанню фрагментів є вилучення блоку коду з файлу і збереження його у власному файлі.

source: ... use a license that is not on the SPDX License List? {#custom-license}
cs: ... použít licenci, která není na seznamu licencí SPDX? {#custom-license}
uk: ... використовуєте ліцензію, якої немає у списку ліцензій SPDX? {#custom-license}

source: If you have a custom or modified license that does not appear in the SPDX License List, place your license in the file `LICENSES/LicenseRef-MyLicense.txt`. By naming your license with the prefix `LicenseRef-`, tools that speak SPDX will still be able to recognise your license.
cs: Pokud máte vlastní nebo upravenou licenci, která není uvedena v seznamu licencí SPDX, umístěte svou licenci do souboru `LICENSES/LicenseRef-MyLicense.txt`. Pokud svou licenci pojmenujete s předponou `LicenseRef-`, budou nástroje, které umí SPDX, schopny vaši licenci rozpoznat.
uk: Якщо ви маєте власну або модифіковану ліцензію, якої немає у списку ліцензій SPDX, помістіть її у файл `LICENSES/LicenseRef-MyLicense.txt`. Якщо назвати вашу ліцензію з префіксом `LicenseRef-`, інструменти, які підтримують SPDX, зможуть розпізнати вашу ліцензію.

source: In this example, the header in files covered by this custom license may look like the following:
cs: V tomto příkladu může záhlaví souborů, na které se vztahuje tato vlastní licence, vypadat následovně:
uk: У цьому прикладі заголовок у файлах, на які поширюється ця користувацька ліцензія, може мати такий вигляд:

source: # SPDX-License-Identifier: LicenseRef-MyLicense # SPDX-FileCopyrightText: 2017 Jane Doe <jane@example.com>
uk: # SPDX-License-Identifier: LicenseRef-MyLicense # SPDX-FileCopyrightText: 2017 Джейн Доу <jane@example.com>

source: This may also be necessary when dealing with multiple different variants of [customisable license text files like MIT or BSD](#license-templates).
cs: To může být také nutné při práci s více různými variantami [přizpůsobitelných textových souborů licencí, například MIT nebo BSD](#license-templates).
uk: Це також може знадобитися, коли ви маєте справу з кількома різними варіантами [настроюваних текстових файлів ліцензії, як у MIT або BSD](#license-templates).

source: Please note: It is strongly advised to [use established and approved licenses](#which-license).
cs: Upozornění: Důrazně doporučujeme [use established and approved licenses](#which-license).
uk: Зауважте: Наполегливо радимо [використовувати встановлені та затверджені ліцензії](#which-license).

source: ... use a custom license exception? {#custom-exception}
cs: ... použít vlastní licenční výjimku? {#custom-exception}
uk: ... використовувати користувацький виняток з ліцензії? {#custom-exception}

source: It is not possible to create a custom exception. Instead, you may [create a custom license](#custom-license) that embeds the exception.
cs: Není možné vytvořit vlastní výjimku. Místo toho můžete [vytvořit vlastní licenci](#custom-license), která vloží výjimku.
ru: Невозможно создать пользовательское исключение. Вместо этого вы можете [создать пользовательскую лицензию](#custom-license), в которую встроено исключение.
uk: Неможливо створити власний виняток. Замість цього ви можете [створити власну ліцензію](#custom-license), яка вбудовує виняток.

source: ... properly declare multi-licensing? {#multi-licensing}
cs: ... správně deklarovat multilicenci? {#multi-licensing}
uk: ... правильно декларувати мультиліцензування? {#multi-licensing}

source: You should always include all licenses in the `LICENSES/` directory.
cs: Všechny licence byste měli vždy zahrnout do adresáře `LICENSES/`.
ru: Вы всегда должны включать все лицензии в каталог `Лицензии/`.
uk: Ви завжди повинні включати всі ліцензії в каталог `LICENSES/`.

source: The correct SPDX license expression that applies to the file depends on the intent. If all the code within is licensed under multiple licenses, and the licensee can choose under which license they consume the work, use `SPDX-License-Identifier: MPL-1.1 OR GPL-2.0-or-later OR LGPL-2.1-or-later`, as parts of Firefox do.
cs: Správný licenční výraz SPDX, který se na soubor vztahuje, závisí na záměru. Pokud je veškerý kód uvnitř souboru licencován pod více licencemi a nabyvatel licence si může vybrat, pod kterou licencí dílo spotřebuje, použijte `SPDX-License-Identifier: MPL-1.1 OR GPL-2.0-or-later OR LGPL-2.1-or-later`, jak to dělají části Firefoxu.
ru: Правильное выражение лицензии SPDX, применяемое к файлу, зависит от намерений. Если весь код в файле лицензирован под несколькими лицензиями, и лицензиат может выбрать, под какой лицензией ему использовать работу, используйте `SPDX- Лицензия-Идентификатор: MPL-1.1 ИЛИ GPL-2.0-or-later ИЛИ LGPL-2.1-or-later`, как это делают части Firefox.
uk: Правильний вираз ліцензії SPDX, який застосовується до файлу, залежить від способу. Якщо весь код всередині ліцензований під кількома ліцензіями, і ліцензіат може вибрати, за якою ліцензією він надає твір, використовуйте `SPDX-License-Identifier: MPL-1.1 OR GPL-2.0-or-later OR LGPL-2.1-or-later`, як це робить Firefox.

source: If all the code within the file is licensed under multiple licenses, and the user must comply with all licenses simultaneously, use `SPDX-License-Identifier: LGPL-2.0-or-later AND AML`, as can be found in Simple DirectMedia Layer (SDL).
cs: Pokud je veškerý kód v souboru licencován pod více licencemi a uživatel musí dodržovat všechny licence současně, použijte `SPDX-License-Identifier: A AML`, jak lze nalézt v Simple DirectMedia Layer (SDL).
ru: Если весь код в файле лицензирован под несколькими лицензиями, и пользователь должен соблюдать все лицензии одновременно, используйте `SPDX- Лицензия-Идентификатор: LGPL-2.0-или-позднее И AML`, как это можно найти в Simple DirectMedia Layer (SDL).
uk: Якщо весь код у файлі ліцензовано кількома ліцензіями, і користувач повинен прийняти всі ліцензії одночасно, застосуйте `SPDX-License-Identifier: LGPL-2.0-or-later AND AML`, як це можна знайти в Simple DirectMedia Layer (SDL).

source: If all the code within the file is licensed under either one license or another (for instance, all code is under GPL-2.0-only, but one function is under MIT), use [snippets](#partial-license).
cs: Pokud je veškerý kód v souboru licencován pod jednou nebo druhou licencí (například veškerý kód je pouze pod GPL-2.0, ale jedna funkce je pod MIT), použijte [snippets](#partial-license).
uk: Якщо весь код у файлі ліцензовано під тією чи іншою ліцензією (наприклад, весь код ліцензовано лише під GPL-2.0, але одну функцію - під MIT), використовуйте [snippets](#partial-license).

source: You can read more about SPDX expressions [in the specification](https://spdx.github.io/spdx-spec/v2.3/SPDX-license-expressions/).
cs: Více informací o výrazech SPDX najdete [ve specifikaci](https://spdx.github.io/spdx-spec/v2.3/SPDX-license-expressions/).
uk: Ви можете прочитати більше про вирази SPDX [у специфікації](https://spdx.github.io/spdx-spec/v2.3/SPDX-license-expressions/).

source: ... deal with license texts which include copyright statements, like MIT/BSD? {#license-templates}
cs: ... se vypořádat s licenčními texty, které obsahují prohlášení o autorských právech, jako je MIT/BSD? {#license-templates}
uk: ... мати справу з текстами ліцензій, які містять заяви про авторські права, як MIT/BSD? {#license-templates}

source: Some license texts, such as MIT or the BSD family of licenses, can be modified to contain custom copyright notices.
cs: Některé licenční texty, například licence MIT nebo BSD, lze upravit tak, aby obsahovaly vlastní upozornění na autorská práva.
uk: Деякі тексти ліцензій, такі як ліцензії MIT або сімейства BSD, можуть бути змінені, щоб містити спеціальні повідомлення про авторські права.

source: If you are releasing code under such a license, we recommend that you add the license text to the project without any modifications whatsoever. A good way of obtaining the unmodified license text is using the REUSE helper tool (e.g., `reuse download MIT`). Instead of inserting your copyright notice into the license text itself, you add copyright statements to your project's files following the normal REUSE best practices.
cs: Pokud zveřejňujete kód pod takovou licencí, doporučujeme přidat text licence do projektu bez jakýchkoli úprav. Dobrým způsobem, jak získat neupravený text licence, je použití pomocného nástroje REUSE (např. `reuse download MIT`). Namísto vkládání upozornění na autorská práva do samotného textu licence přidáte prohlášení o autorských právech do souborů projektu podle běžných osvědčených postupů REUSE.
uk: Якщо ви випускаєте код під такою ліцензією, ми рекомендуємо додати текст ліцензії до проєкту без будь-яких змін. Хороший спосіб отримати незмінений текст ліцензії — скористатися допоміжним інструментом REUSE (наприклад, `reuse download MIT`). Замість того, щоб вставляти повідомлення про авторські права у сам текст ліцензії, ви додаєте заяви про авторські права до файлів вашого проєкту, дотримуючись звичайних найкращих практик REUSE.

source: When you reuse code from multiple sources that use an MIT/BSD license, you quickly run into a problem. Both the MIT license and the BSD family of licenses include a clause that requires the redistributor (that's you) to reproduce the copyright notice and the license text. For instance, Project A and Project B might both use an MIT license, but the actual license files will differ because they have different copyright notices embedded within them. If you want to reuse code from both of these projects, you might not be sure where to put your copies of those projects' license files.
cs: Při opakovaném použití kódu z více zdrojů, které používají licenci MIT/BSD, rychle narazíte na problém. Licence MIT i rodina licencí BSD obsahují klauzuli, která vyžaduje, aby redistributor (tedy vy) reprodukoval oznámení o autorských právech a text licence. Například projekt A a projekt B mohou oba používat licenci MIT, ale skutečné licenční soubory se budou lišit, protože v nich budou vložena různá upozornění na autorská práva. Pokud chcete znovu použít kód z obou těchto projektů, nemusíte si být jisti, kam umístit své kopie licenčních souborů těchto projektů.
uk: Коли ви повторно використовуєте код з декількох джерел, які використовують ліцензію MIT/BSD, ви швидко зіткнетеся з проблемою. І ліцензія MIT, і сімейство ліцензій BSD містять пункт, який вимагає від розповсюджувача (тобто вас) відтворювати повідомлення про авторські права і текст ліцензії. Наприклад, Проєкт A і Проєкт Б можуть використовувати ліцензію MIT, але фактичні ліцензійні файли будуть відрізнятися, оскільки вони містять різні повідомлення про авторські права. Якщо ви хочете повторно використовувати код з обох цих проєктів, ви можете не знати, куди подіти свої копії ліцензійних файлів цих проєктів.

source: We recommend two options:
cs: Doporučujeme dvě možnosti:
uk: Ми рекомендуємо дві опції:

source: The most pragmatic solution is to put the unmodified license text (i.e., the license text template without any copyright notices) in your `LICENSES/` folder. You then embed the copyright notices of the upstream project into the corresponding source code files you reused, as usual.
cs: Nejpragmatičtějším řešením je umístit neupravený text licence (tj. šablonu textu licence bez upozornění na autorská práva) do složky `LICENSES/`. Do odpovídajících souborů zdrojového kódu, které jste znovu použili, pak jako obvykle vložíte upozornění na autorská práva z upstreamového projektu.
uk: Найпрагматичніше рішення — помістити незмінений текст ліцензії (тобто шаблон тексту ліцензії без жодних повідомлень про авторські права) до вашої теки `LICENSES/`. Потім ви вставляєте повідомлення про авторські права попереднього проєкту у відповідні файли початкового коду, які ви використовували повторно, як зазвичай.

source: The more thorough and labour-intensive solution is to treat any of these license texts with modified copyright notices as a [custom license using LicenseRef](#custom-license). However, if you reuse code from many third parties under these licenses, you may end up with a lot of these custom licenses.
cs: Důkladnějším a pracnějším řešením je považovat jakýkoli z těchto licenčních textů s upravenými poznámkami o autorských právech za [vlastní licenci s použitím LicenseRef](#custom-license). Pokud však pod těmito licencemi opakovaně používáte kód od mnoha třetích stran, může se stát, že budete mít těchto vlastních licencí hodně.
uk: Ретельніше і трудомісткіше рішення полягає в тому, щоб розглядати будь-який з цих текстів ліцензії зі зміненими повідомленнями про авторські права як [користувацьку ліцензію з використанням LicenseRef](#custom-license). Однак, якщо ви повторно використовуєте багато стороннього коду під цими ліцензіями, у вас може з'явитися багато таких нестандартних ліцензій.

source: ... deal with a file that has been edited by many people? {#many-copyright-statements}
cs: ... se vypořádat se souborem, který upravovalo mnoho lidí? {#many-copyright-statements}
uk: ... мати справу з файлом, який редагували багато людей? {#many-copyright-statements}

source: Some files are edited by many people and would have an extremely long list of copyright holders in the header. This may be aesthetically unpleasing, but is not incorrect.
cs: Některé soubory jsou upravovány mnoha lidmi a v záhlaví je uveden velmi dlouhý seznam držitelů autorských práv. To může být esteticky nepříjemné, ale není to nesprávné.
ru: Некоторые файлы редактируются многими людьми, и в заголовке может быть очень длинный список правообладателей. Это может быть эстетически неприятно, но не неправильно.
uk: Деякі файли змінюються багатьма користувачами й мають надзвичайно довгий список власників авторських прав у заголовку. Це може бути приємно, але не є неправильним.

source: If you would rather not deal with having so many copyright notices, some projects such as Chromium circumvent this problem by using "Copyright (c) 2013 The Chromium Authors" as their copyright tag. You may consider doing this, but then you should keep a list of copyright holders and authors in a separate file in your project.
cs: Pokud se nechcete zabývat tolika upozorněními na autorská práva, některé projekty, jako například Chromium, tento problém obcházejí tím, že jako značku autorských práv používají "Copyright (c) 2013 The Chromium Authors". Můžete o tom uvažovat, ale pak byste měli mít seznam držitelů autorských práv a autorů v samostatném souboru ve svém projektu.
ru: Если вы не хотите иметь дело с большим количеством уведомлений об авторских правах, некоторые проекты, такие как Chromium, обходят эту проблему, используя " Авторское право (c) 2013 Авторы Chromium" в качестве тега авторского права. Вы можете рассмотреть такую возможность, но тогда вам следует хранить список владельцев авторских прав и авторов в отдельном файле в вашем проекте.
uk: Якщо ви не хочете мати справу з такою кількістю повідомлень про авторські права, деякі проєкти, такі як Chromium, обходять цю проблему, застосовуючи «Авторське право (c) 2013 Автори Chromium» міткою авторських прав. Ви можете розглянути такий спосіб, але тоді ви повинні тримати список правовласників і авторів в окремому файлі у вашому проєкті.

source: Why REUSE
cs: Proč REUSE
uk: Чому REUSE

source: Do I really need to include the license and copyright headers in all files? Why should I care? {#why-care}
cs: Opravdu musím ve všech souborech uvádět záhlaví o licenci a autorských právech? Proč by mě to mělo zajímat? {#why-care}
uk: Чи потрібно додавати заголовки ліцензії та авторських прав до всіх файлів? Чому мене це повинно хвилювати? {#why-care}

source: Big projects with complex copyright and licensing stand the most to gain from REUSE by shaping order out of chaos and disambiguating unclear licensing. Putting a header in every single file is a necessary evil to obtain that order and clarity. This metadata needs to be somewhere, and we are opined that it should be as close to the data as possible---as a header in each file.
cs: Velké projekty se složitými autorskými právy a licencemi mohou z REUSE získat nejvíce, protože z chaosu vytvoří pořádek a vyřeší nejasné licencování. Vložení záhlaví do každého souboru je nutným zlem pro dosažení tohoto pořádku a přehlednosti. Tato metadata musí někde být a podle našeho názoru by měla být co nejblíže datům - jako záhlaví v každém souboru.
uk: Великі проєкти зі складними авторськими правами та ліцензуванням отримують найбільше користі від REUSE, формуючи порядок з хаосу та роз'яснюючи незрозумілі ліцензії. Додавання заголовка до кожного окремого файлу є необхідним злом для досягнення цього порядку і ясності. Ці метадані мають бути десь, і ми вважаємо, що вони мають бути якомога ближче до даних---як заголовок у кожному файлі.
