Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: The first thing you need to do is to [choose a license]({{< relref "faq.md#which-license" >}}). For this tutorial, we assume that you chose the GNU General Public License (GPL) v3.0 or any later version. More than simply choosing a license, you need to put the license in your project directory.
cs: Nejprve je třeba [vybrat licenci]({{< relref "faq.md#which-license" >}}). Pro tento návod předpokládáme, že jste si vybrali licenci GNU General Public License (GPL) v3.0 nebo jakoukoli novější verzi. Nestačí než jen výběr licence, musíte licenci umístit do adresáře projektu.
ru: Первое, что вам нужно сделать, это [выбрать лицензию]({{< relref "faq.md#which-license">}}). В этом руководстве мы предполагаем, что вы выбрали GNU General Public License (GPL) v3.0 или любую более позднюю версию. Не просто чем просто выбрать лицензию, вам нужно поместить ее в каталог проекта.
uk: Перше, що вам потрібно зробити, це [обрати ліцензію]({{< relref "faq.md#which-license" >}}). У цьому посібнику ми припускаємо, що ви вибрали Загальну публічну ліцензію GNU (GPL) v3.0 або новішу версію. Обравши ліцензію, вам потрібно розмістити ліцензію в каталозі вашого проєкту.

source: Find your license in the [SPDX License List](https://spdx.org/licenses/). SPDX is an open standard for communicating license and copyright information. Each license is uniquely identified by a shortform SPDX License Identifier. The SPDX License Identifier for your chosen license is `GPL-3.0-or-later`.
cs: Najděte svou licenci v [Seznamu licencí SPDX](https://spdx.org/licenses/). SPDX je otevřený standard pro sdělování informací o licencích a autorských právech. Každá licence je jednoznačně identifikována krátkým identifikátorem licence SPDX. Identifikátor licence SPDX pro vámi vybranou licenci je `GPL-3.0-nebo-novější`.
uk: Знайдіть свою ліцензію в [Списку ліцензій SPDX] (https://spdx.org/licenses/). SPDX - це відкритий стандарт для передачі інформації про ліцензії та авторські права. Кожна ліцензія унікально ідентифікується за допомогою короткого ідентифікатора ліцензії SPDX. Ідентифікатор ліцензії SPDX для обраної вами ліцензії - `GPL-3.0-or-later`.

source: Create a `LICENSES/` directory in your project root which will contain all the licenses that you use in your project. In your case, this means creating a file `GPL-3.0-or-later.txt` in this directory, which will contain the full license text. The name of the file is an SPDX License Identifier. You can find the license text for many Free Software licenses in the [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) repository.
cs: V kořenovém adresáři projektu vytvořte adresář `LICENSES/`, který bude obsahovat všechny licence, které v projektu používáte. Ve vašem případě to znamená vytvořit v tomto adresáři soubor `GPL-3.0-or-later.txt`, který bude obsahovat úplné znění licence. Název souboru je identifikátor licence SPDX. Licenční texty mnoha licencí svobodného softwaru najdete v úložišti [license-list-data](https://github.com/spdx/license-list-data/tree/master/text).
uk: Створіть каталог `LICENSES/` у корені вашого проєкту, який міститиме всі ліцензії, які ви використовуєте у вашому проєкті. У вашому випадку, це означає створення файлу `GPL-3.0-or-later.txt` у цьому каталозі, який міститиме повний текст ліцензії. Назва файлу — ідентифікатор ліцензії SPDX. Ви можете знайти текст ліцензії для багатьох ліцензій на вільне програмне забезпечення у репозиторії [license-list-data](https://github.com/spdx/license-list-data/tree/master/text).

source: [The `reuse download` command](https://reuse.readthedocs.io/en/stable/man/reuse-download.html) enables you to download a specific license. `reuse download GPL-3.0-or-later` would fulfil the task described in the manual instructions above. Running `reuse download --all` automatically downloads all licenses which the REUSE tool detects as being used in your project.
cs: [Příkaz `reuse download`] (https://reuse.readthedocs.io/en/stable/man/reuse-download.html) vám umožňuje stáhnout konkrétní licenci. `opětovné stažení GPL-3.0-nebo-novější` by splnilo úlohu popsanou v návodu k použití výše. Spuštěním `reuse download --all` se automaticky stahují všechny licence, které nástroj REUSE detekuje jako používané ve vašem projektu.
uk: [Команда `reuse download`](https://reuse.readthedocs.io/en/stable/man/reuse-download.html) дає вам змогу завантажити певну ліцензію. `reuse download GPL-3.0-or-later` або пізнішої версії виконало б завдання, описане у настановах посібника вище. Виконання команди `reuse download --all` автоматично завантажить усі ліцензії, які інструмент REUSE виявить як такі, що використовуються у вашому проєкті.

source: Now that you have a license, you need to indicate in the relevant files that these files fall under that license. Edit the comment header of `src/main.c` as such:
cs: Nyní, když máte licenci, musíte v příslušných souborech uvést, že tyto soubory spadají pod tuto licenci. Upravte záhlaví komentáře `src/main.c` takto:
uk: Тепер, коли у вас є ліцензія, вам потрібно вказати у відповідних файлах, що ці файли підпадають під дію цієї ліцензії. Відредагуйте заголовок коментаря до файлу `src/main.c` як такий:

source: /* * SPDX-FileCopyrightText: 2024 Jane Doe <jane@example.com> * * SPDX-License-Identifier: GPL-3.0-or-later */
uk: /* * SPDX-FileCopyrightText: 2024 Джейн Доу <jane@example.com> * * SPDX-License-Identifier: GPL-3.0-or-later */

source: The `SPDX-FileCopyrightText` tag records the publication years and copyright holder of the contents of the file. You can read more about [which publication years to use]({{< relref "faq.md#years-copyright" >}}) and [what copyright holders are]({{< relref "faq.md#copyright-holder-author" >}}) in the FAQ.
cs: Značka `SPDX-FileCopyrightText` zaznamenává roky zveřejnění a držitele autorských práv k obsahu souboru. Můžete si přečíst více o [which publication years to use]({{< relref "faq.md#years-copyright" >}}) a [what copyright holders are]({{< relref "faq.md#copyright-holder-author" >}}) v FAQ.
uk: Тег `SPDX-FileCopyrightText` записує роки публікації та авторські права власника авторських прав на вміст файлу. Ви можете прочитати докладніше [який рік публікації використовувати]({{< relref "faq.md#years-copyright" >}}) і [які бувають власники авторських прав]({{< relref "faq.md#copyright-holder-author" >}}) у розділі поширених запитань.

source: The `SPDX-License-Identifier` tag is followed by a [valid SPDX License Expression](https://spdx.org/specifications), typically just the SPDX License Identifier of the license.
cs: Za značkou `SPDX-License-Identifier` následuje [platné vyjádření licence SPDX](https://spdx.org/specifications), obvykle pouze identifikátor licence SPDX.
ru: За тегом `SPDX- Лицензия-Идентификатор` следует [ действующее выражение лицензии SPDX](https://spdx.org/specifications), обычно просто идентификатор лицензии SPDX.
uk: За тегом `SPDX-License-Identifier` слідує [дійсний вираз ліцензії SPDX](https://spdx.org/specifications), як правило, лише ідентифікатор ліцензії SPDX.

source: Each file must always contain these two tags in the header. You are allowed to use the `SPDX-FileCopyrightText` tag multiple times if you have multiple copyright holders.
cs: Každý soubor musí v záhlaví vždy obsahovat tyto dva tagy. Pokud máte více držitelů autorských práv, můžete značku `SPDX-FileCopyrightText` použít vícekrát.
uk: Кожен файл завжди повинен містити ці два теги в заголовку. Ви можете використовувати тег `SPDX-FileCopyrightText` декілька разів, якщо у вас є декілька власників авторських прав.

source: In the example project, you also edit `Makefile` and `README.md` using this header information, but of course with corresponding comment syntax.
cs: V ukázkovém projektu také upravíte `Makefile` a `README.md` pomocí těchto hlavičkových informací, ale samozřejmě s odpovídající syntaxí komentářů.
ru: В примере проекта вы также редактируете `Makefile` и `README.md`, используя эту заголовочную информацию, но, разумеется, с соответствующим синтаксисом комментариев.
uk: У прикладі проєкту ви також редагуєте `Makefile` і `README.md`, використовуючи цю інформацію заголовка, але, звичайно, з відповідним синтаксисом коментарів.

source: [The `reuse annotate` command](https://reuse.readthedocs.io/en/stable/man/reuse-annotate.html) helps with adding licensing and copyright information to your files. For the task above, the following command will do the job:
cs: [Příkaz `reuse annotate`](https://reuse.readthedocs.io/en/stable/man/reuse-annotate.html) pomáhá s přidáváním informací o licencích a autorských právech k vašim souborům. U výše uvedené úlohy provede tuto úlohu následující příkaz:
uk: [Команда `reuse annotate`](https://reuse.readthedocs.io/en/stable/man/reuse-annotate.html) допомагає додавати до ваших файлів інформацію про ліцензування та авторські права. Для наведеного вище завдання підійде така команда:

source: reuse annotate --copyright="Jane Doe <jane@example.com>" --license="GPL-3.0-or-later" src/main.c Makefile README.md
uk: reuse annotate --copyright="Джейн Доу <jane@example.com>" --license="GPL-3.0-or-later" src/main.c Makefile README.md

source: Having added a license to your repository and having added copyright and licensing information to each file, your project tree will now look like this:
cs: Po přidání licence do vašeho úložiště a přidání informací o autorských právech a licencích do každého souboru bude váš strom projektu nyní vypadat takto:
uk: Після додавання ліцензії до вашого репозиторію і додавання інформації про авторські права та ліцензування до кожного файлу, ваше дерево проєктів тепер матиме такий вигляд:

source: To ensure that you did not miss anything, you should confirm REUSE compliance with the REUSE tool. Follow the [installation instructions](https://reuse.readthedocs.io/en/latest/readme.html#install) available for multiple platforms, then go to the project directory and run the linter.
cs: Abyste měli jistotu, že vám nic neunikne, měli byste potvrdit shodu REUSE pomocí nástroje REUSE. Postupujte podle [pokynů k instalaci](https://reuse.readthedocs.io/en/latest/readme.html#install) dostupných pro více platforem, poté přejděte do adresáře projektu a spusťte linter.
uk: Щоб переконатися, що ви нічого не пропустили, вам слід підтвердити відповідність REUSE за допомогою інструменту REUSE. Дотримуйтесь [інструкцій зі встановлення](https://reuse.readthedocs.io/en/latest/readme.html#install), доступних для різних платформ, потім перейдіть до каталогу проєкту і запустіть linter.

source: As you can see in the last line, the tool confirms that your project is compliant with REUSE now! To learn what the different criteria mean, please have a look at the [documentation of the lint command](https://reuse.readthedocs.io/en/stable/man/reuse-lint.html).
cs: Jak můžete vidět na posledním řádku, nástroj potvrzuje, že váš projekt je nyní v souladu s REUSE! Chcete-li zjistit, co znamenají různá kritéria, podívejte se prosím na [dokumentaci příkazu lint](https://reuse.readthedocs.io/en/stable/man/reuse-lint.html).
uk: Як ви можете бачити в останньому рядку, інструмент підтверджує, що ваш проєкт тепер відповідає вимогам REUSE! Щоб дізнатися, що означають різні критерії, перегляньте [документацію до команди lint](https://reuse.readthedocs.io/en/stable/man/reuse-lint.html).

source: More information
cs: Více informací
uk: Більше інформації

source: This tutorial was a lightning-quick introduction to REUSE. Not all use-cases are covered here, especially [how to annotate uncommentable files]({{< relref "faq.md#uncommentable-file" >}}), [how to bulk-annotate files]({{< relref "faq.md#bulk-license" >}}), and [how to use a license not on the SPDX list]({{< relref "faq.md#custom-license" >}}). In order to learn about these and more practical use-cases, see the ['How do I ...' section in the Frequently Asked Questions]({{< relref "faq.md#howto" >}}).
cs: Tento tutoriál byl bleskově rychlým úvodem do REUSE. Nejsou zde pokryty všechny případy použití, zejména [jak komentovat nekomentovatelné soubory] ({{< relref "faq.md#uncommentable-file" >}}), [jak hromadně anotovat soubory] ({{< relref " faq.md#bulk-license" >}}) a [jak používat licenci, která není na seznamu SPDX] ({{< relref "faq.md#custom-license" >}}). Chcete-li se dozvědět o těchto a praktičtějších případech použití, podívejte se do části ['Jak mohu ...' v části Často kladené otázky] ({{< relref "faq.md#howto" >}}).
uk: Цей посібник був блискавичним вступом до REUSE. Не всі варіанти використання розглянуто тут, особливо [як коментувати некоментовані файли]({{< relref "faq.md#uncommentable-file" >}}), [як коментувати файли]({{< relref "faq.md#uncommentable-file" >}}), [як масово коментувати файли]({{< relref "faq.md#bulk-license" >}}), і [як використовувати ліцензію, якої немає у списку SPDX]({{< relref "faq.md#custom-license" >}}). Щоб дізнатися про ці та інші практичні приклади використання, див. ['Як мені...' у розділі Часті Питання]({{< relref "faq.md#howto" >}}).

source: Other sources for more information:
cs: Další zdroje pro více informací:
uk: Інші джерела для отримання додаткової інформації:

source: Our [Frequently Asked Questions](https://reuse.software/faq) covers common questions as well as extraordinary cases and will constantly be updated.
cs: Naše [Často kladené otázky](https://reuse.software/faq) pokrývají běžné otázky i mimořádné případy a budou neustále aktualizovány.
uk: Наші [Часті запитання](https://reuse.software/faq) охоплюють типові запитання, а також неординарні випадки й будуть постійно оновлюватися.

source: The [REUSE Specification](https://reuse.software/spec) may aid you in gaining a full understanding of REUSE.
cs: [Specifikace REUSE](https://reuse.software/spec) vám může pomoci v plném pochopení REUSE.
uk: [Специфікація REUSE](https://reuse.software/spec) може допомогти вам отримати повне уявлення про REUSE.

source: The [REUSE tool documentation](https://reuse.readthedocs.io/) describes installation and usage of the REUSE tool.
cs: Instalaci a použití nástroje REUSE popisuje [dokumentace k nástroji REUSE](https://reuse.readthedocs.io/).
ru: В [документации по инструменту REUSE](https://reuse.readthedocs.io/) описаны установка и использование инструмента REUSE.
uk: У [документації до засобу REUSE](https://reuse.readthedocs.io/) описано як установити та користуватися засобом REUSE.

source: Our [help for developers](https://reuse.software/dev/) lists various resources for programmers like the tool, the API, or how to include checks in CI/CD workflows.
cs: V naší [nápovědě pro vývojáře](https://reuse.software/dev/) jsou uvedeny různé zdroje pro programátory, jako je nástroj, rozhraní API nebo jak zahrnout kontroly do pracovních postupů CI/CD.
ru: В разделе [Помощь разработчикам](https://reuse.software/dev/) перечислены различные ресурсы для программистов, такие как инструмент, API или способы включения проверок в рабочие процессы CI/CD.
uk: У нашій [довідці для розробників](https://reuse.software/dev/) перелічено різні ресурси для програмістів, як-от інструменти, API або те, як включити перевірки в робочі процеси CI/CD.

source: If none of the links above were able to answer your question, please contact us by:
cs: Pokud vám žádný z výše uvedených odkazů nedokázal odpovědět na vaši otázku, kontaktujte nás:
ru: Если ни одна из приведенных выше ссылок не помогла вам ответить на ваш вопрос, свяжитесь с нами по адресу:
uk: Якщо жодне з наведених посилань не відповідає на ваше запитання, зв'яжіться з нами за допомогою:

source: opening an issue on [reuse-website](https://github.com/fsfe/reuse-website) for questions on the tutorial, FAQ or specification;
cs: otevření problému na [reuse-website](https://github.com/fsfe/reuse-website) pro dotazy k tutoriálu, FAQ nebo specifikaci;
uk: відкриття теми на [reuse-website](https://github.com/fsfe/reuse-website) для запитань щодо підручника, поширених запитань або специфікацій;

source: opening an issue on [reuse-tool](https://github.com/fsfe/reuse-tool) for questions on the REUSE tool;
ru: открытие темы на [reuse-tool](https://github.com/fsfe/reuse-tool) для вопросов по инструменту REUSE;
uk: відкриття обговорення на [reuse-tool](https://github.com/fsfe/reuse-tool) для запитань про засіб REUSE;

source: or [sending an email to the FSFE](https://fsfe.org/about/contact.html). Please note that we would prefer issues because they are publicly searchable for other people.
ru: или [отправить письмо в FSFE](https://fsfe.org/about/contact.html). Пожалуйста, обратите внимание, что мы предпочитаем выпуски, поскольку они доступны для публичного поиска другим людям.
uk: або [надіславши електронного листа до FSFE](https://fsfe.org/about/contact.html). Зауважте, що ми надаємо перевагу обговоренням, оскільки вони доступні для загального пошуку для інших людей.

source: Thank you for your valuable contribution towards making software reusable!
cs: Děkujeme vám za váš cenný příspěvek k opakovanému použití softwaru!
ru: Спасибо за ваш ценный вклад в создание многократно используемого программного обеспечения!
uk: Дякуємо вам за ваш цінний внесок у створення програмного забезпечення для повторного використання!

source: REUSE Practices – Version 1.2
cs: Použití REUSE – Verze 1.2
uk: Практики REUSE - версія 1.2

source: 1. Provide the exact text of each license used
cs: 1. Uveďte přesný text každé použité licence
uk: 1. Надайте точний текст кожної використаної ліцензії

source: Free and open source software licenses are standardised and have standard texts. Regardless of which license you use, you should include the license text in your project. You should also include the license text of any code which may be under a different license, and it's important you do not change the license text on other software you include.
cs: Licence svobodného a otevřeného softwaru jsou standardizované a mají standardní texty. Bez ohledu na to, jakou licenci používáte, měli byste do projektu zahrnout text licence. Měli byste také zahrnout text licence jakéhokoli kódu, který může být pod jinou licencí, a je důležité, abyste neměnili text licence na jiném softwaru, který zahrnete.
uk: Ліцензії на вільне та відкрите програмне забезпечення стандартизовані та мають стандартні тексти. Незалежно від того, яку ліцензію ви використовуєте, ви повинні включити текст ліцензії у свій проєкт. Ви також повинні додати текст ліцензії будь-якого коду, який може бути під іншою ліцензією, і важливо, щоб ви не змінювали текст ліцензії на іншому програмному забезпеченні, яке ви додаєте.

source: If your project only includes code licensed under a single license, you may provide the text of this license in a file in the top level directory of your repository with the name `LICENSE`, `LICENCE` or `COPYING` (you may attach some suffix to the filename as well, such as `LICENSE.md`, if relevant).
cs: Pokud váš projekt obsahuje pouze kód licencovaný v rámci jedné licence, můžete poskytnout text této licence v souboru v adresáři nejvyšší úrovně vašeho úložiště s názvem `LICENSE`, `LICENCE` nebo `COPYING` (můžete připojit přípona také k názvu souboru, např. `LICENSE.md`, pokud je to relevantní).
uk: Якщо ваш проєкт містить лише код, ліцензований за однією ліцензією, ви можете надати текст цієї ліцензії у файлі у каталозі верхнього рівня вашого репозиторію з назвою `LICENSE`, `LICENCE` або `COPYING` (ви також можете додати до назви файлу якийсь суфікс, наприклад, `LICENSE.md`, якщо це доречно).

source: Since many projects include code under different licenses, it's often not feasible to include all licenses in the top level, in which case you should create a directory at the top level called `LICENSES` within which you include the license text of each license used.
cs: Protože mnoho projektů obsahuje kód pod různými licencemi, často není možné zahrnout všechny licence do nejvyšší úrovně. V takovém případě byste měli vytvořit adresář na nejvyšší úrovni s názvem `LICENCE`, do kterého zahrnete text licence každé použité licence.
uk: Оскільки багато проєктів містять код під різними ліцензіями, часто неможливо включити всі ліцензії до верхнього рівня, у цьому випадку вам слід створити на верхньому рівні каталог з назвою `LICENSES`, до якого ви включите текст ліцензії кожної використаної ліцензії.

source: You must include all licenses which are used in your project, and you must never change any license texts even if they are very similar to existing ones.
cs: Musíte zahrnout všechny licence, které jsou použity ve vašem projektu, a nikdy nesmíte měnit žádné texty licencí, i když jsou velmi podobné těm stávajícím.
uk: Ви повинні включити всі ліцензії, які використовуються у вашому проєкті, і ви ніколи не повинні змінювати тексти ліцензій, навіть якщо вони дуже схожі на наявні.

source: Some licenses, like the BSD 2 Clause license, must be adapted to include the name of the copyright holder in the license text. Your project may end up including multiple versions of the same BSD 2 Clause license because some parts may be written by Alice and others by Bob, resulting in two different license files, even if the only difference is the copyright holder.
cs: Některé licence, jako je licence BSD 2 Clause, musí být upraveny tak, aby obsahovaly jméno držitele autorských práv v textu licence. Váš projekt může skončit včetně více verzí stejné licence BSD 2 Clause, protože některé části mohou být napsány Alice a jiné Bobem, což vede ke dvěma různým licenčním souborům, i když jediným rozdílem je držitel autorských práv.
uk: Деякі ліцензії, такі як ліцензія BSD 2 Clause, мають бути адаптовані, щоб включити ім'я власника авторських прав у текст ліцензії. Ваш проєкт може включати декілька версій однієї ліцензії BSD 2 Clause, тому що деякі частини можуть бути написані Алісою, а інші - Бобом, що призведе до появи двох різних файлів ліцензії, навіть якщо єдиною відмінністю є власник авторських прав.

source: > ### Keep in mind >
cs: > ### Mějte na paměti >
uk: > ### Пам'ятайте >

source: > * Don't change any license texts, use the verbatim form of the license text. > * Don't remove any license texts, include the license texts of all software. > * Keep the filename of the licenses consistent, so you can refer to it > from the source code files.
cs: > * Neměňte žádné licenční texty, použijte doslovnou formu textu licence. > * Neodstraňujte žádné licenční texty, zahrňte licenční texty veškerého softwaru. > * Udržujte názvy souborů licencí konzistentní, abyste na ně mohli odkazovat > ze souborů zdrojového kódu.
uk: > * Не змінюйте текст ліцензії, використовуйте дослівну форму тексту ліцензії. > * Не видаляйте жодних текстів ліцензій, додайте тексти ліцензій до всього програмного забезпечення. > * Зберігайте однакову назву файлів ліцензій, щоб ви могли посилатися на них > з файлів початкового коду.

source: 2. Include a copyright notice and license in each file
cs: 2. Do každého souboru zahrňte poznámku o autorských právech a licenci
uk: 2. Додайте повідомлення про авторські права та ліцензію до кожного файлу
