Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: Comparison of license compliance projects
cs: Srovnání projektů na dodržování licencí
uk: Порівняння проєктів ліцензійної відповідності

source: It is easy to get confused by the multitude of initiatives and tools that help with software license compliance. Provided below is a short and incomplete overview of some noteworthy projects.
cs: V množství iniciativ a nástrojů, které pomáhají s dodržováním softwarových licencí, je snadné se zmýlit. Níže uvádíme stručný a neúplný přehled některých pozoruhodných projektů.
uk: Легко заплутатися в безлічі ініціатив та інструментів, які допомагають дотримуватися ліцензії на програмне забезпечення. Далі наведено короткий і неповний огляд деяких помітних проєктів.

source: REUSE does not intend to replace, but rather complement them. We try to solve unclear and missing license and copyright information at the very source. We empower developers to ensure proper and exhaustive licensing of their project.
cs: REUSE je nechce nahradit, ale spíše doplnit. Snažíme se řešit nejasné a chybějící informace o licencích a autorských právech přímo u zdroje. Umožňujeme vývojářům zajistit správné a vyčerpávající licencování jejich projektu.
uk: REUSE не має наміру замінювати, а скоріше доповнювати їх. Ми намагаємося допомогти пояснити незрозумілу та відсутню інформацію про ліцензію та авторські права в самому джерелі. Ми надаємо розробникам можливість забезпечити належне та вичерпне ліцензування свого проєкту.

source: [**SPDX**](https://spdx.org) is the rock upon which REUSE is built. SPDX defines a standardized way to share copyright and licensing information between projects and people. Read more in [our FAQ](/faq/#what-is-spdx).
cs: [**SPDX**](https://spdx.org) je základem, na kterém je postaveno REUSE. SPDX definuje standardizovaný způsob sdílení informací o autorských právech a licencích mezi projekty a lidmi. Více informací najdete v [našich FAQ](/faq/#what-is-spdx).
uk: [**SPDX**](https://spdx.org) — це фундамент, на якому побудовано REUSE. SPDX визначає стандартизований спосіб обміну відомостями про авторські права та ліцензування між проєктами та людьми. Докладніше читайте в [наших поширених запитаннях](/faq/#what-is-spdx).

source: [**ClearlyDefined**](https://clearlydefined.io) collects and displays meta and security information about a large number of projects distributed on different package registries. It also motivates developers and curators to extend data about a project's licensing and copyright situation. REUSE in comparison concentrates on fixing the problem at the file level for individual projects, which in turn will ease ClearlyDefined's efforts.
cs: [**ClearlyDefined**](https://clearlydefined.io) shromažďuje a zobrazuje metainformace a bezpečnostní informace o velkém počtu projektů distribuovaných v různých registrech balíčků. Motivuje také vývojáře a správce k rozšíření údajů o licenční a autorskoprávní situaci projektu. REUSE se oproti tomu soustředí na řešení problému na úrovni souborů jednotlivých projektů, což zase usnadní práci ClearlyDefined.
uk: [**ClearlyDefined**](https://clearlydefined.io) збирає та показує метадані та інформацію про безпеку великої кількості проєктів, розподілених у різних реєстрах пакетів. Це також мотивує розробників і кураторів розширювати дані про ліцензування проєкту та ситуацію з авторськими правами. REUSE у порівнянні зосереджено на розв'язанні проблем на рівні файлу для окремих проєктів, що, своєю чергою, полегшить зусилля ClearlyDefined.

source: [**OpenChain**](https://www.openchainproject.org) focuses on making Free Software license compliance more transparent, predictable, and understandable for participants in the software supply chain. OpenChain recommends REUSE as one component to increase clarity of the licensing and copyright situation, but has higher requirements to achieve full conformance.
cs: [**OpenChain**](https://www.openchainproject.org) se zaměřuje na zprůhlednění, předvídatelnost a srozumitelnost dodržování licencí svobodného softwaru pro účastníky dodavatelského řetězce softwaru. OpenChain doporučuje REUSE jako jednu ze složek pro zvýšení přehlednosti situace v oblasti licencí a autorských práv, ale má vyšší požadavky na dosažení plné shody.
uk: [**OpenChain**](https://www.openchainproject.org) зосереджується на тому, щоб зробити відповідність ліцензії на вільне програмне забезпечення прозорішою, передбачуванішою та зрозумілішою для учасників ланцюга постачання програмного забезпечення. OpenChain рекомендує REUSE як один з компонентів для спрощення зрозумілості ситуації з ліцензуванням та авторським правом, але вимогливіший для досягнення повної відповідності.

source: [**FOSSology**](https://www.fossology.org) is a toolkit for Free Software compliance. It stores information in a database, and includes license, copyright and export scanners. It is more complex than REUSE and its tool, and rather optimized for compliance officers and lawyers. REUSE instead intends to have all licensing and copyright information stored in or next to the source files to safeguard this information when reused elsewhere. Projects that are REUSE-compliant have their licensing information detected much more easily by FOSSology (specifically its `Ojo` agent).
cs: [**FOSSology**](https://www.fossology.org) je sada nástrojů pro zajištění shody se svobodným softwarem. Ukládá informace do databáze a obsahuje skenery licencí, autorských práv a exportů. Je složitější než REUSE a jeho nástroj a je spíše optimalizován pro úředníky pro dodržování předpisů a právníky. REUSE místo toho zamýšlí, aby všechny informace o licencích a autorských právech byly uloženy ve zdrojových souborech nebo vedle nich, aby byly tyto informace chráněny při dalším použití jinde. Projekty, které jsou v souladu s REUSE, mají své licenční informace mnohem snadněji detekovány pomocí FOSSology (konkrétně jeho agentem `Ojo`).
uk: [**FOSSology**](https://www.fossology.org) - це інструментарій для дотримання вимог щодо вільного програмного забезпечення. Він зберігає інформацію в базі даних і містить сканер ліцензій, авторських прав та експортні сканери. Це складніше, ніж REUSE та його інструмент, і скоріше оптимізований для фахівців з питань дотримання правових норм та юристів. Натомість REUSE має намір зберігати всю інформацію про ліцензування та авторські права у початкових файлах або поруч з ними, щоб захистити цю інформацію за повторного використання в інших місцях. Проєкти, сумісні з REUSE, мають інформацію про ліцензування, яку FOSSology (зокрема, її агент `Ojo`) виявляє набагато легше.

source: [**ORT**](https://oss-review-toolkit.org/), the OSS Review Toolkit, is a set of tools that complement existing compliance projects. Its scanner tool runs the license scanner of your choice on the source code of projects and their transitive dependencies. If these are REUSE-compliant, it will be much easier for ORT to correctly determine the licenses of all files used in the project.
cs: [**ORT**](https://oss-review-toolkit.org/), OSS Review Toolkit, je sada nástrojů, které doplňují stávající projekty shody. Jeho skenovací nástroj spouští vybraný licenční skener na zdrojovém kódu projektů a jejich přechodných závislostech. Pokud jsou tyto soubory v souladu s REUSE, bude pro ORT mnohem snazší správně určit licence všech souborů použitých v projektu.
uk: [**ORT**](https://oss-review-toolkit.org/), Інструментарій для аналізу OSS, - це набір інструментів, які доповнюють наявні проєкти з комплаєнсу. Інструмент сканера запускає сканер ліцензій на ваш вибір на вихідному коді проєктів та їхніх транзитивних залежностей. Якщо вони сумісні з REUSE, ORT буде набагато легше правильно визначити ліцензії всіх файлів, що використовуються в проєкті.

source: [**AboutCode**](https://aboutcode.org/) is a stack of Software Composition Analysis tools, most pertinently among them the [ScanCode Toolkit](https://github.com/nexB/scancode-toolkit). These tools detect licensing information and generate an inventory of components. Projects that are REUSE-compliant have their licensing information detected much more easily by ScanCode.
cs: [**AboutCode**](https://aboutcode.org/) je sada nástrojů pro analýzu složení softwaru, mezi nimiž je nejvýznamnější [ScanCode Toolkit](https://github.com/nexB/scancode-toolkit). Tyto nástroje zjišťují licenční informace a vytvářejí soupis komponent. U projektů, které jsou v souladu s REUSE, se pomocí nástroje ScanCode mnohem snadněji zjišťují licenční informace.
uk: [**AboutCode**](https://aboutcode.org/) - це набір інструментів для аналізу складу програмного забезпечення, серед яких найдоречніший — [ScanCode Toolkit](https://github.com/nexB/scancode-toolkit). Ці інструменти виявляють інформацію про ліцензування та створюють інвентаризацію компонентів. У проєктах, які відповідають вимогам REUSE, інформацію про ліцензії набагато легше виявити за допомогою ScanCode.

source: Help for developers
cs: Pomoc pro vývojáře
uk: Довідка для розробників

source: Licensing should be easy for developers. We provide several tools and services to allow you to concentrate on coding.
cs: Licencování by mělo být pro vývojáře snadné. Poskytujeme několik nástrojů a služeb, které vám umožní soustředit se na kódování.
uk: Ліцензування має бути простим для розробників. Ми надаємо кілька інструментів і послуг, які дозволять вам зосередитися на написанні коду.

source: Contents: [Helper tool](#tool), [example repositories](#repos), [REUSE API](#api), [CI/CD workflows](#ci)
cs: Obsah: [Pomocný nástroj](#tool), [Příklad repozitářů](#repos), [REUSE API](#api), [CI/CD workflow](#ci)
uk: Зміст: [Допоміжний інструмент](#tool), [приклади репозиторіїв](#repos), [REUSE API](#api), [Робочі процеси CI/CD](#ci)

source: REUSE Tool {#tool}
uk: Інструмент REUSE {#tool}

source: The [REUSE tool](https://github.com/fsfe/reuse-tool) assists with achieving and confirming REUSE compliance. It downloads the full license texts, adds copyright and license information to file headers, and contains a linter to identify problems. Eventually, you can generate a software bill of materials.
uk: Інструмент [REUSE tool](https://github.com/fsfe/reuse-tool) допомагає досягти та підтвердити відповідність REUSE. Він завантажує повні тексти ліцензій, додає інформацію про авторські права та ліцензії до заголовків файлів і містить лінтер для виявлення проблем. Зрештою, ви можете згенерувати специфікацію програмного забезпечення.

source: Read the [documentation](https://reuse.readthedocs.io) to learn more about the tool. You will also find a ['How do I ...' in our FAQ]({{< relref "faq.md#howto" >}}) to learn about various tool interactions.
cs: Přečtěte si [dokumentaci](https://reuse.readthedocs.io) a zjistěte více o tomto nástroji. V ["Jak mohu ..." našich často kladených dotazech]({{< relref "faq.md#howto" >}}) se dozvíte o různých interakcích nástroje.
uk: Прочитайте [документацію](https://reuse.readthedocs.io), щоб дізнатися більше про інструмент. Ви також знайдете розділ ["Як мені..."] у наших поширених запитаннях ({{< relref "faq.md#howto">}}), щоб дізнатися про різні взаємодії інструментів.

source: Example repositories {#repos}
cs: Příklad repozitářů {#repos}
uk: Приклад репозиторіїв {#repos}

source: What does a REUSE-compliant project look like? The following repositories are basic, but each of them is REUSE-compliant. We make them available to demonstrate how REUSE works in practice.
cs: Jak vypadá projekt v souladu s REUSE? Následující úložiště jsou základní, ale každé z nich je v souladu s REUSE. Dáváme je k dispozici, abychom ukázali, jak REUSE funguje v praxi.
uk: Як виглядає проєкт, сумісний з REUSE? Ці репозиторії базові, але кожен з них відповідає REUSE. Ми робимо їх доступними, щоб продемонструвати, як REUSE працює на практиці.

source: [reuse-tutorial-example](https://codeberg.org/fsfe/reuse-tutorial-example) - a REUSE-compliant repository that matches the example in [the tutorial]({{< relref "tutorial.md" >}}). Includes a non-compliant branch for testing.
cs: [reuse-tutorial-example](https://codeberg.org/fsfe/reuse-tutorial-example) - úložiště vyhovující pravidlům REUSE, které odpovídá příkladu v [tutoriálu]({{< relref "tutorial.md" >}}). Obsahuje větev nevyhovující požadavkům pro testování.
uk: [reuse-tutorial-example](https://codeberg.org/fsfe/reuse-tutorial-example) - REUSE-сумісний репозиторій, який відповідає прикладу у [посібнику]({{< relref "tutorial.md" >}}). Містить несумісну гілку для тестування.

source: [reuse-tool](https://github.com/fsfe/reuse-tool) - the helper tool itself is compliant, just like [all other REUSE repositories](https://git.fsfe.org/reuse/).
uk: [reuse-tool](https://github.com/fsfe/reuse-tool) - сам допоміжний інструмент є сумісним, так само як і [всі інші репозиторії REUSE](https://git.fsfe.org/reuse/).

source: Consider registering your project with the [REUSE API](#api) to include a dynamic compliance badge.
cs: Zvažte registraci svého projektu v rozhraní [REUSE API](#api), abyste mohli zahrnout dynamický odznak shody.
uk: Подумайте про реєстрацію проєкту в [REUSE API](#api), щоб додати відзнаку динамічної відповідності.

source: The [REUSE API](https://api.reuse.software) helps you to continuously check and display compliance with the REUSE guidelines. You can include a badge indicating the live status in your README file, and parse the output using the generated JSON file.
cs: Rozhraní [REUSE API](https://api.reuse.software) vám pomůže průběžně kontrolovat a zobrazovat dodržování pokynů REUSE. Do souboru README můžete zahrnout odznak označující živý stav a výstup analyzovat pomocí vygenerovaného souboru JSON.
uk: [REUSE API](https://api.reuse.software) допомагає вам постійно перевіряти та показувати відповідність настановам REUSE. Ви можете включити відзнаку, що вказує на поточний стан, у свій файл README і проаналізувати вихідні дані за допомогою згенерованого файлу JSON.

source: This is how the badge will look like for a REUSE compliant project. You can click on the badge to see more information: [![REUSE status](https://api.reuse.software/badge/git.fsfe.org/reuse/api)](https://api.reuse.software/info/git.fsfe.org/reuse/api)
cs: Takto bude vypadat odznak pro projekt, který je v souladu se směrnicí REUSE. Kliknutím na odznak se zobrazí další informace: [![REUSE status](https://api.reuse.software/badge/git.fsfe.org/reuse/api)](https://api.reuse.software/info/git.fsfe.org/reuse/api)
uk: Ось який вигляд матиме відзнака для проєкту, сумісного з REUSE. Ви можете натиснути на неї, щоб побачити більше відомостей: [![ Стан REUSE](https://api.reuse.software/badge/git.fsfe.org/reuse/api)](https://api.reuse.software/info/git.fsfe.org/reuse/api)

source: The API is the perfect tool for everyone who wants to show that their repository follows best practices in providing licensing and copyright information. It allows third-party services to integrate the live REUSE status, and offers a simple alternative for people who do not want to install the [REUSE tool](#tool) for a first quick check.
cs: Rozhraní API je dokonalým nástrojem pro všechny, kteří chtějí prokázat, že jejich úložiště dodržuje osvědčené postupy při poskytování informací o licencích a autorských právech. Umožňuje službám třetích stran integrovat živý stav REUSE a nabízí jednoduchou alternativu pro lidi, kteří nechtějí instalovat nástroj [REUSE](#tool) pro první rychlou kontrolu.
uk: API є ідеальним інструментом для всіх, хто хоче показати, що їхній репозиторій дотримується найкращих практик у наданні відомостей про ліцензування та авторські права. Він дозволяє стороннім службам інтегрувати поточний стан REUSE і пропонує просту альтернативу для людей, які не хочуть встановлювати [REUSE tool](#tool) для першої швидкої перевірки.

source: As everything else in REUSE, the API is [publicly available](https://git.fsfe.org/reuse/api) under Free Software licenses.
cs: Stejně jako vše ostatní v REUSE je API [veřejně dostupné](https://git.fsfe.org/reuse/api) pod licencemi svobodného softwaru.
uk: Як і все інше в REUSE, API [загальнодоступний](https://git.fsfe.org/reuse/api) під ліцензіями вільного програмного забезпечення.

source: You can automatically run `reuse lint` on every commit as a pre-commit hook for Git. This uses [pre-commit](https://pre-commit.com/). Once you [have it installed](https://pre-commit.com/#install), add this to the `.pre-commit-config.yaml` in your repository:
cs: Při každé revizi můžete automaticky spustit `reuse lint` jako hook před revizí pro systém Git. Používá se [pre-commit](https://pre-commit.com/). Jakmile jej [nainstalujete](https://pre-commit.com/#install), přidejte jej do souboru `.pre-commit-config.yaml` ve svém úložišti:
uk: Ви можете автоматично запускати `reuse lint` під час кожного коміту як хук передкоміту для Git. Для цього використовується [pre-commit](https://pre-commit.com/). Після того, як ви [встановите його](https://pre-commit.com/#install), додайте `.pre-commit-config.yaml` до вашого репозиторію:

source: Then run `pre-commit install`. Now, every time you commit, `reuse lint` is run in the background, and will prevent your commit from going through if there was an error.
cs: Poté spusťte `pre-commit install`. Nyní se při každé revizi na pozadí spustí `reuse lint`, který zabrání revizi, pokud se vyskytne chyba.
uk: Потім запустіть `pre-commit install`. Тепер за кожного коміту `reuse lint` запускається у фоновому режимі, і не дозволить вашому коміту виконатися, якщо сталася помилка.

source: Inclusion in CI/CD workflows {#ci}
cs: Zařazení do pracovních postupů CI/CD {#ci}
uk: Включення в робочі процеси CI/CD {#ci}

source: REUSE can be easily integrated into your existing CI/CD processes to continuously test your repository and its changes for REUSE compliance.
cs: REUSE lze snadno integrovat do stávajících procesů CI/CD a průběžně testovat úložiště a jeho změny na shodu s REUSE.
uk: REUSE можна легко інтегрувати у ваші наявні процеси CI/CD, щоб постійно тестувати ваш репозиторій та його зміни на відповідність вимогам REUSE.

source: The FSFE offers a Docker image which can be used in numerous CI solutions. Find a few examples below:
cs: FSFE nabízí obraz Docker, který lze použít v mnoha řešeních CI. Níže najdete několik příkladů:
uk: FSFE пропонує образ Docker, який можна використовувати в багатьох рішеннях CI. Знайдіть кілька прикладів нижче:

source: Include the following snippet in your `.drone.yml` file:
uk: Додайте цей фрагмент у файл `.drone.yml`:

source: # SPDX-FileCopyrightText: 2020 Free Software Foundation Europe e.V. # SPDX-License-Identifier: CC0-1.0 steps: - name: reuse image: fsfe/reuse:latest
uk: # SPDX-FileCopyrightText: 2020 Free Software Foundation Europe e.V. # SPDX-License-Identifier: CC0-1.0 кроки: - ім'я: reuse зображення: fsfe/reuse:latest

source: More information about Drone on [drone.io](https://drone.io).
uk: Докладніше про Drone на [drone.io](https://drone.io).

source: GitHub users can integrate the REUSE action in their workflow. Include the following file as `.github/workflows/reuse.yaml`:
cs: Uživatelé GitHub mohou akci REUSE integrovat do svých pracovních postupů. Zařaďte následující soubor jako `.github/workflows/reuse.yaml`:
uk: Користувачі GitHub можуть інтегрувати дію REUSE у свій робочий процес. Включіть цей файл як `.github/workflows/reuse.yaml`:

source: Visit the [action's marketplace page](https://github.com/marketplace/actions/reuse-compliance-check) for more usage instructions.
cs: Další pokyny k použití naleznete na stránce ['action's marketplace page'](https://github.com/marketplace/actions/reuse-compliance-check).
uk: Відвідайте [сторінку маркетплейсу «action»](https://github.com/marketplace/actions/reuse-compliance-check), щоб отримати додаткові інструкції з використання.

source: More information about GitHub Actions on [docs.github.com](https://docs.github.com/en/actions/).
uk: Докладніше про GitHub Actions на [docs.github.com](https://docs.github.com/en/actions/).

source: Include the following snippet in your `.gitlab-ci.yml` file:
cs: Do souboru `.gitlab-ci.yml` vložte následující úryvek:
uk: Додайте цей фрагмент у файл `.gitlab-ci.yml`:

source: # SPDX-FileCopyrightText: 2020 Free Software Foundation Europe e.V. # SPDX-License-Identifier: CC0-1.0 reuse: image: name: fsfe/reuse:latest entrypoint: [""] script: - reuse lint
uk: # SPDX-FileCopyrightText: 2020 Free Software Foundation Europe e.V. # SPDX-License-Identifier: CC0-1.0 reuse: зображення: ім'я: fsfe/reuse:latest точка входу: [""] скрипт: - reuse lint

source: More information about GitLab's CI on [docs.gitlab.com](https://docs.gitlab.com/ce/ci/).
uk: Докладніше про CI GitLab на [docs.gitlab.com](https://docs.gitlab.com/ce/ci/).

source: Include the following snippet in your `.travis.yml` file:
cs: Do souboru `.travis.yml` vložte následující úryvek:
uk: Додайте цей фрагмент у файл `.travis.yml`:

source: # SPDX-FileCopyrightText: 2020 Free Software Foundation Europe e.V. # SPDX-License-Identifier: CC0-1.0 language: minimal services: - docker before_install: - docker pull fsfe/reuse:latest - docker run -v ${TRAVIS_BUILD_DIR}:/data fsfe/reuse:latest lint
uk: # SPDX-FileCopyrightText: 2020 Free Software Foundation Europe e.V. # SPDX-License-Identifier: CC0-1.0 мова: minimal служби: - docker before_install: - docker pull fsfe/reuse:latest - docker run -v ${TRAVIS_BUILD_DIR}:/data fsfe/reuse:latest lint

source: More information on Travis CI on [travis-ci.com](https://travis-ci.com).
uk: Докладніше про Travis CI на [travis-ci.com](https://travis-ci.com).

source: Resources
cs: Zdroje
uk: Ресурси

source: You have already explored parts of the REUSE universe and would like to go one step further? Read more background, get in touch with the community and help us spread the word!
cs: Už jste prozkoumali některé části vesmíru REUSE a chtěli byste se posunout o krok dál? Přečtěte si další podklady, spojte se s komunitou a pomozte nám šířit informace!
uk: Ви вже досліджували частини всесвіту REUSE і хотіли б зробити наступний крок? Прочитайте більше інформації, зв’яжіться зі спільнотою та допоможіть нам поширити інформацію!

source: {{< component fa="fas fa-users" headline="Get in touch" id="contact" >}} Just like Free Software, the REUSE project is based on its community and the people who support and adopt it. Become part of it by joining the [mailing list](https://lists.fsfe.org/mailman/listinfo/reuse) to get to know other users, and influence the way REUSE evolves. Likewise, you can directly contact the REUSE coordinators throughout our mailing list. {{< /component >}}
cs: {{< component fa="fas fa-users" headline="Kontaktujte nás" id="kontakt" >}} Stejně jako svobodný software je i projekt REUSE založen na své komunitě a lidech, kteří jej podporují a přijímají. Staňte se její součástí tím, že se připojíte k [mailing listu](https://lists.fsfe.org/mailman/listinfo/reuse), abyste se seznámili s ostatními uživateli a ovlivnili vývoj projektu REUSE. Stejně tak se můžete obrátit přímo na koordinátory projektu REUSE prostřednictvím naší poštovní konference. {{< /component >}}
uk: {{< component fa="fas fa-users" headline="Get in touch" id="contact" >}} Як і вільне програмне забезпечення, проєкт REUSE опирається на спільноту та людей, які його підтримують і приймають. Станьте частиною них, приєднавшись до [списку розсилки,](https://lists.fsfe.org/mailman/listinfo/reuse) щоб познайомитися з іншими користувачами та впливати на розвиток REUSE. Так само, ви можете безпосередньо зв'язатися з координаторами REUSE через наш список розсилки. {{< /component >}}
