Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: Some licenses are [less permissive than others](#copyleft-permissive-license), meaning that a combined work containing code under both licenses must effectively respect the terms of the least permissive license.
cs: Některé licence jsou [méně permisivní než jiné](#copyleft-permissive-license), což znamená, že kombinované dílo obsahující kód pod oběma licencemi musí fakticky respektovat podmínky nejméně permisivní licence.
uk: Деякі ліцензії є [менш дозвільними, ніж інші](#copyleft-permissive-license), що означає, що робота, яка поєднує код під обома ліцензіями, повинен ефективно дотримуватися умов найменш дозвільної ліцензії.

source: Some licenses have mutually exclusive requirements. For example, the [CC-BY-NC-4.0](https://creativecommons.org/licenses/by-nc/4.0/) license has a clause that disallows a work to be used for commercial purposes, and the [GPL-3.0-or-later](https://www.gnu.org/licenses/gpl-3.0.html) has a clause that says that you may not impose additional restrictions that aren't in the GPL license. Because the GPL license has no clause regarding commercial purposes, these two licenses cannot be respected simultaneously, and they are considered incompatible.
cs: Některé licence mají vzájemně se vylučující požadavky. Například licence [CC-BY-NC-4.0](https://creativecommons.org/licenses/by-nc/4.0/) má klauzuli, která zakazuje použití díla ke komerčním účelům, a licence [GPL-3.0-or-later](https://www.gnu.org/licenses/gpl-3.0.html) má klauzuli, která říká, že nesmíte ukládat další omezení, která nejsou v licenci GPL. Protože licence GPL nemá žádnou klauzuli týkající se komerčních účelů, nelze tyto dvě licence respektovat současně a jsou považovány za neslučitelné.
uk: Деякі ліцензії мають взаємозаперечні вимоги. Наприклад, ліцензія [CC-BY-NC-4.0](https://creativecommons.org/licenses/by-nc/4.0/) має пункт, який забороняє використовувати роботу з комерційною метою, а [GPL-3.0- або новіша](https://www.gnu.org/licenses/gpl-3.0.html) має пункт, який говорить, що ви не можете накладати додаткові обмеження, яких немає в ліцензії GPL. Оскільки в ліцензії GPL немає пункту про комерційні цілі, цих двох ліцензій не можна дотримуватися одночасно, і вони вважаються несумісними.

source: Exactly which licenses are compatible is a difficult question, and it also depends on what you want. Integrating work that is licensed differently may mean having to respect license terms which you do not want to respect.
cs: Otázka, které licence jsou přesně kompatibilní, je obtížná a závisí také na tom, co chcete. Integrace díla, které je licencováno jinak, může znamenat nutnost respektovat licenční podmínky, které nechcete respektovat.
uk: Які саме ліцензії сумісні — це складне питання, і воно також залежить від того, чого ви хочете. Інтеграція роботи, яка має іншу ліцензію, може означати необхідність дотримуватися умов ліцензії, яких ви не бажаєте дотримуватися.

source: Specifically as pertains to the GNU GPL, [this GNU article](https://www.gnu.org/licenses/license-compatibility.html) and [GNU's license list](https://www.gnu.org/licenses/license-list.html) may help you work out compatibility.
cs: Pokud jde konkrétně o licenci GNU GPL, mohou vám při řešení kompatibility pomoci [tento článek o GNU](https://www.gnu.org/licenses/license-compatibility.html) a [seznam licencí GNU](https://www.gnu.org/licenses/license-list.html).
uk: Зокрема, щодо GNU GPL, [ця стаття GNU](https://www.gnu.org/licenses/license-compatibility.html) і [список ліцензій GNU](https://www.gnu.org/licenses/license-list.html) можуть допомогти вам розв'язати питання сумісності.

source: It is important to note that REUSE does not help you resolve license compatibility. REUSE's goal is to help you comprehensively declare your licensing metadata, not to check whether that metadata is correct or valid. You need different tools and processes for that.
cs: Je důležité si uvědomit, že funkce REUSE nepomáhá řešit kompatibilitu licencí. Cílem systému REUSE je pomoci vám komplexně deklarovat vaše licenční metadata, nikoli kontrolovat, zda jsou tato metadata správná nebo platná. K tomu potřebujete jiné nástroje a postupy.
uk: Важливо зазначити, що REUSE не допоможе вам розв'язати питання сумісності ліцензій. Мета REUSE — допомогти вам всебічно декларувати ваші метадані ліцензування, а не перевіряти, чи є ці метадані правильними або дійсними. Для цього потрібні різні інструменти та процеси.

source: Where else do I put my license information? {#where-else}
cs: Kam jinam mohu vložit údaje o své licenci? {#where-else}
ru: Где еще я могу разместить информацию о своей лицензии? {#where-else}
uk: Де ще можна розмістити відомості про ліцензію? {#where-else}

source: Marking all individual files with `SPDX-License-Identifier` tags goes a long way towards unambiguously communicating the license information of your project, but it helps to communicate the license information in natural language as well. In the README of your project, feel free to provide a summary of the licensing information, or simply redirect the reader to your `LICENSES/` directory.
cs: Označení všech jednotlivých souborů značkami `SPDX-License-Identifier` přispívá k jednoznačnému sdělení licenčních informací vašeho projektu, ale pomáhá také sdělit licenční informace v přirozeném jazyce. V README svého projektu můžete uvést shrnutí licenčních informací nebo jednoduše přesměrovat čtenáře do adresáře `LICENSES/`.
ru: Пометка всех отдельных файлов тегами `SPDX- Лицензия-Идентификатор` поможет однозначно передать лицензионную информацию вашего проекта, но также полезно передавать лицензионную информацию на естественном языке. В README вашего проекта не стесняйтесь предоставить краткое изложение лицензионной информации или просто перенаправить читателя в каталог `ЛИЦЕНЗИЯ/`.
uk: Позначення всіх окремих файлів тегами `SPDX-License-Identifier` проходить тривалий шлях до однозначної передачі ліцензійної інформації вашого проєкту, але це також допомагає донести інформацію про ліцензію природною мовою. У README вашого проєкту не соромтеся надавати підсумкові відомості про свою ліцензію або просто перенаправляйте читачів до вашого каталогу `LICENSES/`.

source: Additionally, many package hosting sites expect that you declare the licensing information of your package. For instance, the [pyproject.toml file of the REUSE tool](https://github.com/fsfe/reuse-tool/blob/main/pyproject.toml) declares all the licenses that it uses in the format expected by the Python packaging infrastructure.
uk: Крім того, багато сайтів хостингу пакунків очікують, що ви вкажете інформацію про ліцензування вашого пакунка. Наприклад, [файл pyproject.toml інструменту REUSE](https://github.com/fsfe/reuse-tool/blob/main/pyproject.toml) декларує всі ліцензії, які він використовує, у форматі, очікуваному інфраструктурою пакунків Python.

source: I only have a single license file. Should I still create a LICENSES directory? {#single-license}
cs: Mám pouze jeden licenční soubor. Mám ještě vytvořit adresář LICENSES? {#single-license}
ru: У меня есть только один файл лицензии. Должен ли я по-прежнему создавать каталог ЛИЦЕНЗИИ? {#одиночная лицензия}
uk: У мене лише один файл ліцензії. Чи все одно потрібно створювати каталог LICENSES? {#single-license}

source: Yes. This may seem extraneous, but it prevents future confusion when differently licensed code is adopted. By keeping all licenses in a single directory, it is easy for a user of your program to find all the licenses they need to comply with in the blink of an eye.
cs: Ano. Může se to zdát zbytečné, ale zabrání to budoucím zmatkům, až bude přijat kód s jinou licencí. Díky tomu, že jsou všechny licence uloženy v jediném adresáři, může uživatel vašeho programu snadno mrknutím oka najít všechny licence, které musí dodržovat.
ru: Да. Это может показаться излишним, но это предотвращает будущую путаницу при использовании кода с разными лицензиями. Храня все лицензии в одном каталоге, пользователь вашей программы может легко найти все лицензии, которые ему необходимо соблюдать, в мгновение ока.
uk: Так. Це може здатися зайвим, але це запобігає плутанині в майбутньому, коли приймається код під іншою ліцензією. Зберігаючи всі ліцензії в одному каталозі, користувачеві вашої програми легко знайти всі ліцензії, яких вони одночасно повинні дотримуватися.

source: However, in addition to that, you can keep your `LICENSE`/`COPYING` file if you want. See [this question](#tradition).
cs: Kromě toho si však můžete ponechat soubor `LICENSE`/`COPYING`, pokud chcete. Viz [tato otázka](#tradition).
uk: Однак, на додаток до цього, ви можете зберегти свій файл `LICENSE`/`COPYING`, якщо хочете. Перегляньте [це питання](#tradition).

source: Should I put comment headers in my license files? {#header-in-license}
cs: Mám do licenčních souborů vkládat hlavičky s komentáři? {#header-in-license}
ru: Нужно ли помещать заголовки комментариев в файлы лицензий? {#заголовок в лицензии}
uk: Чи слід класти заголовки коментарів у файли ліцензій? {#header-in-license}

source: You should not edit license files. Please see [this question](#edit-license).
cs: Licenční soubory byste neměli upravovat. Viz [tato otázka](#edit-license).
ru: Не следует редактировать файлы лицензий. Пожалуйста смотрите [этот вопрос](#редактировать-лицензию).
uk: Не слід редагувати файли ліцензій. Перегляньте [це питання](#edit-license).

source: Should I edit my license files? {#edit-license}
cs: Mám upravit své licenční soubory? {#edit-license}
ru: Нужно ли редактировать файлы лицензии? {#редакт. лицензия}
uk: Чи потрібно редагувати файли ліцензії? {#edit-license}

source: You should never edit license files. When you use an existing license, you should always copy it verbatim.
cs: Licenční soubory byste nikdy neměli upravovat. Pokud používáte existující licenci, měli byste ji vždy doslovně zkopírovat.
ru: Никогда не редактируйте файлы лицензий. Когда вы используете существующую лицензию, вы всегда должны копировать ее дословно.
uk: Ніколи не редагуйте файли ліцензій. Коли ви використовуєте чинну ліцензію, ви завжди повинні копіювати її дослівно.

source: Some licenses, such as MIT and the BSD family of licenses, have a line that says "Copyright (c) [year] [copyright holder]". Please see [this question](#license-templates) about how to deal with those licenses.
cs: Některé licence, jako například licence MIT a rodina licencí BSD, obsahují řádek "Copyright (c) [year] [copyright holder]". O tom, jak s těmito licencemi zacházet, se dočtete v [this question](#license-templates).
uk: Деякі ліцензії, такі як MIT і сімейство ліцензій BSD, мають рядок "Авторське право (c) [рік] [власник авторських прав]". Прочитайте [це питання](#license-templates) про те, як працювати з цими ліцензіями.

source: There are many reasons for why you should not alter license texts, but if you do alter the texts, you should use a different SPDX identifier for this license. See [this question](#custom-license).
cs: Existuje mnoho důvodů, proč byste neměli měnit texty licencí, ale pokud je měníte, měli byste pro tuto licenci použít jiný identifikátor SPDX. Viz [tato otázka](#custom-license).
uk: Існує багато причин, чому ви не повинні змінювати тексти ліцензії, але якщо ви все ж таки змінюєте тексти, ви повинні використовувати інший ідентифікатор SPDX для цієї ліцензії. Перегляньте [це питання](#custom-license).

source: Can I edit copyright notices and license disclaimers? {#edit-copyright-and-licensing}
cs: Mohu upravovat upozornění na autorská práva a prohlášení o vyloučení licence? {#edit-copyright-and-licensing}
ru: Могу ли я редактировать уведомления об авторских правах и отказы от лицензий? {#редакт. авторское право и лицензирование}
uk: Чи можна редагувати повідомлення про авторські права та відмову від відповідальності? {#edit-copyright-and-licensing}

source: If you find out that some information is incorrect, you are free to adjust it. Otherwise, it is usually a good idea to leave copyright notices and license disclaimers intact. But there is no one-size-fits-all answer here.
cs: Pokud zjistíte, že některé informace jsou nesprávné, můžete je upravit. V opačném případě je obvykle dobré ponechat oznámení o autorských právech a prohlášení o vyloučení licence nedotčená. Neexistuje však žádná univerzální odpověď.
ru: Если вы обнаружите, что какая-то информация неверна, вы можете исправить ее. В противном случае, как правило, лучше оставить уведомления об авторских правах и отказы от лицензий нетронутыми. Но универсального ответа здесь нет.
uk: Якщо ви виявите, що якісь відомості неправильні, ви можете доповнити їх. В іншому випадку, як правило, краще лишити повідомлення про авторські права та ліцензії відмови від відповідальності недоторканими. Але тут немає єдиної відповіді.

source: Can I remove the license and copyright information from minified code (e.g., JavaScript)? {#minified}
cs: Mohu z minifikovaného kódu (např. JavaScriptu) odstranit informace o licenci a autorských právech? {#minified}
ru: Можно ли удалить лицензию и информацию об авторских правах из минифицированного кода (например, JavaScript)? {#минифицированный}
uk: Чи можу я вилучити ліцензію та відомості про авторські права з мініфікованого коду (наприклад, JavaScript)? {#minified}

source: You can, but you probably should not. Many minifiers have an option that allows you to retain the header comment. If this option is present, you should use it, especially if you use a license that mandates that you include a license disclaimer.
cs: Můžete, ale pravděpodobně byste neměli. Mnoho minifierů má možnost, která umožňuje zachovat komentář v záhlaví. Pokud je tato možnost k dispozici, měli byste ji použít, zejména pokud používáte licenci, která nařizuje zahrnout zřeknutí se licence.
ru: Можно, но, скорее всего, не стоит. Многие минификаторы имеют опцию, позволяющую сохранить комментарий к заголовку. Если такая опция есть, вам следует ею воспользоваться, особенно если вы используете лицензию, которая требует включения отказа от лицензии.
uk: Ви можете, але, ймовірно, не потрібно. Багато мініфікаторів мають опцію, яка дає змогу зберегти коментар заголовка. Якщо цей параметр присутній, його слід використовувати, особливо якщо ви використовуєте ліцензію, яка передбачає включення відмови від відповідальності за ліцензію.

source: Do I need to include both GPL-3.0-or-later and GPL-3.0-only in my repository? {#gpl-plus}
cs: Musím do svého repozitáře zahrnout jak GPL-3.0-or-later, tak GPL-3.0-only? {#gpl-plus}
ru: Должен ли я включать в свой репозиторий как GPL-3.0-или-позднее, так и GPL-3.0- только? {#gpl-плюс}
uk: Чи потрібно включати до свого репозиторію і «GPL-3.0-or-later», так і «GPL-3.0-only»? {#gpl-plus}

source: Members of the GPL family are listed separately in the SPDX License List as -only and -or-later, even though the license texts are identical. If you have code under only one of these licenses, we recommend that you only include that one license.
cs: Členové rodiny GPL jsou v seznamu licencí SPDX uvedeni zvlášť jako -only a -or-later, i když texty licencí jsou totožné. Pokud máte kód pouze pod jednou z těchto licencí, doporučujeme uvést pouze tuto licenci.
ru: Члены семейства GPL перечислены в Списке лицензий SPDX отдельно как - только и -или-позднее, хотя тексты лицензий идентичны. Если у вас есть код только под одной из этих лицензий, мы рекомендуем включать только эту лицензию.
uk: Ліцензії GPL перераховані окремо у списку ліцензій SPDX як -only, так і -or-later, навіть якщо тексти ліцензій ідентичні. Якщо у вас є код лише під однією з цих ліцензій, радимо включити лише таку ж ліцензію.

source: If you have code under both an -only license and an -or-later license, we recommend that you include both licenses separately.
cs: Pokud máte kód pod licencí -only i pod licencí -or-later, doporučujeme uvést obě licence zvlášť.
ru: Если у вас есть код как под лицензией -одна, так и под лицензией -или-позже, мы рекомендуем вам включить обе лицензии отдельно.
uk: Якщо у вас є код і за ліцензією -only, і за ліцензією -or-later, радимо включити обидві ліцензії окремо.

source: If I use exclusively LGPL-3.0-or-later, should I also include the GPL-3.0-or-later text? {#lgpl-only}
cs: Pokud používám výhradně licenci LGPL-3.0 nebo pozdější, měl bych do ní zahrnout také text GPL-3.0 nebo pozdější? {#lgpl-only}
uk: Якщо я застосовую виключно LGPL-3.0 або новішу версію, чи повинен я також додавати текст GPL-3.0 або новішої версії? {#lgpl-only}

source: The LGPL license text is an addendum to the GPL license text. If you provide _only_ the LGPL license text to your downstream, you are effectively not providing them with the full license. For that reason, you should also provide the GPL-3.0-or-later license in your `LICENSES/` directory. The REUSE linter may complain that none of your files use the GPL-3.0-or-later license. To solve that, pick one file to be licensed under `LGPL-3.0-or-later OR GPL-3.0-or-later`.
cs: Text licence LGPL je dodatkem k textu licence GPL. Pokud poskytnete navazujícím uživatelům _pouze_ text licence LGPL, neposkytnete jim ve skutečnosti úplnou licenci. Z tohoto důvodu byste měli v adresáři `LICENSES/` poskytnout také licenci GPL-3.0 nebo pozdější. Linter REUSE si může stěžovat, že žádný z vašich souborů nepoužívá licenci GPL-3.0-or-later. To vyřešíte tak, že vyberete jeden soubor, který bude licencován pod `LGPL-3.0-or-later OR GPL-3.0-or-later`.
uk: Текст ліцензії LGPL є доповненням до тексту ліцензії GPL. Якщо ви надаєте _лише_ текст ліцензії LGPL своїм подальшим користувачам, ви фактично не надаєте їм повну ліцензію. З цієї причини, вам також слід надати ліцензію GPL-3.0 або новішої версії у вашому каталозі `LICENSES/`. Лінтер REUSE може поскаржитися, що жоден з ваших файлів не використовує ліцензію GPL-3.0 або новішої версії. Щоб вирішити цю проблему, виберіть один файл, який буде ліцензовано на умовах `LGPL-3.0- або новішої версії АБО GPL-3.0- або новішої версії`.

source: Does REUSE help me with the licenses of my dependencies? {#dependencies-licenses}
cs: Pomáhá mi REUSE s licencemi mých závislostí? {#dependencies-licenses}
uk: Чи може REUSE допомогти мені з ліцензіями моїх залежностей? {#dependencies-licenses}

source: No, that is out of scope for REUSE. If you need to check whether your project respects the licenses of all its dependencies, or whether you didn't inadvertently pull in a dependency with an unwanted license, you need different tools and processes. Some tools listed on the [comparison page]({{< ref "/comparison.md" >}}) may help you.
cs: Ne, to je mimo oblast působnosti programu REUSE. Pokud potřebujete zkontrolovat, zda váš projekt respektuje licence všech svých závislostí, nebo zda jste nechtěně nezapojili závislost s nežádoucí licencí, potřebujete jiné nástroje a postupy. Pomoci vám mohou některé nástroje uvedené na [comparison page]({{< ref "/comparison.md" >}}).
uk: Ні, це виходить за рамки REUSE. Якщо вам потрібно перевірити, чи дотримується ваш проєкт ліцензій усіх своїх залежностей, або якщо ви ненавмисно підтягнули залежність з небажаною ліцензією, вам знадобляться інші інструменти та процеси. Деякі інструменти, перелічені на [сторінці порівняння]({{< ref "/comparison.md" >}}) можуть вам допомогти.

source: How do I ... {#howto}
cs: Jak mohu ... {#howto}
uk: Як мені ... {#howto}

source: ... install the REUSE tool? {#install-tool}
cs: ... nainstalovat nástroj REUSE? {#install-tool}
uk: ... встановити інструмент REUSE? {#install-tool}

source: See the installation instructions and accompanying tool documentation at <https://reuse.readthedocs.io/en/stable/readme.html#install>. The short of it is:
cs: Pokyny k instalaci a doprovodnou dokumentaci k nástroji naleznete na adrese <https://reuse.readthedocs.io/en/stable/readme.html#install>. Stručně řečeno:
uk: Дивіться інструкції зі встановлення та супровідну документацію на <https://reuse.readthedocs.io/en/stable/readme.html#install>. Коротко кажучи:

source: ... create a software bill of materials {#bill-of-materials}
cs: ... vytvořit softwarovou soupisku {#bill-of-materials}
uk: ... створити специфікацію програмного забезпечення {#bill-of-materials}

source: ... add copyright and licensing information to an uncommentable file? {#uncommentable-file}
cs: ... přidat informace o autorských právech a licencích do souboru, který nelze komentovat? {#uncommentable-file}
uk: ... додати інформацію про авторські права та ліцензування до некоментованого файлу? {#uncommentable-file}

source: Binary files such as images or videos or certain text files such as JSON cannot be commented with a REUSE header, but they should still have copyright and licensing information.
cs: Binární soubory, jako jsou obrázky nebo videa, nebo některé textové soubory, například JSON, nelze komentovat záhlavím REUSE, ale přesto by měly obsahovat informace o autorských právech a licencích.
uk: Двійкові файли, такі як зображення чи відео, або певні текстові файли, такі як JSON, не можна коментувати за допомогою заголовка REUSE, але вони все одно повинні містити інформацію про авторські права та ліцензування.

source: There are two ways of associating information with such a file:
cs: Existují dva způsoby přiřazení informací k takovému souboru:
uk: Існує два способи пов'язати інформацію з таким файлом:

source: Add a file next to it with the suffix `.license` (e.g. `cat.jpg.license` for a file called `cat.jpg`) and write the comment header in that file. The contents of the original file are subsequently ignored, which may be handy in some cases.
cs: Přidejte vedle něj soubor s příponou `.license` (např. `cat.jpg.license` pro soubor s názvem `cat.jpg`) a zapište do něj hlavičku komentáře. Obsah původního souboru bude následně ignorován, což se může v některých případech hodit.
uk: Додайте поруч файл із суфіксом `.license` (наприклад, `cat.jpg.license` для файлу з назвою `cat.jpg`) і напишіть заголовок коментаря в цьому файлі. Вміст вихідного файлу ігнорується, що може бути зручно в деяких випадках.

source: License the file via [`REUSE.toml`](#bulk-license), a REUSE configuration file.
cs: Soubor licencujte pomocí [`REUSE.toml`](#bulk-license), konfiguračního souboru REUSE.
uk: Ліцензуйте файл за допомогою [`REUSE.toml`](#bulk-license), файлу конфігурації REUSE.

source: ... bulk-license whole directories? {#bulk-license}
cs: ... hromadné licencování celých adresářů? {#bulk-license}
uk: ... ліцензувати цілі каталоги? {#bulk-license}

source: Where possible, you should add REUSE headers to every file. However, there are some scenarios where it is undesirable or impossible to add a REUSE header to every single file in a directory. For example:
cs: Pokud je to možné, měli byste ke každému souboru přidat záhlaví REUSE. V některých případech je však nežádoucí nebo nemožné přidat záhlaví REUSE ke každému souboru v adresáři. Například:
uk: Де це можливо, слід додавати заголовки REUSE до кожного файлу. Однак існують сценарії, коли додавання заголовка REUSE до кожного окремого файлу в каталозі є небажаним або неможливим. Наприклад:

source: You are not allowed to edit the files (because they are test files, or come from a third party).
cs: Soubory nesmíte upravovat (protože se jedná o testovací soubory nebo pocházejí od třetí strany).
uk: Ви не маєте права редагувати файли (оскільки вони є тестовими або отримані від третьої сторони).

source: Adding `.license` files would break the build system, especially for images and video.
cs: Přidání souborů `.license` by narušilo systém sestavování, zejména v případě obrázků a videa.
uk: Додавання файлів `.license` порушить систему збирання, особливо для зображень та відео.
