Repository: fsfe/reuse-website
Catalog: site/po/*.po
Languages: cs, ru, uk

source: {{< component fa="fas fa-rocket" headline="REUSE Booster">}} To help even more projects adopt the REUSE best practices, we have initiated [REUSE Booster](/booster/): a program that gives Free Software projects the opportunity to reach out to us and receive help by the FSFE’s licensing experts. Our REUSE Booster team is also actively reaching out to projects. With individual assessments and direct technical assistance, we boost the communication of licensing and copyright information. {{< /component >}}
cs: {{< component fa="fas fa-rocket" headline="REUSE Booster">}} Abychom pomohli ještě více projektům přijmout osvědčené postupy REUSE, zahájili jsme [REUSE Booster](/booster/): program, který dává projektům svobodného softwaru možnost obrátit se na nás a získat pomoc odborníků FSFE na licencování. Náš tým REUSE Booster také aktivně oslovuje projekty. Pomocí individuálních posouzení a přímé technické pomoci posilujeme komunikaci informací o licencích a autorských právech. {{< /component >}}
uk: {{< component fa="fas fa-rocket" headline="REUSE Booster">}} Щоб допомогти ще більшій кількості проєктів впровадити найкращі практики REUSE, ми ініціювали [REUSE Booster](/booster/): програму, яка надає вільним проєктам можливість зв'язатися з нами та отримати допомогу експертів з ліцензування FSFE. Наша команда REUSE Booster також активно працює з проєктами. За допомогою індивідуальних оцінок та прямої технічної підтримки, ми сприяємо поширенню інформації про ліцензування та авторське право. {{< /component >}}

source: {{< component fa="fas fa-info-circle" headline="Latest news">}} REUSE evolves rapidly thanks to its active community. Have a look at the [latest official news](https://fsfe.org/tags/tagged-reuse.html). Also make sure to sign up the [mailing list](https://lists.fsfe.org/mailman/listinfo/reuse) to stay up-to-date with the most important discussions. {{< /component >}}
cs: {{< component fa="fas fa-info-circle" headline="Nejnovější zprávy">}} REUSE se rychle vyvíjí díky své aktivní komunitě. Podívejte se na [nejnovější oficiální zprávy](https://fsfe.org/tags/tagged-reuse.html). Nezapomeňte se také přihlásit do [mailing listu](https://lists.fsfe.org/mailman/listinfo/reuse), abyste byli informováni o nejdůležitějších diskusích. {{< /component >}}
uk: {{< component fa="fas fa-info-circle" headline="Останні новини">}} REUSE швидко розвивається завдяки своїй активній спільноті. Читайте [останні офіційні новини](https://fsfe.org/tags/tagged-reuse.html). Обов'язково підпишіться на [список розсилання](https://lists.fsfe.org/mailman/listinfo/reuse), щоб бути в курсі найважливіших обговорень. {{< /component >}}

source: {{< component fa="fas fa-exchange-alt" headline="Similar initiatives">}} There are many initiatives working on Free Software licensing and compliance. REUSE contributes to this effort but does not replace tools and best practices in other places of the compliance chain. Have a look at [other projects](/comparison) we collaborate with and their specifics. {{< /component >}}
cs: {{< component fa="fas fa-exchange-alt" headline="Podobné iniciativy">}} Existuje mnoho iniciativ, které se zabývají licencováním a dodržováním pravidel svobodného softwaru. REUSE přispívá k tomuto úsilí, ale nenahrazuje nástroje a osvědčené postupy na jiných místech řetězce shody. Podívejte se na [další projekty](/comparison), se kterými spolupracujeme, a na jejich specifika. {{< /component >}}
uk: {{< component fa="fas fa-exchange-alt" headline="Схожі ініціативи">}} Існує багато ініціатив, які працюють над відповідності ліцензій вільного програмного забезпечення. REUSE допомагає у цій роботі, але не замінює засоби й найкращі практики перевірки відповідності. Перегляньте [інші проєкти](/comparison), з якими ми співпрацюємо, та їхні особливості. {{< /component >}}

source: {{< component fa="far fa-comments" headline="Spread the word">}} The more projects understand and adopt REUSE, the easier use and re-use of software is for everyone. Please feel free to use ready material to spread the word. The [REUSE graphics](https://git.fsfe.org/reuse/reuse-ci/) can be used under a Creative Commons license. Different versions and file formats of the REUSE video are directly [available on our download server](https://download.fsfe.org/videos/reuse/). {{< /component >}}
cs: {{< component fa="far fa-comments" headline="Šíření informací">}} Čím více projektů pochopí a přijme REUSE, tím snazší bude používání a opakované použití softwaru pro všechny. Neváhejte prosím použít připravený materiál k šíření této informace. Grafiku [REUSE](https://git.fsfe.org/reuse/reuse-ci/) lze používat pod licencí Creative Commons. Různé verze a formáty souborů videa REUSE jsou přímo [k dispozici na našem serveru ke stažení](https://download.fsfe.org/videos/reuse/). {{< /component >}}
uk: {{< component fa="far fa-comments" headline="Поширення інформації">}} Чим більше проєктів розуміють і застосовують REUSE, тим простіше повторне користування програмним забезпеченням для всіх. Не соромтеся користуватися готовим матеріалом для поширення інформації. [REUSE graphics](https://git.fsfe.org/reuse/reuse-ci/) може використовуватися за ліцензією Creative Commons. Різні версії та формати файлів відео REUSE безпосередньо [доступні на нашому сервері завантаження](https://download.fsfe.org/videos/reuse/). {{< /component >}}

source: Supporters
cs: Podporovatelé
uk: Прихильники

source: We are grateful for everyone who supports REUSE. The ever-growing ecosystem of specification, documentation, helper tool, API and a lot more demands time and funds. Thanks to volunteers, cooperating organisations and projects, as well as corporate sponsors, REUSE can constantly evolve and improve.
cs: Jsme vděční za každého, kdo podporuje projekt REUSE. Neustále se rozrůstající ekosystém specifikací, dokumentace, pomocných nástrojů, API a mnoha dalších věcí vyžaduje čas a finanční prostředky. Díky dobrovolníkům, spolupracujícím organizacím a projektům i firemním sponzorům se REUSE může neustále vyvíjet a zlepšovat.
uk: Ми вдячні всім, хто підтримує REUSE. Постійно розширювана екосистема специфікацій, документації, допоміжного засобу, API та інше вимагає часу та коштів. Завдяки волонтерам, організаціям і проєктам, які з нами співпрацюють, а також корпоративним спонсорам, REUSE може постійно розвиватися і вдосконалюватися.

source: Users and adopters
cs: Uživatelé a osvojitelé
uk: Користувачі та прихильники

source: A project that follows the REUSE best practices makes its licensing and copyright situation transparent, ensures that third-party code is attributed correctly, and makes it easily re-usable for other developers. Because REUSE does not require a registration and can even be used offline, we don't have precise user statistics. Below you can find some we know of.
cs: Projekt, který se řídí osvědčenými postupy REUSE, zprůhledňuje situaci v oblasti licencí a autorských práv, zajišťuje správné přiřazení kódu třetích stran a umožňuje jeho snadné opakované použití jinými vývojáři. Protože projekt REUSE nevyžaduje registraci a lze jej používat i offline, nemáme k dispozici přesné statistiky uživatelů. Níže najdete některé, o kterých víme.
uk: Проєкт, який дотримується найкращих практик REUSE, робить свою ситуацію з ліцензуванням та авторськими правами прозорою, гарантує, що сторонній код правильно атрибутується, і допомагає легко повторно використовувати його іншим розробникам. Оскільки REUSE не вимагає реєстрації та може використовуватися навіть в офлайн, ми не маємо точної статистики користувачів. Нижче ви можете знайти деякі з них, про які ми знаємо.

source: All 1000+ [compliant projects](https://api.reuse.software/projects) of the REUSE API
cs: Všech více než 1000 [kompatibilních projektů](https://api.reuse.software/projects) rozhraní REUSE API
uk: Всі 1000+ [сумісних проєктів](https://api.reuse.software/projects) з REUSE API

source: Many projects of the [EU-funded Next Generation Internet project](https://fsfe.org/activities/ngi/) we help to become REUSE compliant from the start.
cs: Mnohým projektům [projektu Next Generation Internet financovaného EU](https://fsfe.org/activities/ngi/) pomáháme, aby byly od počátku v souladu s REUSE.
uk: Багатьом проєктам [фінансованих проєктом ЄС "Інтернет наступного покоління"](https://fsfe.org/activities/ngi/) ми допомагаємо стати сумісними з REUSE з самого початку.

source: The KDE community made REUSE the standard for its [licensing policy](https://community.kde.org/Policies/Licensing_Policy#License_Statements). Also read [this interview](https://fsfe.org/news/2020/news-20201215-01.html) about their rationale and path.
cs: Komunita KDE stanovila REUSE jako standard pro svou [licenční politiku](https://community.kde.org/Policies/Licensing_Policy#License_Statements). Přečtěte si také [tento rozhovor](https://fsfe.org/news/2020/news-20201215-01.html) o jejich důvodech a cestě.
uk: Спільнота KDE зробила REUSE стандартом для своєї [ліцензійної політики](https://community.kde.org/Policies/Licensing_Policy#License_Statements). Також читайте [це інтерв'ю](https://fsfe.org/news/2020/news-20201215-01.html) про їхнє обґрунтування та шлях.

source: Corporate licensing policies of Siemens, SAP, Huawei, Liferay and many more.
cs: Firemní licenční politiky společností Siemens, SAP, Huawei, Liferay a mnoha dalších.
uk: Корпоративні ліцензійні політики Siemens, SAP, Huawei, Liferay та багатьох інших.

source: Large parts of the Linux Kernel with ~70% by now.
cs: Velké části linuxového jádra s ~ 70 % již nyní.
uk: Значна частина ядра Linux на цей час має ~70%.

source: [You?](/tutorial/)
cs: [Vy?](/tutorial/)
uk: [Ви?](/tutorial/)

source: If your community or company has implemented REUSE but is not listed, feel free to [contact us](/resources/#contact).
cs: Pokud vaše komunita nebo společnost zavedla systém REUSE, ale není v seznamu uvedena, neváhejte nás [kontaktovat](/resources/#contact).
uk: Якщо ваша громада чи компанія впровадила REUSE, але її немає у списку, [зв'яжіться з нами](/resources/#contact).

source: Corporate Sponsors
cs: Firemní sponzoři
uk: Корпоративні спонсори

source: We kindly invite companies to adopt and support REUSE. As standardised and simple best practices for declaring copyright and licensing information largely improve internal compliance processes, we are happy if corporate actors contribute back to REUSE.
cs: Vyzýváme společnosti, aby přijaly a podpořily REUSE. Jelikož standardizované a jednoduché osvědčené postupy pro deklarování informací o autorských právech a licencích do značné míry zlepšují interní procesy dodržování předpisů, budeme rádi, pokud firemní subjekty přispějí zpět do systému REUSE.
uk: Ми запрошуємо компанії приймати та підтримувати REUSE. Оскільки стандартизовані та прості найкращі методи зазначення даних про авторські права та ліцензування значно покращують внутрішні процеси дотримання вимог, ми раді, якщо корпоративні суб’єкти зроблять свій внесок у REUSE.

source: If your company is interested in becoming a REUSE sponsor, [please approach us](/resources/#contact).
cs: Pokud má vaše společnost zájem stát se sponzorem projektu REUSE, [kontaktujte nás](/resources/#contact).
uk: Якщо ваша компанія зацікавлена стати спонсором REUSE, [будь ласка, зверніться до нас](/resources/#contact).

source: Frequently Asked Questions
cs: Často kladené dotazy
ru: Часто задаваемые вопросы
uk: Часті запитання

source: This page lists common questions and their answers when dealing with licensing and copyright, and with the adoption of REUSE specifically. Please note that nothing here is legal advice.
cs: Na této stránce jsou uvedeny běžné otázky a odpovědi na ně, které se týkají licencí a autorských práv, a konkrétně přijetí REUSE. Vezměte prosím na vědomí, že nic z toho není právním poradenstvím.
uk: На цій сторінці перераховані загальні питання та відповіді на них, пов'язані з ліцензуванням і авторським правом, а також з впровадженням REUSE зокрема. Зауважте, що ця інформація не є правничою консультацією.

source: General {#general}
cs: Obecné {#general}
ru: Общее {#general}
uk: Загальне {#general}

source: I am short on time. Can you give me the quickest possible summary? {#quick-summary}
cs: Mám málo času. Můžete mi poskytnout co nejrychlejší shrnutí? {#quick-summary}
ru: У меня мало времени. Можете ли вы дать мне самое краткое изложение? {#quick-summary}
uk: Мені не вистачає часу. Чи можете ви дати мені якнайшвидші підсумки? {#quick-summary}

source: We want to improve the way that people license their software projects such that it is **easy, comprehensive, unambiguous, and machine-readable**. We propose three steps to achieve this:
cs: Chceme zlepšit způsob licencování softwarových projektů tak, aby bylo **jednoduché, komplexní, jednoznačné a strojově čitelné**. Navrhujeme tři kroky, jak toho dosáhnout:
uk: Ми хочемо вдосконалити спосіб, у який люди ліцензують свої програмні проєкти, щоб він був **простим, всеосяжним, однозначним і машинозчитуваним**. Ми пропонуємо три кроки для досягнення цієї мети:

source: 1. Choose and provide licenses {#step-1}
cs: 1. Výběr a poskytnutí licencí {#step-1}
ru: 1. Выберите и предоставьте лицензии {#step-1}
uk: 1. Виберіть і надайте ліцензії {#step-1}

source: Choose a [Free Software](https://fsfe.org/about/basics/freesoftware) license for your project. Find the SPDX identifier of your license in the [SPDX License List](https://spdx.org/licenses/). Download the license text for your license from the [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) repository and put it in the `LICENSES/` directory.
cs: Vyberte si pro svůj projekt licenci [Free Software](https://fsfe.org/about/basics/freesoftware). V seznamu [Seznam licencí SPDX](https://spdx.org/licenses/) vyhledejte identifikátor licence SPDX. Stáhněte si text licence pro svou licenci z úložiště [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) a vložte jej do adresáře `LICENSES/`.
ru: Выберите лицензию [Free Software](https://fsfe.org/about/basics/freesoftware) для своего проекта. Найдите идентификатор SPDX вашей лицензии в [Списке лицензий SPDX](https://spdx.org/licenses/). Загрузите текст для вашей лицензии из репозитория [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) и поместите его в каталог `LICENSES/` .
uk: Оберіть ліцензію [Free Software](https://fsfe.org/about/basics/freesoftware) для вашого проєкту. Знайдіть ідентифікатор SPDX вашої ліцензії в [списку ліцензії SPDX](https://spdx.org/licenses/). Завантажте текст ліцензії на вашу ліцензію з репозиторію [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) і покладіть її у каталог `LICENSES/`.

source: 2. Add copyright and licensing information to each file {#step-2}
cs: 2. Do každého souboru přidejte informace o autorských právech a licencích {#step-2}
ru: 2. Добавьте в каждый файл информацию об авторских правах и лицензии {#step-2}
uk: 2. Додайте відомості про авторські права та ліцензування до кожного файлу {#step-2}

source: Then, for all files, edit the header to contain the following:
cs: Poté upravte záhlaví všech souborů tak, aby obsahovalo následující údaje:
ru: Затем для всех файлов отредактируйте заголовок, чтобы он содержал следующее:
uk: Потім для всіх файлів змініть заголовок, щоб він містив таке:

source: 3. Confirm REUSE compliance {#step-3}
cs: 3. Potvrďte soulad s pravidly REUSE {#step-3}
ru: 3. Подтвердите соответствие требованиям REUSE {#step-3}
uk: 3. Підтвердьте відповідність повторного використання {#step-3}

source: Use the [REUSE tool](https://github.com/fsfe/reuse-tool) to automate some of these steps, and to check whether you did everything correctly.
ru: Используйте [REUSE tool](https://github.com/fsfe/reuse-tool), чтобы автоматизировать некоторые из этих действий и проверить, все ли вы сделали правильно.
uk: Використовуйте [засіб REUSE](https://github.com/fsfe/reuse-tool) щоб автоматизувати деякі з цих кроків, і перевірити, чи ви зробили все правильно.

source: What is SPDX? {#what-is-spdx}
cs: Co je SPDX? {#what-is-spdx}
ru: Что такое SPDX? {#what-is-spdx}
uk: Що таке SPDX? {#what-is-spdx}

source: SPDX stands for [Software Package Data Exchange](https://spdx.org/). It is a project by the [Linux Foundation](https://www.linuxfoundation.org/) and the rock upon which REUSE is built. SPDX defines a standardised way to share copyright and licensing information between projects and people. Most importantly for REUSE, SPDX maintains the [SPDX License List](https://spdx.org/licenses/), which defines standardised identifiers for a lot of licenses.
cs: SPDX znamená [Software Package Data Exchange](https://spdx.org/). Jedná se o projekt nadace [Linux Foundation](https://www.linuxfoundation.org/), na němž je postaven systém REUSE. SPDX definuje standardizovaný způsob sdílení informací o autorských právech a licencích mezi projekty a lidmi. Pro REUSE je nejdůležitější, že SPDX spravuje [SPDX License List](https://spdx.org/licenses/), který definuje standardizované identifikátory pro mnoho licencí.
uk: SPDX розшифровується як [Software Package Data Exchange](https://spdx.org/). Це проєкт [Linux Foundation](https://www.linuxfoundation.org/) і основа, на якій побудовано REUSE. SPDX визначає стандартизований спосіб обміну інформацією про авторські права та ліцензування між проєктами та людьми. Найважливішим для REUSE, що SPDX підтримує [Список ліцензій SPDX](https://spdx.org/licenses/), який визначає стандартизовані ідентифікатори для багатьох ліцензій.

source: Copyright {#copyright}
cs: Autorská práva {#copyright}
uk: Авторське право {#copyright}

source: What is copyright? {#what-is-copyright}
cs: Co je to autorské právo? {#what-is-copyright}
ru: Что такое авторское право? {#что такое авторское право}
uk: Що таке авторські права? {#what-is-copyright}

source: Copyright is a legal construct that grants someone exclusive rights over a creative work. The most important exclusive right is in the name: The right to produce copies. Only the copyright holder is allowed to give new copies of their work to people. You do not need to do anything to gain copyright. As soon as you make a creative work, you instantly gain copyright over it.
cs: Autorské právo je právní konstrukce, která někomu uděluje výhradní práva k tvůrčímu dílu. Nejdůležitější výhradní právo je obsaženo v názvu: právo na výrobu kopií. Pouze držitel autorských práv smí poskytovat lidem nové kopie svého díla. Pro získání autorských práv nemusíte nic dělat. Jakmile vytvoříte tvůrčí dílo, okamžitě na něj získáte autorská práva.
uk: Авторське право — це юридична конструкція, яка надає комусь виключні права на творчу роботу. Найважливіше виключне право міститься в назві: право на виробництво копій. Тільки власник авторських прав має право давати людям нові копії своєї роботи. Вам не потрібно нічого робити, щоб отримати авторське право. Як тільки ви створюєте творчу роботу, ви миттєво отримуєте авторське право на неї.

source: Usually the author is the copyright holder, but often copyright is transferred to the author's employer.
cs: Obvykle je držitelem autorských práv autor, ale často jsou autorská práva převedena na autorova zaměstnavatele.
uk: Зазвичай автор є власником авторських прав, але часто авторські права передаються роботодавцю автора.

source: Creative Commons provides a better and lengthier answer in their [Frequently Asked Questions](https://creativecommons.org/faq/#what-is-copyright-and-why-does-it-matter).
cs: Creative Commons poskytuje lepší a delší odpověď ve svých [často kladených otázkách](https://creativecommons.org/faq/#what-is-copyright-and-why-does-it-matter).
ru: Организация Creative Commons дает лучший и более подробный ответ в своем разделе [Часто задаваемые вопросы](https://creativecommons.org/faq/#what-is-copyright-and-why-does-it-matter).
uk: Creative Commons надає кращу та довшу відповідь у своїх [Частих запитаннях](https://creativecommons.org/faq/#what-is-copyright-and-why-does-it-matter).

source: If you want others to be able to freely use, study and share your code, you must release it under a license.
cs: Pokud chcete, aby ostatní mohli váš kód volně používat, studovat a sdílet, musíte jej uvolnit pod licencí.
uk: Якщо ви хочете, щоб інші могли вільно використовувати, вивчати та ділитися вашим кодом, ви повинні випустити його під ліцензією.

source: Is there a standard format for declaring copyright? {#standard-copyright}
cs: Existuje standardní formát pro prohlášení o autorských právech? {#standard-copyright}
ru: Существует ли стандартный формат для объявления авторских прав? {#стандарт - авторское право}
uk: Чи існує стандартний формат декларування авторських прав? {#standard-copyright}

source: Generally, we recommend that you use `SPDX-FileCopyrightText: [year] [copyright holder] <[contact address]>`. You may choose to drop items except the copyright holder, which must always be included. We recommend that you include all items, however.
cs: Obecně doporučujeme používat `SPDX-FileCopyrightText: [year] [copyright holder] <[contact address]>`. Můžete se rozhodnout vypustit položky kromě autorských práv držitele autorských práv, které musí být uvedeny vždy. Doporučujeme uvést všechny položky.
uk: Загалом, ми рекомендуємо використовувати `SPDX-FileCopyrightText: [рік] [власник авторських прав] <[контактна адреса]>`. Ви можете опустити всі елементи, окрім власника авторських прав, який завжди має бути включений. Однак ми рекомендуємо включати всі елементи.

source: The specification includes a section on the exact format of the copyright notice. See [the specification](/spec) and [the next question](#copyright-symbol).
cs: Specifikace obsahuje oddíl o přesném formátu oznámení o autorských právech. Viz [the specification](/spec) a [the next question](#copyright-symbol).
ru: В спецификации есть раздел о точном формате уведомления об авторских правах. Смотрите [спецификацию](/спец) и [следующий вопрос](#copyright-symbol).
uk: Специфікація включає розділ із точним форматом повідомлення про авторські права. Дивіться [специфікацію](/spec) та [наступне запитання](#copyright-symbol).

source: Do I use SPDX-FileCopyrightText, Copyright, or ©? {#copyright-symbol}
cs: Mám použít SPDX-FileCopyrightText, Copyright nebo ©? {#copyright-symbol}
ru: Использовать ли мне SPDX-файл с текстом авторского права, авторское право или ©? {#copyright-symbol}
uk: Чи користуюсь я SPDX-FileCopyrightText, авторським правом або ©? {#copyright-symbol}

source: The specification lists the following copyright notices as valid:
cs: Ve specifikaci jsou uvedena následující platná oznámení o autorských právech:
ru: В спецификации указаны следующие уведомления об авторских правах:
uk: Специфікація містить такі повідомлення про авторські права які вважаються чинними:
